<?xml version="1.0" ?>
<policyDefinitions revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions">
  <!--microsoft_edge version: 79.0.309.71-->
  <policyNamespaces>
    <target namespace="Microsoft.Policies.Edge" prefix="microsoft_edge"/>
    <using namespace="Microsoft.Policies.Windows" prefix="windows"/>
  </policyNamespaces>
  <resources minRequiredRevision="1.0"/>
  <supportedOn>
    <definitions>
      <definition displayName="$(string.SUPPORTED_WIN7_V77)" name="SUPPORTED_WIN7_V77"/>
      <definition displayName="$(string.SUPPORTED_WIN7_V78)" name="SUPPORTED_WIN7_V78"/>
      <definition displayName="$(string.SUPPORTED_WIN7_V79)" name="SUPPORTED_WIN7_V79"/>
      <definition displayName="$(string.SUPPORTED_WIN7_ONLY_V77)" name="SUPPORTED_WIN7_ONLY_V77"/>
    </definitions>
  </supportedOn>
  <categories>
    <category displayName="$(string.microsoft_edge)" name="microsoft_edge"/>
    <category displayName="$(string.microsoft_edge_recommended)" name="microsoft_edge_recommended"/>
    <category displayName="$(string.GoogleCast_group)" name="GoogleCast">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.ContentSettings_group)" name="ContentSettings">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.ContentSettings_group)" name="ContentSettings_recommended">
      <parentCategory ref="microsoft_edge_recommended"/>
    </category>
    <category displayName="$(string.DefaultSearchProvider_group)" name="DefaultSearchProvider">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.Extensions_group)" name="Extensions">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.HTTPAuthentication_group)" name="HTTPAuthentication">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.NativeMessaging_group)" name="NativeMessaging">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.PasswordManager_group)" name="PasswordManager">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.PasswordManager_group)" name="PasswordManager_recommended">
      <parentCategory ref="microsoft_edge_recommended"/>
    </category>
    <category displayName="$(string.Printing_group)" name="Printing">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.Printing_group)" name="Printing_recommended">
      <parentCategory ref="microsoft_edge_recommended"/>
    </category>
    <category displayName="$(string.Proxy_group)" name="Proxy">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.SmartScreen_group)" name="SmartScreen">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.SmartScreen_group)" name="SmartScreen_recommended">
      <parentCategory ref="microsoft_edge_recommended"/>
    </category>
    <category displayName="$(string.Startup_group)" name="Startup">
      <parentCategory ref="microsoft_edge"/>
    </category>
    <category displayName="$(string.Startup_group)" name="Startup_recommended">
      <parentCategory ref="microsoft_edge_recommended"/>
    </category>
  </categories>
  <policies>
    <policy class="Both" displayName="$(string.EnableMediaRouter)" explainText="$(string.EnableMediaRouter_Explain)" key="Software\Policies\Microsoft\Edge" name="EnableMediaRouter" presentation="$(presentation.EnableMediaRouter)" valueName="EnableMediaRouter">
      <parentCategory ref="GoogleCast"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ShowCastIconInToolbar)" explainText="$(string.ShowCastIconInToolbar_Explain)" key="Software\Policies\Microsoft\Edge" name="ShowCastIconInToolbar" presentation="$(presentation.ShowCastIconInToolbar)" valueName="ShowCastIconInToolbar">
      <parentCategory ref="GoogleCast"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.DefaultCookiesSetting)" explainText="$(string.DefaultCookiesSetting_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultCookiesSetting" presentation="$(presentation.DefaultCookiesSetting)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DefaultCookiesSetting" valueName="DefaultCookiesSetting">
          <item displayName="$(string.DefaultCookiesSetting_AllowCookies)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.DefaultCookiesSetting_BlockCookies)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.DefaultCookiesSetting_SessionOnly)">
            <value>
              <decimal value="4"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultImagesSetting)" explainText="$(string.DefaultImagesSetting_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultImagesSetting" presentation="$(presentation.DefaultImagesSetting)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DefaultImagesSetting" valueName="DefaultImagesSetting">
          <item displayName="$(string.DefaultImagesSetting_AllowImages)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.DefaultImagesSetting_BlockImages)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultJavaScriptSetting)" explainText="$(string.DefaultJavaScriptSetting_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultJavaScriptSetting" presentation="$(presentation.DefaultJavaScriptSetting)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DefaultJavaScriptSetting" valueName="DefaultJavaScriptSetting">
          <item displayName="$(string.DefaultJavaScriptSetting_AllowJavaScript)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.DefaultJavaScriptSetting_BlockJavaScript)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultPluginsSetting)" explainText="$(string.DefaultPluginsSetting_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultPluginsSetting" presentation="$(presentation.DefaultPluginsSetting)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DefaultPluginsSetting" valueName="DefaultPluginsSetting">
          <item displayName="$(string.DefaultPluginsSetting_BlockPlugins)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.DefaultPluginsSetting_ClickToPlay)">
            <value>
              <decimal value="3"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultPopupsSetting)" explainText="$(string.DefaultPopupsSetting_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultPopupsSetting" presentation="$(presentation.DefaultPopupsSetting)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DefaultPopupsSetting" valueName="DefaultPopupsSetting">
          <item displayName="$(string.DefaultPopupsSetting_AllowPopups)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.DefaultPopupsSetting_BlockPopups)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultNotificationsSetting)" explainText="$(string.DefaultNotificationsSetting_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultNotificationsSetting" presentation="$(presentation.DefaultNotificationsSetting)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DefaultNotificationsSetting" valueName="DefaultNotificationsSetting">
          <item displayName="$(string.DefaultNotificationsSetting_AllowNotifications)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.DefaultNotificationsSetting_BlockNotifications)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.DefaultNotificationsSetting_AskNotifications)">
            <value>
              <decimal value="3"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultGeolocationSetting)" explainText="$(string.DefaultGeolocationSetting_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultGeolocationSetting" presentation="$(presentation.DefaultGeolocationSetting)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DefaultGeolocationSetting" valueName="DefaultGeolocationSetting">
          <item displayName="$(string.DefaultGeolocationSetting_AllowGeolocation)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.DefaultGeolocationSetting_BlockGeolocation)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.DefaultGeolocationSetting_AskGeolocation)">
            <value>
              <decimal value="3"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultWebBluetoothGuardSetting)" explainText="$(string.DefaultWebBluetoothGuardSetting_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultWebBluetoothGuardSetting" presentation="$(presentation.DefaultWebBluetoothGuardSetting)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DefaultWebBluetoothGuardSetting" valueName="DefaultWebBluetoothGuardSetting">
          <item displayName="$(string.DefaultWebBluetoothGuardSetting_BlockWebBluetooth)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.DefaultWebBluetoothGuardSetting_AskWebBluetooth)">
            <value>
              <decimal value="3"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultWebUsbGuardSetting)" explainText="$(string.DefaultWebUsbGuardSetting_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultWebUsbGuardSetting" presentation="$(presentation.DefaultWebUsbGuardSetting)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DefaultWebUsbGuardSetting" valueName="DefaultWebUsbGuardSetting">
          <item displayName="$(string.DefaultWebUsbGuardSetting_BlockWebUsb)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.DefaultWebUsbGuardSetting_AskWebUsb)">
            <value>
              <decimal value="3"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.AutoSelectCertificateForUrls)" explainText="$(string.AutoSelectCertificateForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="AutoSelectCertificateForUrls" presentation="$(presentation.AutoSelectCertificateForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="AutoSelectCertificateForUrlsDesc" key="Software\Policies\Microsoft\Edge\AutoSelectCertificateForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.CookiesAllowedForUrls)" explainText="$(string.CookiesAllowedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="CookiesAllowedForUrls" presentation="$(presentation.CookiesAllowedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="CookiesAllowedForUrlsDesc" key="Software\Policies\Microsoft\Edge\CookiesAllowedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.CookiesBlockedForUrls)" explainText="$(string.CookiesBlockedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="CookiesBlockedForUrls" presentation="$(presentation.CookiesBlockedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="CookiesBlockedForUrlsDesc" key="Software\Policies\Microsoft\Edge\CookiesBlockedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.CookiesSessionOnlyForUrls)" explainText="$(string.CookiesSessionOnlyForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="CookiesSessionOnlyForUrls" presentation="$(presentation.CookiesSessionOnlyForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="CookiesSessionOnlyForUrlsDesc" key="Software\Policies\Microsoft\Edge\CookiesSessionOnlyForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ImagesAllowedForUrls)" explainText="$(string.ImagesAllowedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="ImagesAllowedForUrls" presentation="$(presentation.ImagesAllowedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="ImagesAllowedForUrlsDesc" key="Software\Policies\Microsoft\Edge\ImagesAllowedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ImagesBlockedForUrls)" explainText="$(string.ImagesBlockedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="ImagesBlockedForUrls" presentation="$(presentation.ImagesBlockedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="ImagesBlockedForUrlsDesc" key="Software\Policies\Microsoft\Edge\ImagesBlockedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.JavaScriptAllowedForUrls)" explainText="$(string.JavaScriptAllowedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="JavaScriptAllowedForUrls" presentation="$(presentation.JavaScriptAllowedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="JavaScriptAllowedForUrlsDesc" key="Software\Policies\Microsoft\Edge\JavaScriptAllowedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.JavaScriptBlockedForUrls)" explainText="$(string.JavaScriptBlockedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="JavaScriptBlockedForUrls" presentation="$(presentation.JavaScriptBlockedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="JavaScriptBlockedForUrlsDesc" key="Software\Policies\Microsoft\Edge\JavaScriptBlockedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.PluginsAllowedForUrls)" explainText="$(string.PluginsAllowedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="PluginsAllowedForUrls" presentation="$(presentation.PluginsAllowedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="PluginsAllowedForUrlsDesc" key="Software\Policies\Microsoft\Edge\PluginsAllowedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.PluginsBlockedForUrls)" explainText="$(string.PluginsBlockedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="PluginsBlockedForUrls" presentation="$(presentation.PluginsBlockedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="PluginsBlockedForUrlsDesc" key="Software\Policies\Microsoft\Edge\PluginsBlockedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.PopupsAllowedForUrls)" explainText="$(string.PopupsAllowedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="PopupsAllowedForUrls" presentation="$(presentation.PopupsAllowedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="PopupsAllowedForUrlsDesc" key="Software\Policies\Microsoft\Edge\PopupsAllowedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.PopupsBlockedForUrls)" explainText="$(string.PopupsBlockedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="PopupsBlockedForUrls" presentation="$(presentation.PopupsBlockedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="PopupsBlockedForUrlsDesc" key="Software\Policies\Microsoft\Edge\PopupsBlockedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NotificationsAllowedForUrls)" explainText="$(string.NotificationsAllowedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="NotificationsAllowedForUrls" presentation="$(presentation.NotificationsAllowedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="NotificationsAllowedForUrlsDesc" key="Software\Policies\Microsoft\Edge\NotificationsAllowedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NotificationsBlockedForUrls)" explainText="$(string.NotificationsBlockedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="NotificationsBlockedForUrls" presentation="$(presentation.NotificationsBlockedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="NotificationsBlockedForUrlsDesc" key="Software\Policies\Microsoft\Edge\NotificationsBlockedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.WebUsbAllowDevicesForUrls)" explainText="$(string.WebUsbAllowDevicesForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="WebUsbAllowDevicesForUrls" presentation="$(presentation.WebUsbAllowDevicesForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="WebUsbAllowDevicesForUrls" maxLength="1000000" valueName="WebUsbAllowDevicesForUrls"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.WebUsbAskForUrls)" explainText="$(string.WebUsbAskForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="WebUsbAskForUrls" presentation="$(presentation.WebUsbAskForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="WebUsbAskForUrlsDesc" key="Software\Policies\Microsoft\Edge\WebUsbAskForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.WebUsbBlockedForUrls)" explainText="$(string.WebUsbBlockedForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="WebUsbBlockedForUrls" presentation="$(presentation.WebUsbBlockedForUrls)">
      <parentCategory ref="ContentSettings"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="WebUsbBlockedForUrlsDesc" key="Software\Policies\Microsoft\Edge\WebUsbBlockedForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.RegisteredProtocolHandlers)" explainText="$(string.RegisteredProtocolHandlers_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="RegisteredProtocolHandlers_recommended" presentation="$(presentation.RegisteredProtocolHandlers)">
      <parentCategory ref="ContentSettings_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="RegisteredProtocolHandlers" maxLength="1000000" valueName="RegisteredProtocolHandlers"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultSearchProviderEnabled)" explainText="$(string.DefaultSearchProviderEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultSearchProviderEnabled" presentation="$(presentation.DefaultSearchProviderEnabled)" valueName="DefaultSearchProviderEnabled">
      <parentCategory ref="DefaultSearchProvider"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.DefaultSearchProviderName)" explainText="$(string.DefaultSearchProviderName_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultSearchProviderName" presentation="$(presentation.DefaultSearchProviderName)">
      <parentCategory ref="DefaultSearchProvider"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="DefaultSearchProviderName" maxLength="1000000" valueName="DefaultSearchProviderName"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultSearchProviderKeyword)" explainText="$(string.DefaultSearchProviderKeyword_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultSearchProviderKeyword" presentation="$(presentation.DefaultSearchProviderKeyword)">
      <parentCategory ref="DefaultSearchProvider"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="DefaultSearchProviderKeyword" maxLength="1000000" valueName="DefaultSearchProviderKeyword"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultSearchProviderSearchURL)" explainText="$(string.DefaultSearchProviderSearchURL_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultSearchProviderSearchURL" presentation="$(presentation.DefaultSearchProviderSearchURL)">
      <parentCategory ref="DefaultSearchProvider"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="DefaultSearchProviderSearchURL" maxLength="1000000" valueName="DefaultSearchProviderSearchURL"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultSearchProviderSuggestURL)" explainText="$(string.DefaultSearchProviderSuggestURL_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultSearchProviderSuggestURL" presentation="$(presentation.DefaultSearchProviderSuggestURL)">
      <parentCategory ref="DefaultSearchProvider"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="DefaultSearchProviderSuggestURL" maxLength="1000000" valueName="DefaultSearchProviderSuggestURL"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultSearchProviderEncodings)" explainText="$(string.DefaultSearchProviderEncodings_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultSearchProviderEncodings" presentation="$(presentation.DefaultSearchProviderEncodings)">
      <parentCategory ref="DefaultSearchProvider"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="DefaultSearchProviderEncodingsDesc" key="Software\Policies\Microsoft\Edge\DefaultSearchProviderEncodings" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultSearchProviderImageURL)" explainText="$(string.DefaultSearchProviderImageURL_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultSearchProviderImageURL" presentation="$(presentation.DefaultSearchProviderImageURL)">
      <parentCategory ref="DefaultSearchProvider"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="DefaultSearchProviderImageURL" maxLength="1000000" valueName="DefaultSearchProviderImageURL"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultSearchProviderImageURLPostParams)" explainText="$(string.DefaultSearchProviderImageURLPostParams_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultSearchProviderImageURLPostParams" presentation="$(presentation.DefaultSearchProviderImageURLPostParams)">
      <parentCategory ref="DefaultSearchProvider"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="DefaultSearchProviderImageURLPostParams" maxLength="1000000" valueName="DefaultSearchProviderImageURLPostParams"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ExtensionInstallBlocklist)" explainText="$(string.ExtensionInstallBlocklist_Explain)" key="Software\Policies\Microsoft\Edge" name="ExtensionInstallBlocklist" presentation="$(presentation.ExtensionInstallBlocklist)">
      <parentCategory ref="Extensions"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="ExtensionInstallBlocklistDesc" key="Software\Policies\Microsoft\Edge\ExtensionInstallBlocklist" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ExtensionInstallAllowlist)" explainText="$(string.ExtensionInstallAllowlist_Explain)" key="Software\Policies\Microsoft\Edge" name="ExtensionInstallAllowlist" presentation="$(presentation.ExtensionInstallAllowlist)">
      <parentCategory ref="Extensions"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="ExtensionInstallAllowlistDesc" key="Software\Policies\Microsoft\Edge\ExtensionInstallAllowlist" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ExtensionInstallForcelist)" explainText="$(string.ExtensionInstallForcelist_Explain)" key="Software\Policies\Microsoft\Edge" name="ExtensionInstallForcelist" presentation="$(presentation.ExtensionInstallForcelist)">
      <parentCategory ref="Extensions"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="ExtensionInstallForcelistDesc" key="Software\Policies\Microsoft\Edge\ExtensionInstallForcelist" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ExtensionInstallSources)" explainText="$(string.ExtensionInstallSources_Explain)" key="Software\Policies\Microsoft\Edge" name="ExtensionInstallSources" presentation="$(presentation.ExtensionInstallSources)">
      <parentCategory ref="Extensions"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="ExtensionInstallSourcesDesc" key="Software\Policies\Microsoft\Edge\ExtensionInstallSources" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ExtensionAllowedTypes)" explainText="$(string.ExtensionAllowedTypes_Explain)" key="Software\Policies\Microsoft\Edge" name="ExtensionAllowedTypes" presentation="$(presentation.ExtensionAllowedTypes)">
      <parentCategory ref="Extensions"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="ExtensionAllowedTypesDesc" key="Software\Policies\Microsoft\Edge\ExtensionAllowedTypes" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ExtensionSettings)" explainText="$(string.ExtensionSettings_Explain)" key="Software\Policies\Microsoft\Edge" name="ExtensionSettings" presentation="$(presentation.ExtensionSettings)">
      <parentCategory ref="Extensions"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="ExtensionSettings" maxLength="1000000" valueName="ExtensionSettings"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.AuthSchemes)" explainText="$(string.AuthSchemes_Explain)" key="Software\Policies\Microsoft\Edge" name="AuthSchemes" presentation="$(presentation.AuthSchemes)">
      <parentCategory ref="HTTPAuthentication"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="AuthSchemes" maxLength="1000000" valueName="AuthSchemes"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DisableAuthNegotiateCnameLookup)" explainText="$(string.DisableAuthNegotiateCnameLookup_Explain)" key="Software\Policies\Microsoft\Edge" name="DisableAuthNegotiateCnameLookup" presentation="$(presentation.DisableAuthNegotiateCnameLookup)" valueName="DisableAuthNegotiateCnameLookup">
      <parentCategory ref="HTTPAuthentication"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.EnableAuthNegotiatePort)" explainText="$(string.EnableAuthNegotiatePort_Explain)" key="Software\Policies\Microsoft\Edge" name="EnableAuthNegotiatePort" presentation="$(presentation.EnableAuthNegotiatePort)" valueName="EnableAuthNegotiatePort">
      <parentCategory ref="HTTPAuthentication"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.AuthServerAllowlist)" explainText="$(string.AuthServerAllowlist_Explain)" key="Software\Policies\Microsoft\Edge" name="AuthServerAllowlist" presentation="$(presentation.AuthServerAllowlist)">
      <parentCategory ref="HTTPAuthentication"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="AuthServerAllowlist" maxLength="1000000" valueName="AuthServerAllowlist"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.AuthNegotiateDelegateAllowlist)" explainText="$(string.AuthNegotiateDelegateAllowlist_Explain)" key="Software\Policies\Microsoft\Edge" name="AuthNegotiateDelegateAllowlist" presentation="$(presentation.AuthNegotiateDelegateAllowlist)">
      <parentCategory ref="HTTPAuthentication"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="AuthNegotiateDelegateAllowlist" maxLength="1000000" valueName="AuthNegotiateDelegateAllowlist"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.AllowCrossOriginAuthPrompt)" explainText="$(string.AllowCrossOriginAuthPrompt_Explain)" key="Software\Policies\Microsoft\Edge" name="AllowCrossOriginAuthPrompt" presentation="$(presentation.AllowCrossOriginAuthPrompt)" valueName="AllowCrossOriginAuthPrompt">
      <parentCategory ref="HTTPAuthentication"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.NativeMessagingBlocklist)" explainText="$(string.NativeMessagingBlocklist_Explain)" key="Software\Policies\Microsoft\Edge" name="NativeMessagingBlocklist" presentation="$(presentation.NativeMessagingBlocklist)">
      <parentCategory ref="NativeMessaging"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="NativeMessagingBlocklistDesc" key="Software\Policies\Microsoft\Edge\NativeMessagingBlocklist" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NativeMessagingAllowlist)" explainText="$(string.NativeMessagingAllowlist_Explain)" key="Software\Policies\Microsoft\Edge" name="NativeMessagingAllowlist" presentation="$(presentation.NativeMessagingAllowlist)">
      <parentCategory ref="NativeMessaging"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="NativeMessagingAllowlistDesc" key="Software\Policies\Microsoft\Edge\NativeMessagingAllowlist" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NativeMessagingUserLevelHosts)" explainText="$(string.NativeMessagingUserLevelHosts_Explain)" key="Software\Policies\Microsoft\Edge" name="NativeMessagingUserLevelHosts" presentation="$(presentation.NativeMessagingUserLevelHosts)" valueName="NativeMessagingUserLevelHosts">
      <parentCategory ref="NativeMessaging"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.PasswordManagerEnabled)" explainText="$(string.PasswordManagerEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="PasswordManagerEnabled" presentation="$(presentation.PasswordManagerEnabled)" valueName="PasswordManagerEnabled">
      <parentCategory ref="PasswordManager"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.PasswordProtectionWarningTrigger)" explainText="$(string.PasswordProtectionWarningTrigger_Explain)" key="Software\Policies\Microsoft\Edge" name="PasswordProtectionWarningTrigger" presentation="$(presentation.PasswordProtectionWarningTrigger)">
      <parentCategory ref="PasswordManager"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="PasswordProtectionWarningTrigger" valueName="PasswordProtectionWarningTrigger">
          <item displayName="$(string.PasswordProtectionWarningTrigger_PasswordProtectionWarningOff)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.PasswordProtectionWarningTrigger_PasswordProtectionWarningOnPasswordReuse)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.PasswordProtectionLoginURLs)" explainText="$(string.PasswordProtectionLoginURLs_Explain)" key="Software\Policies\Microsoft\Edge" name="PasswordProtectionLoginURLs" presentation="$(presentation.PasswordProtectionLoginURLs)">
      <parentCategory ref="PasswordManager"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="PasswordProtectionLoginURLsDesc" key="Software\Policies\Microsoft\Edge\PasswordProtectionLoginURLs" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.PasswordProtectionChangePasswordURL)" explainText="$(string.PasswordProtectionChangePasswordURL_Explain)" key="Software\Policies\Microsoft\Edge" name="PasswordProtectionChangePasswordURL" presentation="$(presentation.PasswordProtectionChangePasswordURL)">
      <parentCategory ref="PasswordManager"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="PasswordProtectionChangePasswordURL" maxLength="1000000" valueName="PasswordProtectionChangePasswordURL"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.PasswordManagerEnabled)" explainText="$(string.PasswordManagerEnabled_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="PasswordManagerEnabled_recommended" presentation="$(presentation.PasswordManagerEnabled)" valueName="PasswordManagerEnabled">
      <parentCategory ref="PasswordManager_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.PrintingEnabled)" explainText="$(string.PrintingEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="PrintingEnabled" presentation="$(presentation.PrintingEnabled)" valueName="PrintingEnabled">
      <parentCategory ref="Printing"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.UseSystemPrintDialog)" explainText="$(string.UseSystemPrintDialog_Explain)" key="Software\Policies\Microsoft\Edge" name="UseSystemPrintDialog" presentation="$(presentation.UseSystemPrintDialog)" valueName="UseSystemPrintDialog">
      <parentCategory ref="Printing"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.PrintHeaderFooter)" explainText="$(string.PrintHeaderFooter_Explain)" key="Software\Policies\Microsoft\Edge" name="PrintHeaderFooter" presentation="$(presentation.PrintHeaderFooter)" valueName="PrintHeaderFooter">
      <parentCategory ref="Printing"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.DefaultPrinterSelection)" explainText="$(string.DefaultPrinterSelection_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultPrinterSelection" presentation="$(presentation.DefaultPrinterSelection)">
      <parentCategory ref="Printing"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="DefaultPrinterSelection" maxLength="1000000" valueName="DefaultPrinterSelection"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.PrintPreviewUseSystemDefaultPrinter)" explainText="$(string.PrintPreviewUseSystemDefaultPrinter_Explain)" key="Software\Policies\Microsoft\Edge" name="PrintPreviewUseSystemDefaultPrinter" presentation="$(presentation.PrintPreviewUseSystemDefaultPrinter)" valueName="PrintPreviewUseSystemDefaultPrinter">
      <parentCategory ref="Printing"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.PrintHeaderFooter)" explainText="$(string.PrintHeaderFooter_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="PrintHeaderFooter_recommended" presentation="$(presentation.PrintHeaderFooter)" valueName="PrintHeaderFooter">
      <parentCategory ref="Printing_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.PrintPreviewUseSystemDefaultPrinter)" explainText="$(string.PrintPreviewUseSystemDefaultPrinter_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="PrintPreviewUseSystemDefaultPrinter_recommended" presentation="$(presentation.PrintPreviewUseSystemDefaultPrinter)" valueName="PrintPreviewUseSystemDefaultPrinter">
      <parentCategory ref="Printing_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ProxyMode)" explainText="$(string.ProxyMode_Explain)" key="Software\Policies\Microsoft\Edge" name="ProxyMode" presentation="$(presentation.ProxyMode)">
      <parentCategory ref="Proxy"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="ProxyMode" valueName="ProxyMode">
          <item displayName="$(string.ProxyMode_ProxyDisabled)">
            <value>
              <string>direct</string>
            </value>
          </item>
          <item displayName="$(string.ProxyMode_ProxyAutoDetect)">
            <value>
              <string>auto_detect</string>
            </value>
          </item>
          <item displayName="$(string.ProxyMode_ProxyPacScript)">
            <value>
              <string>pac_script</string>
            </value>
          </item>
          <item displayName="$(string.ProxyMode_ProxyFixedServers)">
            <value>
              <string>fixed_servers</string>
            </value>
          </item>
          <item displayName="$(string.ProxyMode_ProxyUseSystem)">
            <value>
              <string>system</string>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ProxyServer)" explainText="$(string.ProxyServer_Explain)" key="Software\Policies\Microsoft\Edge" name="ProxyServer" presentation="$(presentation.ProxyServer)">
      <parentCategory ref="Proxy"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="ProxyServer" maxLength="1000000" valueName="ProxyServer"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ProxyPacUrl)" explainText="$(string.ProxyPacUrl_Explain)" key="Software\Policies\Microsoft\Edge" name="ProxyPacUrl" presentation="$(presentation.ProxyPacUrl)">
      <parentCategory ref="Proxy"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="ProxyPacUrl" maxLength="1000000" valueName="ProxyPacUrl"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ProxyBypassList)" explainText="$(string.ProxyBypassList_Explain)" key="Software\Policies\Microsoft\Edge" name="ProxyBypassList" presentation="$(presentation.ProxyBypassList)">
      <parentCategory ref="Proxy"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="ProxyBypassList" maxLength="1000000" valueName="ProxyBypassList"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ProxySettings)" explainText="$(string.ProxySettings_Explain)" key="Software\Policies\Microsoft\Edge" name="ProxySettings" presentation="$(presentation.ProxySettings)">
      <parentCategory ref="Proxy"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="ProxySettings" maxLength="1000000" valueName="ProxySettings"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.SmartScreenEnabled)" explainText="$(string.SmartScreenEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="SmartScreenEnabled" presentation="$(presentation.SmartScreenEnabled)" valueName="SmartScreenEnabled">
      <parentCategory ref="SmartScreen"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.PreventSmartScreenPromptOverride)" explainText="$(string.PreventSmartScreenPromptOverride_Explain)" key="Software\Policies\Microsoft\Edge" name="PreventSmartScreenPromptOverride" presentation="$(presentation.PreventSmartScreenPromptOverride)" valueName="PreventSmartScreenPromptOverride">
      <parentCategory ref="SmartScreen"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.PreventSmartScreenPromptOverrideForFiles)" explainText="$(string.PreventSmartScreenPromptOverrideForFiles_Explain)" key="Software\Policies\Microsoft\Edge" name="PreventSmartScreenPromptOverrideForFiles" presentation="$(presentation.PreventSmartScreenPromptOverrideForFiles)" valueName="PreventSmartScreenPromptOverrideForFiles">
      <parentCategory ref="SmartScreen"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SmartScreenAllowListDomains)" explainText="$(string.SmartScreenAllowListDomains_Explain)" key="Software\Policies\Microsoft\Edge" name="SmartScreenAllowListDomains" presentation="$(presentation.SmartScreenAllowListDomains)">
      <parentCategory ref="SmartScreen"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="SmartScreenAllowListDomainsDesc" key="Software\Policies\Microsoft\Edge\SmartScreenAllowListDomains" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.SmartScreenForTrustedDownloadsEnabled)" explainText="$(string.SmartScreenForTrustedDownloadsEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="SmartScreenForTrustedDownloadsEnabled" presentation="$(presentation.SmartScreenForTrustedDownloadsEnabled)" valueName="SmartScreenForTrustedDownloadsEnabled">
      <parentCategory ref="SmartScreen"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SmartScreenEnabled)" explainText="$(string.SmartScreenEnabled_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="SmartScreenEnabled_recommended" presentation="$(presentation.SmartScreenEnabled)" valueName="SmartScreenEnabled">
      <parentCategory ref="SmartScreen_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SmartScreenForTrustedDownloadsEnabled)" explainText="$(string.SmartScreenForTrustedDownloadsEnabled_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="SmartScreenForTrustedDownloadsEnabled_recommended" presentation="$(presentation.SmartScreenForTrustedDownloadsEnabled)" valueName="SmartScreenForTrustedDownloadsEnabled">
      <parentCategory ref="SmartScreen_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ShowHomeButton)" explainText="$(string.ShowHomeButton_Explain)" key="Software\Policies\Microsoft\Edge" name="ShowHomeButton" presentation="$(presentation.ShowHomeButton)" valueName="ShowHomeButton">
      <parentCategory ref="Startup"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.HomepageLocation)" explainText="$(string.HomepageLocation_Explain)" key="Software\Policies\Microsoft\Edge" name="HomepageLocation" presentation="$(presentation.HomepageLocation)">
      <parentCategory ref="Startup"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="HomepageLocation" maxLength="1000000" valueName="HomepageLocation"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.HomepageIsNewTabPage)" explainText="$(string.HomepageIsNewTabPage_Explain)" key="Software\Policies\Microsoft\Edge" name="HomepageIsNewTabPage" presentation="$(presentation.HomepageIsNewTabPage)" valueName="HomepageIsNewTabPage">
      <parentCategory ref="Startup"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.NewTabPageLocation)" explainText="$(string.NewTabPageLocation_Explain)" key="Software\Policies\Microsoft\Edge" name="NewTabPageLocation" presentation="$(presentation.NewTabPageLocation)">
      <parentCategory ref="Startup"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="NewTabPageLocation" maxLength="1000000" valueName="NewTabPageLocation"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NewTabPageSetFeedType)" explainText="$(string.NewTabPageSetFeedType_Explain)" key="Software\Policies\Microsoft\Edge" name="NewTabPageSetFeedType" presentation="$(presentation.NewTabPageSetFeedType)">
      <parentCategory ref="Startup"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <elements>
        <enum id="NewTabPageSetFeedType" valueName="NewTabPageSetFeedType">
          <item displayName="$(string.NewTabPageSetFeedType_News)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.NewTabPageSetFeedType_Office)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.RestoreOnStartup)" explainText="$(string.RestoreOnStartup_Explain)" key="Software\Policies\Microsoft\Edge" name="RestoreOnStartup" presentation="$(presentation.RestoreOnStartup)">
      <parentCategory ref="Startup"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="RestoreOnStartup" valueName="RestoreOnStartup">
          <item displayName="$(string.RestoreOnStartup_RestoreOnStartupIsNewTabPage)">
            <value>
              <decimal value="5"/>
            </value>
          </item>
          <item displayName="$(string.RestoreOnStartup_RestoreOnStartupIsLastSession)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.RestoreOnStartup_RestoreOnStartupIsURLs)">
            <value>
              <decimal value="4"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.RestoreOnStartupURLs)" explainText="$(string.RestoreOnStartupURLs_Explain)" key="Software\Policies\Microsoft\Edge" name="RestoreOnStartupURLs" presentation="$(presentation.RestoreOnStartupURLs)">
      <parentCategory ref="Startup"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="RestoreOnStartupURLsDesc" key="Software\Policies\Microsoft\Edge\RestoreOnStartupURLs" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NewTabPageCompanyLogo)" explainText="$(string.NewTabPageCompanyLogo_Explain)" key="Software\Policies\Microsoft\Edge" name="NewTabPageCompanyLogo" presentation="$(presentation.NewTabPageCompanyLogo)">
      <parentCategory ref="Startup"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <elements>
        <text id="NewTabPageCompanyLogo" maxLength="1000000" valueName="NewTabPageCompanyLogo"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NewTabPageHideDefaultTopSites)" explainText="$(string.NewTabPageHideDefaultTopSites_Explain)" key="Software\Policies\Microsoft\Edge" name="NewTabPageHideDefaultTopSites" presentation="$(presentation.NewTabPageHideDefaultTopSites)" valueName="NewTabPageHideDefaultTopSites">
      <parentCategory ref="Startup"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.NewTabPageManagedQuickLinks)" explainText="$(string.NewTabPageManagedQuickLinks_Explain)" key="Software\Policies\Microsoft\Edge" name="NewTabPageManagedQuickLinks" presentation="$(presentation.NewTabPageManagedQuickLinks)">
      <parentCategory ref="Startup"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <elements>
        <text id="NewTabPageManagedQuickLinks" maxLength="1000000" valueName="NewTabPageManagedQuickLinks"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ShowHomeButton)" explainText="$(string.ShowHomeButton_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ShowHomeButton_recommended" presentation="$(presentation.ShowHomeButton)" valueName="ShowHomeButton">
      <parentCategory ref="Startup_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.HomepageLocation)" explainText="$(string.HomepageLocation_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="HomepageLocation_recommended" presentation="$(presentation.HomepageLocation)">
      <parentCategory ref="Startup_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="HomepageLocation" maxLength="1000000" valueName="HomepageLocation"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.HomepageIsNewTabPage)" explainText="$(string.HomepageIsNewTabPage_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="HomepageIsNewTabPage_recommended" presentation="$(presentation.HomepageIsNewTabPage)" valueName="HomepageIsNewTabPage">
      <parentCategory ref="Startup_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.NewTabPageLocation)" explainText="$(string.NewTabPageLocation_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="NewTabPageLocation_recommended" presentation="$(presentation.NewTabPageLocation)">
      <parentCategory ref="Startup_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="NewTabPageLocation" maxLength="1000000" valueName="NewTabPageLocation"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NewTabPageSetFeedType)" explainText="$(string.NewTabPageSetFeedType_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="NewTabPageSetFeedType_recommended" presentation="$(presentation.NewTabPageSetFeedType)">
      <parentCategory ref="Startup_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <elements>
        <enum id="NewTabPageSetFeedType" valueName="NewTabPageSetFeedType">
          <item displayName="$(string.NewTabPageSetFeedType_News)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.NewTabPageSetFeedType_Office)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.RestoreOnStartup)" explainText="$(string.RestoreOnStartup_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="RestoreOnStartup_recommended" presentation="$(presentation.RestoreOnStartup)">
      <parentCategory ref="Startup_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="RestoreOnStartup" valueName="RestoreOnStartup">
          <item displayName="$(string.RestoreOnStartup_RestoreOnStartupIsNewTabPage)">
            <value>
              <decimal value="5"/>
            </value>
          </item>
          <item displayName="$(string.RestoreOnStartup_RestoreOnStartupIsLastSession)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.RestoreOnStartup_RestoreOnStartupIsURLs)">
            <value>
              <decimal value="4"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.RestoreOnStartupURLs)" explainText="$(string.RestoreOnStartupURLs_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="RestoreOnStartupURLs_recommended" presentation="$(presentation.RestoreOnStartupURLs)">
      <parentCategory ref="Startup_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="RestoreOnStartupURLsDesc" key="Software\Policies\Microsoft\Edge\Recommended\RestoreOnStartupURLs" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NewTabPageManagedQuickLinks)" explainText="$(string.NewTabPageManagedQuickLinks_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="NewTabPageManagedQuickLinks_recommended" presentation="$(presentation.NewTabPageManagedQuickLinks)">
      <parentCategory ref="Startup_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <elements>
        <text id="NewTabPageManagedQuickLinks" maxLength="1000000" valueName="NewTabPageManagedQuickLinks"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.AdsSettingForIntrusiveAdsSites)" explainText="$(string.AdsSettingForIntrusiveAdsSites_Explain)" key="Software\Policies\Microsoft\Edge" name="AdsSettingForIntrusiveAdsSites" presentation="$(presentation.AdsSettingForIntrusiveAdsSites)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <elements>
        <enum id="AdsSettingForIntrusiveAdsSites" valueName="AdsSettingForIntrusiveAdsSites">
          <item displayName="$(string.AdsSettingForIntrusiveAdsSites_AllowAds)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.AdsSettingForIntrusiveAdsSites_BlockAds)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.AllowDeletingBrowserHistory)" explainText="$(string.AllowDeletingBrowserHistory_Explain)" key="Software\Policies\Microsoft\Edge" name="AllowDeletingBrowserHistory" presentation="$(presentation.AllowDeletingBrowserHistory)" valueName="AllowDeletingBrowserHistory">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.AllowFileSelectionDialogs)" explainText="$(string.AllowFileSelectionDialogs_Explain)" key="Software\Policies\Microsoft\Edge" name="AllowFileSelectionDialogs" presentation="$(presentation.AllowFileSelectionDialogs)" valueName="AllowFileSelectionDialogs">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.AllowPopupsDuringPageUnload)" explainText="$(string.AllowPopupsDuringPageUnload_Explain)" key="Software\Policies\Microsoft\Edge" name="AllowPopupsDuringPageUnload" presentation="$(presentation.AllowPopupsDuringPageUnload)" valueName="AllowPopupsDuringPageUnload">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.AllowSyncXHRInPageDismissal)" explainText="$(string.AllowSyncXHRInPageDismissal_Explain)" key="Software\Policies\Microsoft\Edge" name="AllowSyncXHRInPageDismissal" presentation="$(presentation.AllowSyncXHRInPageDismissal)" valueName="AllowSyncXHRInPageDismissal">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.AllowTrackingForUrls)" explainText="$(string.AllowTrackingForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="AllowTrackingForUrls" presentation="$(presentation.AllowTrackingForUrls)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <elements>
        <list id="AllowTrackingForUrlsDesc" key="Software\Policies\Microsoft\Edge\AllowTrackingForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.AlwaysOpenPdfExternally)" explainText="$(string.AlwaysOpenPdfExternally_Explain)" key="Software\Policies\Microsoft\Edge" name="AlwaysOpenPdfExternally" presentation="$(presentation.AlwaysOpenPdfExternally)" valueName="AlwaysOpenPdfExternally">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ApplicationLocaleValue)" explainText="$(string.ApplicationLocaleValue_Explain)" key="Software\Policies\Microsoft\Edge" name="ApplicationLocaleValue" presentation="$(presentation.ApplicationLocaleValue)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="ApplicationLocaleValue" maxLength="1000000" valueName="ApplicationLocaleValue"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ApplicationLocaleValue)" explainText="$(string.ApplicationLocaleValue_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ApplicationLocaleValue_recommended" presentation="$(presentation.ApplicationLocaleValue)">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="ApplicationLocaleValue" maxLength="1000000" valueName="ApplicationLocaleValue"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.AudioCaptureAllowed)" explainText="$(string.AudioCaptureAllowed_Explain)" key="Software\Policies\Microsoft\Edge" name="AudioCaptureAllowed" presentation="$(presentation.AudioCaptureAllowed)" valueName="AudioCaptureAllowed">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.AudioCaptureAllowedUrls)" explainText="$(string.AudioCaptureAllowedUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="AudioCaptureAllowedUrls" presentation="$(presentation.AudioCaptureAllowedUrls)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="AudioCaptureAllowedUrlsDesc" key="Software\Policies\Microsoft\Edge\AudioCaptureAllowedUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.AutoImportAtFirstRun)" explainText="$(string.AutoImportAtFirstRun_Explain)" key="Software\Policies\Microsoft\Edge" name="AutoImportAtFirstRun" presentation="$(presentation.AutoImportAtFirstRun)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="AutoImportAtFirstRun" valueName="AutoImportAtFirstRun">
          <item displayName="$(string.AutoImportAtFirstRun_FromDefaultBrowser)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.AutoImportAtFirstRun_FromInternetExplorer)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.AutoImportAtFirstRun_FromGoogleChrome)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.AutoImportAtFirstRun_FromSafari)">
            <value>
              <decimal value="3"/>
            </value>
          </item>
          <item displayName="$(string.AutoImportAtFirstRun_DisabledAutoImport)">
            <value>
              <decimal value="4"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.AutofillAddressEnabled)" explainText="$(string.AutofillAddressEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="AutofillAddressEnabled" presentation="$(presentation.AutofillAddressEnabled)" valueName="AutofillAddressEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.AutofillAddressEnabled)" explainText="$(string.AutofillAddressEnabled_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="AutofillAddressEnabled_recommended" presentation="$(presentation.AutofillAddressEnabled)" valueName="AutofillAddressEnabled">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.AutofillCreditCardEnabled)" explainText="$(string.AutofillCreditCardEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="AutofillCreditCardEnabled" presentation="$(presentation.AutofillCreditCardEnabled)" valueName="AutofillCreditCardEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.AutofillCreditCardEnabled)" explainText="$(string.AutofillCreditCardEnabled_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="AutofillCreditCardEnabled_recommended" presentation="$(presentation.AutofillCreditCardEnabled)" valueName="AutofillCreditCardEnabled">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.AutoplayAllowed)" explainText="$(string.AutoplayAllowed_Explain)" key="Software\Policies\Microsoft\Edge" name="AutoplayAllowed" presentation="$(presentation.AutoplayAllowed)" valueName="AutoplayAllowed">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.BackgroundModeEnabled)" explainText="$(string.BackgroundModeEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="BackgroundModeEnabled" presentation="$(presentation.BackgroundModeEnabled)" valueName="BackgroundModeEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.BackgroundModeEnabled)" explainText="$(string.BackgroundModeEnabled_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="BackgroundModeEnabled_recommended" presentation="$(presentation.BackgroundModeEnabled)" valueName="BackgroundModeEnabled">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.BackgroundTemplateListUpdatesEnabled)" explainText="$(string.BackgroundTemplateListUpdatesEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="BackgroundTemplateListUpdatesEnabled" presentation="$(presentation.BackgroundTemplateListUpdatesEnabled)" valueName="BackgroundTemplateListUpdatesEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.BlockThirdPartyCookies)" explainText="$(string.BlockThirdPartyCookies_Explain)" key="Software\Policies\Microsoft\Edge" name="BlockThirdPartyCookies" presentation="$(presentation.BlockThirdPartyCookies)" valueName="BlockThirdPartyCookies">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.BlockThirdPartyCookies)" explainText="$(string.BlockThirdPartyCookies_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="BlockThirdPartyCookies_recommended" presentation="$(presentation.BlockThirdPartyCookies)" valueName="BlockThirdPartyCookies">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.FavoritesBarEnabled)" explainText="$(string.FavoritesBarEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="FavoritesBarEnabled" presentation="$(presentation.FavoritesBarEnabled)" valueName="FavoritesBarEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.FavoritesBarEnabled)" explainText="$(string.FavoritesBarEnabled_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="FavoritesBarEnabled_recommended" presentation="$(presentation.FavoritesBarEnabled)" valueName="FavoritesBarEnabled">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.BrowserAddProfileEnabled)" explainText="$(string.BrowserAddProfileEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="BrowserAddProfileEnabled" presentation="$(presentation.BrowserAddProfileEnabled)" valueName="BrowserAddProfileEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.BrowserGuestModeEnabled)" explainText="$(string.BrowserGuestModeEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="BrowserGuestModeEnabled" presentation="$(presentation.BrowserGuestModeEnabled)" valueName="BrowserGuestModeEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.BrowserNetworkTimeQueriesEnabled)" explainText="$(string.BrowserNetworkTimeQueriesEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="BrowserNetworkTimeQueriesEnabled" presentation="$(presentation.BrowserNetworkTimeQueriesEnabled)" valueName="BrowserNetworkTimeQueriesEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.BrowserSignin)" explainText="$(string.BrowserSignin_Explain)" key="Software\Policies\Microsoft\Edge" name="BrowserSignin" presentation="$(presentation.BrowserSignin)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="BrowserSignin" valueName="BrowserSignin">
          <item displayName="$(string.BrowserSignin_Disable)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.BrowserSignin_Enable)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.BrowserSignin_Force)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.BuiltInDnsClientEnabled)" explainText="$(string.BuiltInDnsClientEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="BuiltInDnsClientEnabled" presentation="$(presentation.BuiltInDnsClientEnabled)" valueName="BuiltInDnsClientEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.CertificateTransparencyEnforcementDisabledForCas)" explainText="$(string.CertificateTransparencyEnforcementDisabledForCas_Explain)" key="Software\Policies\Microsoft\Edge" name="CertificateTransparencyEnforcementDisabledForCas" presentation="$(presentation.CertificateTransparencyEnforcementDisabledForCas)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="CertificateTransparencyEnforcementDisabledForCasDesc" key="Software\Policies\Microsoft\Edge\CertificateTransparencyEnforcementDisabledForCas" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.CertificateTransparencyEnforcementDisabledForLegacyCas)" explainText="$(string.CertificateTransparencyEnforcementDisabledForLegacyCas_Explain)" key="Software\Policies\Microsoft\Edge" name="CertificateTransparencyEnforcementDisabledForLegacyCas" presentation="$(presentation.CertificateTransparencyEnforcementDisabledForLegacyCas)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="CertificateTransparencyEnforcementDisabledForLegacyCasDesc" key="Software\Policies\Microsoft\Edge\CertificateTransparencyEnforcementDisabledForLegacyCas" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.CertificateTransparencyEnforcementDisabledForUrls)" explainText="$(string.CertificateTransparencyEnforcementDisabledForUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="CertificateTransparencyEnforcementDisabledForUrls" presentation="$(presentation.CertificateTransparencyEnforcementDisabledForUrls)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="CertificateTransparencyEnforcementDisabledForUrlsDesc" key="Software\Policies\Microsoft\Edge\CertificateTransparencyEnforcementDisabledForUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ClearBrowsingDataOnExit)" explainText="$(string.ClearBrowsingDataOnExit_Explain)" key="Software\Policies\Microsoft\Edge" name="ClearBrowsingDataOnExit" presentation="$(presentation.ClearBrowsingDataOnExit)" valueName="ClearBrowsingDataOnExit">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ClearBrowsingDataOnExit)" explainText="$(string.ClearBrowsingDataOnExit_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ClearBrowsingDataOnExit_recommended" presentation="$(presentation.ClearBrowsingDataOnExit)" valueName="ClearBrowsingDataOnExit">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ClickOnceEnabled)" explainText="$(string.ClickOnceEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="ClickOnceEnabled" presentation="$(presentation.ClickOnceEnabled)" valueName="ClickOnceEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.CommandLineFlagSecurityWarningsEnabled)" explainText="$(string.CommandLineFlagSecurityWarningsEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="CommandLineFlagSecurityWarningsEnabled" presentation="$(presentation.CommandLineFlagSecurityWarningsEnabled)" valueName="CommandLineFlagSecurityWarningsEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ComponentUpdatesEnabled)" explainText="$(string.ComponentUpdatesEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="ComponentUpdatesEnabled" presentation="$(presentation.ComponentUpdatesEnabled)" valueName="ComponentUpdatesEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ConfigureDoNotTrack)" explainText="$(string.ConfigureDoNotTrack_Explain)" key="Software\Policies\Microsoft\Edge" name="ConfigureDoNotTrack" presentation="$(presentation.ConfigureDoNotTrack)" valueName="ConfigureDoNotTrack">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ConfigureOnlineTextToSpeech)" explainText="$(string.ConfigureOnlineTextToSpeech_Explain)" key="Software\Policies\Microsoft\Edge" name="ConfigureOnlineTextToSpeech" presentation="$(presentation.ConfigureOnlineTextToSpeech)" valueName="ConfigureOnlineTextToSpeech">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.CustomHelpLink)" explainText="$(string.CustomHelpLink_Explain)" key="Software\Policies\Microsoft\Edge" name="CustomHelpLink" presentation="$(presentation.CustomHelpLink)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <elements>
        <text id="CustomHelpLink" maxLength="1000000" valueName="CustomHelpLink"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DefaultBrowserSettingEnabled)" explainText="$(string.DefaultBrowserSettingEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="DefaultBrowserSettingEnabled" presentation="$(presentation.DefaultBrowserSettingEnabled)" valueName="DefaultBrowserSettingEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_ONLY_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.DeveloperToolsAvailability)" explainText="$(string.DeveloperToolsAvailability_Explain)" key="Software\Policies\Microsoft\Edge" name="DeveloperToolsAvailability" presentation="$(presentation.DeveloperToolsAvailability)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DeveloperToolsAvailability" valueName="DeveloperToolsAvailability">
          <item displayName="$(string.DeveloperToolsAvailability_DeveloperToolsDisallowedForForceInstalledExtensions)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.DeveloperToolsAvailability_DeveloperToolsAllowed)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.DeveloperToolsAvailability_DeveloperToolsDisallowed)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DirectInvokeEnabled)" explainText="$(string.DirectInvokeEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="DirectInvokeEnabled" presentation="$(presentation.DirectInvokeEnabled)" valueName="DirectInvokeEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.Disable3DAPIs)" explainText="$(string.Disable3DAPIs_Explain)" key="Software\Policies\Microsoft\Edge" name="Disable3DAPIs" presentation="$(presentation.Disable3DAPIs)" valueName="Disable3DAPIs">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.DisableScreenshots)" explainText="$(string.DisableScreenshots_Explain)" key="Software\Policies\Microsoft\Edge" name="DisableScreenshots" presentation="$(presentation.DisableScreenshots)" valueName="DisableScreenshots">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.DiskCacheDir)" explainText="$(string.DiskCacheDir_Explain)" key="Software\Policies\Microsoft\Edge" name="DiskCacheDir" presentation="$(presentation.DiskCacheDir)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="DiskCacheDir" maxLength="1000000" valueName="DiskCacheDir"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DiskCacheSize)" explainText="$(string.DiskCacheSize_Explain)" key="Software\Policies\Microsoft\Edge" name="DiskCacheSize" presentation="$(presentation.DiskCacheSize)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <decimal id="DiskCacheSize" maxValue="2000000000" minValue="0" valueName="DiskCacheSize"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DownloadDirectory)" explainText="$(string.DownloadDirectory_Explain)" key="Software\Policies\Microsoft\Edge" name="DownloadDirectory" presentation="$(presentation.DownloadDirectory)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="DownloadDirectory" maxLength="1000000" valueName="DownloadDirectory"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DownloadDirectory)" explainText="$(string.DownloadDirectory_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="DownloadDirectory_recommended" presentation="$(presentation.DownloadDirectory)">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="DownloadDirectory" maxLength="1000000" valueName="DownloadDirectory"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DownloadRestrictions)" explainText="$(string.DownloadRestrictions_Explain)" key="Software\Policies\Microsoft\Edge" name="DownloadRestrictions" presentation="$(presentation.DownloadRestrictions)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DownloadRestrictions" valueName="DownloadRestrictions">
          <item displayName="$(string.DownloadRestrictions_DefaultDownloadSecurity)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.DownloadRestrictions_BlockDangerousDownloads)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.DownloadRestrictions_BlockPotentiallyDangerousDownloads)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.DownloadRestrictions_BlockAllDownloads)">
            <value>
              <decimal value="3"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.DownloadRestrictions)" explainText="$(string.DownloadRestrictions_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="DownloadRestrictions_recommended" presentation="$(presentation.DownloadRestrictions)">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="DownloadRestrictions" valueName="DownloadRestrictions">
          <item displayName="$(string.DownloadRestrictions_DefaultDownloadSecurity)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.DownloadRestrictions_BlockDangerousDownloads)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.DownloadRestrictions_BlockPotentiallyDangerousDownloads)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.DownloadRestrictions_BlockAllDownloads)">
            <value>
              <decimal value="3"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.EdgeCollectionsEnabled)" explainText="$(string.EdgeCollectionsEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="EdgeCollectionsEnabled" presentation="$(presentation.EdgeCollectionsEnabled)" valueName="EdgeCollectionsEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.EditFavoritesEnabled)" explainText="$(string.EditFavoritesEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="EditFavoritesEnabled" presentation="$(presentation.EditFavoritesEnabled)" valueName="EditFavoritesEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.EnableDeprecatedWebPlatformFeatures)" explainText="$(string.EnableDeprecatedWebPlatformFeatures_Explain)" key="Software\Policies\Microsoft\Edge" name="EnableDeprecatedWebPlatformFeatures" presentation="$(presentation.EnableDeprecatedWebPlatformFeatures)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="EnableDeprecatedWebPlatformFeaturesDesc" key="Software\Policies\Microsoft\Edge\EnableDeprecatedWebPlatformFeatures" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.EnableDomainActionsDownload)" explainText="$(string.EnableDomainActionsDownload_Explain)" key="Software\Policies\Microsoft\Edge" name="EnableDomainActionsDownload" presentation="$(presentation.EnableDomainActionsDownload)" valueName="EnableDomainActionsDownload">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.EnableOnlineRevocationChecks)" explainText="$(string.EnableOnlineRevocationChecks_Explain)" key="Software\Policies\Microsoft\Edge" name="EnableOnlineRevocationChecks" presentation="$(presentation.EnableOnlineRevocationChecks)" valueName="EnableOnlineRevocationChecks">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.EnterpriseHardwarePlatformAPIEnabled)" explainText="$(string.EnterpriseHardwarePlatformAPIEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="EnterpriseHardwarePlatformAPIEnabled" presentation="$(presentation.EnterpriseHardwarePlatformAPIEnabled)" valueName="EnterpriseHardwarePlatformAPIEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ExperimentationAndConfigurationServiceControl)" explainText="$(string.ExperimentationAndConfigurationServiceControl_Explain)" key="Software\Policies\Microsoft\Edge" name="ExperimentationAndConfigurationServiceControl" presentation="$(presentation.ExperimentationAndConfigurationServiceControl)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="ExperimentationAndConfigurationServiceControl" valueName="ExperimentationAndConfigurationServiceControl">
          <item displayName="$(string.ExperimentationAndConfigurationServiceControl_FullMode)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.ExperimentationAndConfigurationServiceControl_RestrictedMode)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ExternalProtocolDialogShowAlwaysOpenCheckbox)" explainText="$(string.ExternalProtocolDialogShowAlwaysOpenCheckbox_Explain)" key="Software\Policies\Microsoft\Edge" name="ExternalProtocolDialogShowAlwaysOpenCheckbox" presentation="$(presentation.ExternalProtocolDialogShowAlwaysOpenCheckbox)" valueName="ExternalProtocolDialogShowAlwaysOpenCheckbox">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ForceBingSafeSearch)" explainText="$(string.ForceBingSafeSearch_Explain)" key="Software\Policies\Microsoft\Edge" name="ForceBingSafeSearch" presentation="$(presentation.ForceBingSafeSearch)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="ForceBingSafeSearch" valueName="ForceBingSafeSearch">
          <item displayName="$(string.ForceBingSafeSearch_BingSafeSearchNoRestrictionsMode)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.ForceBingSafeSearch_BingSafeSearchModerateMode)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.ForceBingSafeSearch_BingSafeSearchStrictMode)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ForceEphemeralProfiles)" explainText="$(string.ForceEphemeralProfiles_Explain)" key="Software\Policies\Microsoft\Edge" name="ForceEphemeralProfiles" presentation="$(presentation.ForceEphemeralProfiles)" valueName="ForceEphemeralProfiles">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ForceGoogleSafeSearch)" explainText="$(string.ForceGoogleSafeSearch_Explain)" key="Software\Policies\Microsoft\Edge" name="ForceGoogleSafeSearch" presentation="$(presentation.ForceGoogleSafeSearch)" valueName="ForceGoogleSafeSearch">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ForceNetworkInProcess)" explainText="$(string.ForceNetworkInProcess_Explain)" key="Software\Policies\Microsoft\Edge" name="ForceNetworkInProcess" presentation="$(presentation.ForceNetworkInProcess)" valueName="ForceNetworkInProcess">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ForceYouTubeRestrict)" explainText="$(string.ForceYouTubeRestrict_Explain)" key="Software\Policies\Microsoft\Edge" name="ForceYouTubeRestrict" presentation="$(presentation.ForceYouTubeRestrict)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="ForceYouTubeRestrict" valueName="ForceYouTubeRestrict">
          <item displayName="$(string.ForceYouTubeRestrict_Off)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.ForceYouTubeRestrict_Moderate)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.ForceYouTubeRestrict_Strict)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.FullscreenAllowed)" explainText="$(string.FullscreenAllowed_Explain)" key="Software\Policies\Microsoft\Edge" name="FullscreenAllowed" presentation="$(presentation.FullscreenAllowed)" valueName="FullscreenAllowed">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.GoToIntranetSiteForSingleWordEntryInAddressBar)" explainText="$(string.GoToIntranetSiteForSingleWordEntryInAddressBar_Explain)" key="Software\Policies\Microsoft\Edge" name="GoToIntranetSiteForSingleWordEntryInAddressBar" presentation="$(presentation.GoToIntranetSiteForSingleWordEntryInAddressBar)" valueName="GoToIntranetSiteForSingleWordEntryInAddressBar">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.HSTSPolicyBypassList)" explainText="$(string.HSTSPolicyBypassList_Explain)" key="Software\Policies\Microsoft\Edge" name="HSTSPolicyBypassList" presentation="$(presentation.HSTSPolicyBypassList)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <elements>
        <list id="HSTSPolicyBypassListDesc" key="Software\Policies\Microsoft\Edge\HSTSPolicyBypassList" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.HardwareAccelerationModeEnabled)" explainText="$(string.HardwareAccelerationModeEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="HardwareAccelerationModeEnabled" presentation="$(presentation.HardwareAccelerationModeEnabled)" valueName="HardwareAccelerationModeEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportAutofillFormData)" explainText="$(string.ImportAutofillFormData_Explain)" key="Software\Policies\Microsoft\Edge" name="ImportAutofillFormData" presentation="$(presentation.ImportAutofillFormData)" valueName="ImportAutofillFormData">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportAutofillFormData)" explainText="$(string.ImportAutofillFormData_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ImportAutofillFormData_recommended" presentation="$(presentation.ImportAutofillFormData)" valueName="ImportAutofillFormData">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportFavorites)" explainText="$(string.ImportFavorites_Explain)" key="Software\Policies\Microsoft\Edge" name="ImportFavorites" presentation="$(presentation.ImportFavorites)" valueName="ImportFavorites">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportFavorites)" explainText="$(string.ImportFavorites_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ImportFavorites_recommended" presentation="$(presentation.ImportFavorites)" valueName="ImportFavorites">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportBrowserSettings)" explainText="$(string.ImportBrowserSettings_Explain)" key="Software\Policies\Microsoft\Edge" name="ImportBrowserSettings" presentation="$(presentation.ImportBrowserSettings)" valueName="ImportBrowserSettings">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportBrowserSettings)" explainText="$(string.ImportBrowserSettings_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ImportBrowserSettings_recommended" presentation="$(presentation.ImportBrowserSettings)" valueName="ImportBrowserSettings">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportHistory)" explainText="$(string.ImportHistory_Explain)" key="Software\Policies\Microsoft\Edge" name="ImportHistory" presentation="$(presentation.ImportHistory)" valueName="ImportHistory">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportHistory)" explainText="$(string.ImportHistory_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ImportHistory_recommended" presentation="$(presentation.ImportHistory)" valueName="ImportHistory">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportHomepage)" explainText="$(string.ImportHomepage_Explain)" key="Software\Policies\Microsoft\Edge" name="ImportHomepage" presentation="$(presentation.ImportHomepage)" valueName="ImportHomepage">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportOpenTabs)" explainText="$(string.ImportOpenTabs_Explain)" key="Software\Policies\Microsoft\Edge" name="ImportOpenTabs" presentation="$(presentation.ImportOpenTabs)" valueName="ImportOpenTabs">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportOpenTabs)" explainText="$(string.ImportOpenTabs_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ImportOpenTabs_recommended" presentation="$(presentation.ImportOpenTabs)" valueName="ImportOpenTabs">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportPaymentInfo)" explainText="$(string.ImportPaymentInfo_Explain)" key="Software\Policies\Microsoft\Edge" name="ImportPaymentInfo" presentation="$(presentation.ImportPaymentInfo)" valueName="ImportPaymentInfo">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportPaymentInfo)" explainText="$(string.ImportPaymentInfo_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ImportPaymentInfo_recommended" presentation="$(presentation.ImportPaymentInfo)" valueName="ImportPaymentInfo">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportSavedPasswords)" explainText="$(string.ImportSavedPasswords_Explain)" key="Software\Policies\Microsoft\Edge" name="ImportSavedPasswords" presentation="$(presentation.ImportSavedPasswords)" valueName="ImportSavedPasswords">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportSavedPasswords)" explainText="$(string.ImportSavedPasswords_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ImportSavedPasswords_recommended" presentation="$(presentation.ImportSavedPasswords)" valueName="ImportSavedPasswords">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportSearchEngine)" explainText="$(string.ImportSearchEngine_Explain)" key="Software\Policies\Microsoft\Edge" name="ImportSearchEngine" presentation="$(presentation.ImportSearchEngine)" valueName="ImportSearchEngine">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ImportSearchEngine)" explainText="$(string.ImportSearchEngine_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ImportSearchEngine_recommended" presentation="$(presentation.ImportSearchEngine)" valueName="ImportSearchEngine">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.InPrivateModeAvailability)" explainText="$(string.InPrivateModeAvailability_Explain)" key="Software\Policies\Microsoft\Edge" name="InPrivateModeAvailability" presentation="$(presentation.InPrivateModeAvailability)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="InPrivateModeAvailability" valueName="InPrivateModeAvailability">
          <item displayName="$(string.InPrivateModeAvailability_Enabled)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.InPrivateModeAvailability_Disabled)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.InPrivateModeAvailability_Forced)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.InternetExplorerIntegrationLevel)" explainText="$(string.InternetExplorerIntegrationLevel_Explain)" key="Software\Policies\Microsoft\Edge" name="InternetExplorerIntegrationLevel" presentation="$(presentation.InternetExplorerIntegrationLevel)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="InternetExplorerIntegrationLevel" valueName="InternetExplorerIntegrationLevel">
          <item displayName="$(string.InternetExplorerIntegrationLevel_None)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.InternetExplorerIntegrationLevel_IEMode)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.InternetExplorerIntegrationLevel_NeedIE)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.InternetExplorerIntegrationSiteList)" explainText="$(string.InternetExplorerIntegrationSiteList_Explain)" key="Software\Policies\Microsoft\Edge" name="InternetExplorerIntegrationSiteList" presentation="$(presentation.InternetExplorerIntegrationSiteList)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <elements>
        <text id="InternetExplorerIntegrationSiteList" maxLength="1000000" valueName="InternetExplorerIntegrationSiteList"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.IsolateOrigins)" explainText="$(string.IsolateOrigins_Explain)" key="Software\Policies\Microsoft\Edge" name="IsolateOrigins" presentation="$(presentation.IsolateOrigins)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="IsolateOrigins" maxLength="1000000" valueName="IsolateOrigins"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ManagedFavorites)" explainText="$(string.ManagedFavorites_Explain)" key="Software\Policies\Microsoft\Edge" name="ManagedFavorites" presentation="$(presentation.ManagedFavorites)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="ManagedFavorites" maxLength="1000000" valueName="ManagedFavorites"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ManagedSearchEngines)" explainText="$(string.ManagedSearchEngines_Explain)" key="Software\Policies\Microsoft\Edge" name="ManagedSearchEngines" presentation="$(presentation.ManagedSearchEngines)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="ManagedSearchEngines" maxLength="1000000" valueName="ManagedSearchEngines"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.MaxConnectionsPerProxy)" explainText="$(string.MaxConnectionsPerProxy_Explain)" key="Software\Policies\Microsoft\Edge" name="MaxConnectionsPerProxy" presentation="$(presentation.MaxConnectionsPerProxy)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <decimal id="MaxConnectionsPerProxy" maxValue="2000000000" minValue="0" valueName="MaxConnectionsPerProxy"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.MediaRouterCastAllowAllIPs)" explainText="$(string.MediaRouterCastAllowAllIPs_Explain)" key="Software\Policies\Microsoft\Edge" name="MediaRouterCastAllowAllIPs" presentation="$(presentation.MediaRouterCastAllowAllIPs)" valueName="MediaRouterCastAllowAllIPs">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.MetricsReportingEnabled)" explainText="$(string.MetricsReportingEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="MetricsReportingEnabled" presentation="$(presentation.MetricsReportingEnabled)" valueName="MetricsReportingEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.NetworkPredictionOptions)" explainText="$(string.NetworkPredictionOptions_Explain)" key="Software\Policies\Microsoft\Edge" name="NetworkPredictionOptions" presentation="$(presentation.NetworkPredictionOptions)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="NetworkPredictionOptions" valueName="NetworkPredictionOptions">
          <item displayName="$(string.NetworkPredictionOptions_NetworkPredictionAlways)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.NetworkPredictionOptions_NetworkPredictionWifiOnly)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.NetworkPredictionOptions_NetworkPredictionNever)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NetworkPredictionOptions)" explainText="$(string.NetworkPredictionOptions_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="NetworkPredictionOptions_recommended" presentation="$(presentation.NetworkPredictionOptions)">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="NetworkPredictionOptions" valueName="NetworkPredictionOptions">
          <item displayName="$(string.NetworkPredictionOptions_NetworkPredictionAlways)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.NetworkPredictionOptions_NetworkPredictionWifiOnly)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.NetworkPredictionOptions_NetworkPredictionNever)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.NonRemovableProfileEnabled)" explainText="$(string.NonRemovableProfileEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="NonRemovableProfileEnabled" presentation="$(presentation.NonRemovableProfileEnabled)" valueName="NonRemovableProfileEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.OverrideSecurityRestrictionsOnInsecureOrigin)" explainText="$(string.OverrideSecurityRestrictionsOnInsecureOrigin_Explain)" key="Software\Policies\Microsoft\Edge" name="OverrideSecurityRestrictionsOnInsecureOrigin" presentation="$(presentation.OverrideSecurityRestrictionsOnInsecureOrigin)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="OverrideSecurityRestrictionsOnInsecureOriginDesc" key="Software\Policies\Microsoft\Edge\OverrideSecurityRestrictionsOnInsecureOrigin" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.ProactiveAuthEnabled)" explainText="$(string.ProactiveAuthEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="ProactiveAuthEnabled" presentation="$(presentation.ProactiveAuthEnabled)" valueName="ProactiveAuthEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.PromotionalTabsEnabled)" explainText="$(string.PromotionalTabsEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="PromotionalTabsEnabled" presentation="$(presentation.PromotionalTabsEnabled)" valueName="PromotionalTabsEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.PromptForDownloadLocation)" explainText="$(string.PromptForDownloadLocation_Explain)" key="Software\Policies\Microsoft\Edge" name="PromptForDownloadLocation" presentation="$(presentation.PromptForDownloadLocation)" valueName="PromptForDownloadLocation">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.QuicAllowed)" explainText="$(string.QuicAllowed_Explain)" key="Software\Policies\Microsoft\Edge" name="QuicAllowed" presentation="$(presentation.QuicAllowed)" valueName="QuicAllowed">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.RelaunchNotification)" explainText="$(string.RelaunchNotification_Explain)" key="Software\Policies\Microsoft\Edge" name="RelaunchNotification" presentation="$(presentation.RelaunchNotification)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="RelaunchNotification" valueName="RelaunchNotification">
          <item displayName="$(string.RelaunchNotification_Recommended)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.RelaunchNotification_Required)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.RelaunchNotificationPeriod)" explainText="$(string.RelaunchNotificationPeriod_Explain)" key="Software\Policies\Microsoft\Edge" name="RelaunchNotificationPeriod" presentation="$(presentation.RelaunchNotificationPeriod)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <decimal id="RelaunchNotificationPeriod" maxValue="2000000000" minValue="3600000" valueName="RelaunchNotificationPeriod"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.RendererCodeIntegrityEnabled)" explainText="$(string.RendererCodeIntegrityEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="RendererCodeIntegrityEnabled" presentation="$(presentation.RendererCodeIntegrityEnabled)" valueName="RendererCodeIntegrityEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.RequireOnlineRevocationChecksForLocalAnchors)" explainText="$(string.RequireOnlineRevocationChecksForLocalAnchors_Explain)" key="Software\Policies\Microsoft\Edge" name="RequireOnlineRevocationChecksForLocalAnchors" presentation="$(presentation.RequireOnlineRevocationChecksForLocalAnchors)" valueName="RequireOnlineRevocationChecksForLocalAnchors">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ResolveNavigationErrorsUseWebService)" explainText="$(string.ResolveNavigationErrorsUseWebService_Explain)" key="Software\Policies\Microsoft\Edge" name="ResolveNavigationErrorsUseWebService" presentation="$(presentation.ResolveNavigationErrorsUseWebService)" valueName="ResolveNavigationErrorsUseWebService">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ResolveNavigationErrorsUseWebService)" explainText="$(string.ResolveNavigationErrorsUseWebService_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="ResolveNavigationErrorsUseWebService_recommended" presentation="$(presentation.ResolveNavigationErrorsUseWebService)" valueName="ResolveNavigationErrorsUseWebService">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.RestrictSigninToPattern)" explainText="$(string.RestrictSigninToPattern_Explain)" key="Software\Policies\Microsoft\Edge" name="RestrictSigninToPattern" presentation="$(presentation.RestrictSigninToPattern)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="RestrictSigninToPattern" maxLength="1000000" valueName="RestrictSigninToPattern"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.RunAllFlashInAllowMode)" explainText="$(string.RunAllFlashInAllowMode_Explain)" key="Software\Policies\Microsoft\Edge" name="RunAllFlashInAllowMode" presentation="$(presentation.RunAllFlashInAllowMode)" valueName="RunAllFlashInAllowMode">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SSLErrorOverrideAllowed)" explainText="$(string.SSLErrorOverrideAllowed_Explain)" key="Software\Policies\Microsoft\Edge" name="SSLErrorOverrideAllowed" presentation="$(presentation.SSLErrorOverrideAllowed)" valueName="SSLErrorOverrideAllowed">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SSLVersionMin)" explainText="$(string.SSLVersionMin_Explain)" key="Software\Policies\Microsoft\Edge" name="SSLVersionMin" presentation="$(presentation.SSLVersionMin)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="SSLVersionMin" valueName="SSLVersionMin">
          <item displayName="$(string.SSLVersionMin_TLSv1)">
            <value>
              <string>tls1</string>
            </value>
          </item>
          <item displayName="$(string.SSLVersionMin_TLSv1_1)">
            <value>
              <string>tls1.1</string>
            </value>
          </item>
          <item displayName="$(string.SSLVersionMin_TLSv1_2)">
            <value>
              <string>tls1.2</string>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.SavingBrowserHistoryDisabled)" explainText="$(string.SavingBrowserHistoryDisabled_Explain)" key="Software\Policies\Microsoft\Edge" name="SavingBrowserHistoryDisabled" presentation="$(presentation.SavingBrowserHistoryDisabled)" valueName="SavingBrowserHistoryDisabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SearchSuggestEnabled)" explainText="$(string.SearchSuggestEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="SearchSuggestEnabled" presentation="$(presentation.SearchSuggestEnabled)" valueName="SearchSuggestEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SearchSuggestEnabled)" explainText="$(string.SearchSuggestEnabled_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="SearchSuggestEnabled_recommended" presentation="$(presentation.SearchSuggestEnabled)" valueName="SearchSuggestEnabled">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SecurityKeyPermitAttestation)" explainText="$(string.SecurityKeyPermitAttestation_Explain)" key="Software\Policies\Microsoft\Edge" name="SecurityKeyPermitAttestation" presentation="$(presentation.SecurityKeyPermitAttestation)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="SecurityKeyPermitAttestationDesc" key="Software\Policies\Microsoft\Edge\SecurityKeyPermitAttestation" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.SendIntranetToInternetExplorer)" explainText="$(string.SendIntranetToInternetExplorer_Explain)" key="Software\Policies\Microsoft\Edge" name="SendIntranetToInternetExplorer" presentation="$(presentation.SendIntranetToInternetExplorer)" valueName="SendIntranetToInternetExplorer">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SendSiteInfoToImproveServices)" explainText="$(string.SendSiteInfoToImproveServices_Explain)" key="Software\Policies\Microsoft\Edge" name="SendSiteInfoToImproveServices" presentation="$(presentation.SendSiteInfoToImproveServices)" valueName="SendSiteInfoToImproveServices">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.ShowOfficeShortcutInFavoritesBar)" explainText="$(string.ShowOfficeShortcutInFavoritesBar_Explain)" key="Software\Policies\Microsoft\Edge" name="ShowOfficeShortcutInFavoritesBar" presentation="$(presentation.ShowOfficeShortcutInFavoritesBar)" valueName="ShowOfficeShortcutInFavoritesBar">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SignedHTTPExchangeEnabled)" explainText="$(string.SignedHTTPExchangeEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="SignedHTTPExchangeEnabled" presentation="$(presentation.SignedHTTPExchangeEnabled)" valueName="SignedHTTPExchangeEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SitePerProcess)" explainText="$(string.SitePerProcess_Explain)" key="Software\Policies\Microsoft\Edge" name="SitePerProcess" presentation="$(presentation.SitePerProcess)" valueName="SitePerProcess">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SpellcheckEnabled)" explainText="$(string.SpellcheckEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="SpellcheckEnabled" presentation="$(presentation.SpellcheckEnabled)" valueName="SpellcheckEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SpellcheckLanguage)" explainText="$(string.SpellcheckLanguage_Explain)" key="Software\Policies\Microsoft\Edge" name="SpellcheckLanguage" presentation="$(presentation.SpellcheckLanguage)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="SpellcheckLanguageDesc" key="Software\Policies\Microsoft\Edge\SpellcheckLanguage" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.SpellcheckLanguageBlocklist)" explainText="$(string.SpellcheckLanguageBlocklist_Explain)" key="Software\Policies\Microsoft\Edge" name="SpellcheckLanguageBlocklist" presentation="$(presentation.SpellcheckLanguageBlocklist)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <elements>
        <list id="SpellcheckLanguageBlocklistDesc" key="Software\Policies\Microsoft\Edge\SpellcheckLanguageBlocklist" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.SuppressUnsupportedOSWarning)" explainText="$(string.SuppressUnsupportedOSWarning_Explain)" key="Software\Policies\Microsoft\Edge" name="SuppressUnsupportedOSWarning" presentation="$(presentation.SuppressUnsupportedOSWarning)" valueName="SuppressUnsupportedOSWarning">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SyncDisabled)" explainText="$(string.SyncDisabled_Explain)" key="Software\Policies\Microsoft\Edge" name="SyncDisabled" presentation="$(presentation.SyncDisabled)" valueName="SyncDisabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.SyncDisabled)" explainText="$(string.SyncDisabled_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="SyncDisabled_recommended" presentation="$(presentation.SyncDisabled)" valueName="SyncDisabled">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.TabFreezingEnabled)" explainText="$(string.TabFreezingEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="TabFreezingEnabled" presentation="$(presentation.TabFreezingEnabled)" valueName="TabFreezingEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V79"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.TaskManagerEndProcessEnabled)" explainText="$(string.TaskManagerEndProcessEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="TaskManagerEndProcessEnabled" presentation="$(presentation.TaskManagerEndProcessEnabled)" valueName="TaskManagerEndProcessEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.TrackingPrevention)" explainText="$(string.TrackingPrevention_Explain)" key="Software\Policies\Microsoft\Edge" name="TrackingPrevention" presentation="$(presentation.TrackingPrevention)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V78"/>
      <elements>
        <enum id="TrackingPrevention" valueName="TrackingPrevention">
          <item displayName="$(string.TrackingPrevention_TrackingPreventionOff)">
            <value>
              <decimal value="0"/>
            </value>
          </item>
          <item displayName="$(string.TrackingPrevention_TrackingPreventionBasic)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.TrackingPrevention_TrackingPreventionBalanced)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.TrackingPrevention_TrackingPreventionStrict)">
            <value>
              <decimal value="3"/>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.TranslateEnabled)" explainText="$(string.TranslateEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="TranslateEnabled" presentation="$(presentation.TranslateEnabled)" valueName="TranslateEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.TranslateEnabled)" explainText="$(string.TranslateEnabled_Explain)" key="Software\Policies\Microsoft\Edge\Recommended" name="TranslateEnabled_recommended" presentation="$(presentation.TranslateEnabled)" valueName="TranslateEnabled">
      <parentCategory ref="microsoft_edge_recommended"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.URLBlocklist)" explainText="$(string.URLBlocklist_Explain)" key="Software\Policies\Microsoft\Edge" name="URLBlocklist" presentation="$(presentation.URLBlocklist)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="URLBlocklistDesc" key="Software\Policies\Microsoft\Edge\URLBlocklist" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.URLAllowlist)" explainText="$(string.URLAllowlist_Explain)" key="Software\Policies\Microsoft\Edge" name="URLAllowlist" presentation="$(presentation.URLAllowlist)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="URLAllowlistDesc" key="Software\Policies\Microsoft\Edge\URLAllowlist" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.UserDataDir)" explainText="$(string.UserDataDir_Explain)" key="Software\Policies\Microsoft\Edge" name="UserDataDir" presentation="$(presentation.UserDataDir)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="UserDataDir" maxLength="1000000" valueName="UserDataDir"/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.UserFeedbackAllowed)" explainText="$(string.UserFeedbackAllowed_Explain)" key="Software\Policies\Microsoft\Edge" name="UserFeedbackAllowed" presentation="$(presentation.UserFeedbackAllowed)" valueName="UserFeedbackAllowed">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.VideoCaptureAllowed)" explainText="$(string.VideoCaptureAllowed_Explain)" key="Software\Policies\Microsoft\Edge" name="VideoCaptureAllowed" presentation="$(presentation.VideoCaptureAllowed)" valueName="VideoCaptureAllowed">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.VideoCaptureAllowedUrls)" explainText="$(string.VideoCaptureAllowedUrls_Explain)" key="Software\Policies\Microsoft\Edge" name="VideoCaptureAllowedUrls" presentation="$(presentation.VideoCaptureAllowedUrls)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <list id="VideoCaptureAllowedUrlsDesc" key="Software\Policies\Microsoft\Edge\VideoCaptureAllowedUrls" valuePrefix=""/>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.WPADQuickCheckEnabled)" explainText="$(string.WPADQuickCheckEnabled_Explain)" key="Software\Policies\Microsoft\Edge" name="WPADQuickCheckEnabled" presentation="$(presentation.WPADQuickCheckEnabled)" valueName="WPADQuickCheckEnabled">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.WebDriverOverridesIncompatiblePolicies)" explainText="$(string.WebDriverOverridesIncompatiblePolicies_Explain)" key="Software\Policies\Microsoft\Edge" name="WebDriverOverridesIncompatiblePolicies" presentation="$(presentation.WebDriverOverridesIncompatiblePolicies)" valueName="WebDriverOverridesIncompatiblePolicies">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy class="Both" displayName="$(string.WebRtcLocalhostIpHandling)" explainText="$(string.WebRtcLocalhostIpHandling_Explain)" key="Software\Policies\Microsoft\Edge" name="WebRtcLocalhostIpHandling" presentation="$(presentation.WebRtcLocalhostIpHandling)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <enum id="WebRtcLocalhostIpHandling" valueName="WebRtcLocalhostIpHandling">
          <item displayName="$(string.WebRtcLocalhostIpHandling_AllowAllInterfaces)">
            <value>
              <string>default</string>
            </value>
          </item>
          <item displayName="$(string.WebRtcLocalhostIpHandling_AllowPublicAndPrivateInterfaces)">
            <value>
              <string>default_public_and_private_interfaces</string>
            </value>
          </item>
          <item displayName="$(string.WebRtcLocalhostIpHandling_AllowPublicInterfaceOnly)">
            <value>
              <string>default_public_interface_only</string>
            </value>
          </item>
          <item displayName="$(string.WebRtcLocalhostIpHandling_DisableNonProxiedUdp)">
            <value>
              <string>disable_non_proxied_udp</string>
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy class="Both" displayName="$(string.WebRtcUdpPortRange)" explainText="$(string.WebRtcUdpPortRange_Explain)" key="Software\Policies\Microsoft\Edge" name="WebRtcUdpPortRange" presentation="$(presentation.WebRtcUdpPortRange)">
      <parentCategory ref="microsoft_edge"/>
      <supportedOn ref="SUPPORTED_WIN7_V77"/>
      <elements>
        <text id="WebRtcUdpPortRange" maxLength="1000000" valueName="WebRtcUdpPortRange"/>
      </elements>
    </policy>
  </policies>
</policyDefinitions>
