<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 79.0.309.71--><displayName/><description/><resources><stringTable><string id="GoogleCast_group">Cast</string><string id="EnableMediaRouter">Enable Google Cast</string><string id="EnableMediaRouter_Explain">Enable this policy to enable Google Cast. Users will be able to launch it from the app menu, page context menus, media controls on Cast-enabled websites, and (if shown) the Cast toolbar icon.

Disable this policy to disable Google Cast.

By default, Google Cast is enabled.</string><string id="ShowCastIconInToolbar">Show the cast icon in the toolbar</string><string id="ShowCastIconInToolbar_Explain">Set this policy to true to show the Cast toolbar icon on the toolbar or the overflow menu. Users won't be able to remove it.

If you don't configure this policy or if you disable it, users can pin or remove the icon by using its contextual menu.

If you've also set the 'EnableMediaRouter' policy to false, then this policy is ignored, and the toolbar icon isn't shown.</string><string id="ContentSettings_group">Content settings</string><string id="DefaultCookiesSetting">Configure cookies</string><string id="DefaultCookiesSetting_Explain">Control whether websites can create cookies on the user's device. This policy is all or nothing - you can let all websites create cookies, or no websites create cookies. You can't use this policy to enable cookies from specific websites.

Set the policy to 'SessionOnly' (4) to clear cookies when the session closes. If Microsoft Edge is running in background mode, the session might not close when the last window is closed, meaning the cookies won't be cleared when the window closes. See 'BackgroundModeEnabled' policy for information about configuring what happens when Microsoft Edge runs in background mode.

If you don't configure this policy, the default 'AllowCookies' (1) is used, and users can change this setting in Microsoft Edge Settings. (If you don't want users to be able to change this setting, set the policy.)

* 1 = Let all sites create cookies

* 2 = Don't let any site create cookies

* 4 = Keep cookies for the duration of the session</string><string id="DefaultCookiesSetting_AllowCookies">Let all sites create cookies</string><string id="DefaultCookiesSetting_BlockCookies">Don't let any site create cookies</string><string id="DefaultCookiesSetting_SessionOnly">Keep cookies for the duration of the session</string><string id="DefaultImagesSetting">Default images setting</string><string id="DefaultImagesSetting_Explain">Set whether websites can display images. You can allow images on all sites (1) or block them on all sites (2).

If you don't configure this policy, images are allowed by default, and the user can change this setting.

* 1 = Allow all sites to show all images

* 2 = Don't allow any site to show images</string><string id="DefaultImagesSetting_AllowImages">Allow all sites to show all images</string><string id="DefaultImagesSetting_BlockImages">Don't allow any site to show images</string><string id="DefaultJavaScriptSetting">Default JavaScript setting</string><string id="DefaultJavaScriptSetting_Explain">Set whether websites can run JavaScript. You can allow it for all sites (1) or block it for all sites (2).

If you don't configure this policy, all sites can run JavaScript by default, and the user can change this setting.

* 1 = Allow all sites to run JavaScript

* 2 = Don't allow any site to run JavaScript</string><string id="DefaultJavaScriptSetting_AllowJavaScript">Allow all sites to run JavaScript</string><string id="DefaultJavaScriptSetting_BlockJavaScript">Don't allow any site to run JavaScript</string><string id="DefaultPluginsSetting">Default Adobe Flash setting</string><string id="DefaultPluginsSetting_Explain">Determines whether websites that aren't covered by 'PluginsAllowedForUrls' or 'PluginsBlockedForUrls' can automatically run the Adobe Flash plug-in. You can select 'BlockPlugins' (2) to block Adobe Flash on all sites, or you can select 'ClickToPlay' (3) to let Adobe Flash run but require the user to click the placeholder to start it. In any case, the 'PluginsAllowedForUrls' and 'PluginsBlockedForUrls' policies take precedence over 'DefaultPluginsSetting'.

Automatic playback is only allowed for domains explicitly listed in the 'PluginsAllowedForUrls' policy. If you want to enable automatic playback for all sites, consider adding http://* and https://* to this list.

If you don't configure this policy, the user can change this setting manually.

* 2 = Block the Adobe Flash plug-in

* 3 = Click to play

The former '1' option set allow-all, but this functionality is now only handled by the 'PluginsAllowedForUrls' policy.  Existing policies using '1' will operate in Click-to-play mode.</string><string id="DefaultPluginsSetting_BlockPlugins">Block the Adobe Flash plugin</string><string id="DefaultPluginsSetting_ClickToPlay">Click to play</string><string id="DefaultPopupsSetting">Default pop-up window setting</string><string id="DefaultPopupsSetting_Explain">Set whether websites can show pop-up windows. You can allow them on all websites (1) or block them on all sites (2).

If you don't configure this policy, pop-up windows are blocked by default, and users can change this setting.

* 1 = Allow all sites to show pop-ups

* 2 = Don't allow any site to show pop-up windows</string><string id="DefaultPopupsSetting_AllowPopups">Allow all sites to show pop-ups</string><string id="DefaultPopupsSetting_BlockPopups">Do not allow any site to show popups</string><string id="DefaultNotificationsSetting">Default notification setting</string><string id="DefaultNotificationsSetting_Explain">Set whether websites can display desktop notifications. You can allow them by default (1), deny them by default (2), or have the user be asked each time a website wants to show a notification (3).

If you don't configure this policy, notifications are allowed by default, and the user can change this setting.

* 1 = Allow sites to show desktop notifications

* 2 = Don't allow any site to show desktop notifications

* 3 = Ask every time a site wants to show desktop notifications</string><string id="DefaultNotificationsSetting_AllowNotifications">Allow sites to show desktop notifications</string><string id="DefaultNotificationsSetting_BlockNotifications">Don't allow any site to show desktop notifications</string><string id="DefaultNotificationsSetting_AskNotifications">Ask every time a site wants to show desktop notifications</string><string id="DefaultGeolocationSetting">Default geolocation setting</string><string id="DefaultGeolocationSetting_Explain">Set whether websites can track users' physical locations. You can allow tracking by default (1), deny it by default (2), or ask the user each time a website requests their location (3).

If you don't configure this policy, 'AskGeolocation' policy is used and the user can change it.

* 1 = Allow sites to track users' physical location

* 2 = Don't allow any site to track users' physical location

* 3 = Ask whenever a site wants to track users' physical location</string><string id="DefaultGeolocationSetting_AllowGeolocation">Allow sites to track users' physical location</string><string id="DefaultGeolocationSetting_BlockGeolocation">Don't allow any site to track users' physical location</string><string id="DefaultGeolocationSetting_AskGeolocation">Ask whenever a site wants to track users' physical location</string><string id="DefaultWebBluetoothGuardSetting">Control use of the Web Bluetooth API</string><string id="DefaultWebBluetoothGuardSetting_Explain">Control whether websites can access nearby Bluetooth devices. You can completely block access or require the site to ask the user each time it wants to access a Bluetooth device.

If you don't configure this policy, the default value (3, meaning users are asked each time) is used and users can change it.

* 2 = Don't allow any site to request access to Bluetooth devices by using the Web Bluetooth API

* 3 = Allow sites to ask the user to grant access to a nearby Bluetooth device</string><string id="DefaultWebBluetoothGuardSetting_BlockWebBluetooth">Do not allow any site to request access to Bluetooth devices via the Web Bluetooth API</string><string id="DefaultWebBluetoothGuardSetting_AskWebBluetooth">Allow sites to ask the user to grant access to a nearby Bluetooth device</string><string id="DefaultWebUsbGuardSetting">Control use of the WebUSB API</string><string id="DefaultWebUsbGuardSetting_Explain">Set whether websites can access connected USB devices. You can completely block access or ask the user each time a website wants to get access to connected USB devices.

You can override this policy for specific URL patterns by using the 'WebUsbAskForUrls' and 'WebUsbBlockedForUrls' policies.

If you don't configure this policy, sites can ask users whether they can access the connected USB devices (3) by default, and users can change this setting.

* 2 = Don't allow any site to request access to USB devices via the WebUSB API

* 3 = Allow sites to ask the user to grant access to a connected USB device</string><string id="DefaultWebUsbGuardSetting_BlockWebUsb">Do not allow any site to request access to USB devices via the WebUSB API</string><string id="DefaultWebUsbGuardSetting_AskWebUsb">Allow sites to ask the user to grant access to a connected USB device</string><string id="AutoSelectCertificateForUrls">Automatically select client certificates for these sites</string><string id="AutoSelectCertificateForUrls_Explain">Specify a list of sites, based on URL patterns, for which Microsoft Edge should automatically select a client certificate, if the site requests one.

The value must be an array of stringified JSON dictionaries. The form for each dictionary is { &quot;pattern&quot;: &quot;$URL_PATTERN&quot;, &quot;filter&quot; : $FILTER }, where $URL_PATTERN is a content setting pattern. $FILTER restricts from which client certificates the browser can automatically select. Independent of the filter, only certificates that match the server's certificate request can be used. For example, if $FILTER has the form { &quot;ISSUER&quot;: { &quot;CN&quot;: &quot;$ISSUER_CN&quot; } }, additionally only client certificates that are issued by a certificate with the CommonName $ISSUER_CN can be used. If $FILTER contains an &quot;ISSUER&quot; and a &quot;SUBJECT&quot; section, a client certificate must meet both conditions to be selected. If $FILTER specifies an organization (&quot;O&quot;), a certificate must have at least one organization that matches the specified value. If $FILTER specifies an organization unit (&quot;OU&quot;), a certificate must have at least one organization unit which matches the specified value. If $FILTER is the empty dictionary {}, the selection of client certificates isn't additionally restricted.

If you don't configure this policy, auto-selection isn't done for any site.

Example value:

{&quot;pattern&quot;:&quot;https://www.contoso.com&quot;,&quot;filter&quot;:{&quot;ISSUER&quot;:{&quot;CN&quot;:&quot;certificate issuer name&quot;, &quot;L&quot;: &quot;certificate issuer location&quot;, &quot;O&quot;: &quot;certificate issuer org&quot;, &quot;OU&quot;: &quot;certificate issuer org unit&quot;}, &quot;SUBJECT&quot;:{&quot;CN&quot;:&quot;certificate subject name&quot;, &quot;L&quot;: &quot;certificate subject location&quot;, &quot;O&quot;: &quot;certificate subject org&quot;, &quot;OU&quot;: &quot;certificate subject org unit&quot;}}}</string><string id="AutoSelectCertificateForUrlsDesc">Automatically select client certificates for these sites</string><string id="CookiesAllowedForUrls">Allow cookies on specific sites</string><string id="CookiesAllowedForUrls_Explain">Define a list of sites, based on URL patterns, that are allowed to set cookies.

If you don't configure this policy, the global default value from the 'DefaultCookiesSetting' policy (if set) or the user's personal configuration is used for all sites.

See the 'CookiesBlockedForUrls' and 'CookiesSessionOnlyForUrls' policies for more information.

Note there cannot be conflicting URL patterns set between these three policies:

- CookiesBlockedForUrls

- CookiesAllowedForUrls

- CookiesSesssionOnlyForUrls

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="CookiesAllowedForUrlsDesc">Allow cookies on specific sites</string><string id="CookiesBlockedForUrls">Block cookies on specific sites</string><string id="CookiesBlockedForUrls_Explain">Define a list of sites, based on URL patterns, that can't set cookies.

If you don't configure this policy, the global default value from the 'DefaultCookiesSetting' policy (if set) or the user's personal configuration is used for all sites.

See the 'CookiesAllowedForUrls' and 'CookiesSessionOnlyForUrls' policies for more information.

Note there cannot be conflicting URL patterns set between these three policies:

- CookiesBlockedForUrls

- CookiesAllowedForUrls

- CookiesSesssionOnlyForUrls

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="CookiesBlockedForUrlsDesc">Block cookies on specific sites</string><string id="CookiesSessionOnlyForUrls">Limit cookies from specific websites to the current session</string><string id="CookiesSessionOnlyForUrls_Explain">Cookies created by websites that match a URL pattern you define are deleted when the session ends (when the window closes).

Cookies created by websites that don't match the pattern are controlled by the 'DefaultCookiesSetting' policy (if set) or by the user's personal configuration. This is also the default behavior if you don't configure this policy.

If Microsoft Edge is running in background mode, the session might not close when the last window is closed, meaning the cookies won't be cleared when the window closes. See the 'BackgroundModeEnabled' policy for information about configuring what happens when Microsoft Edge runs in background mode.

You can also use the 'CookiesAllowedForUrls' and 'CookiesBlockedForUrls' policies to control which websites can create cookies.

Note there cannot be conflicting URL patterns set between these three policies:

- CookiesBlockedForUrls

- CookiesAllowedForUrls

- CookiesSesssionOnlyForUrls

If you set the 'RestoreOnStartup' policy to restore URLs from previous sessions, this policy is ignored, and cookies are stored permanently for those sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="CookiesSessionOnlyForUrlsDesc">Limit cookies from specific websites to the current session</string><string id="ImagesAllowedForUrls">Allow images on these sites</string><string id="ImagesAllowedForUrls_Explain">Define a list of sites, based on URL patterns, that can display images.

If you don't configure this policy, the global default value is used for all sites either from the 'DefaultImagesSetting' policy (if set) or the user's personal configuration.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="ImagesAllowedForUrlsDesc">Allow images on these sites</string><string id="ImagesBlockedForUrls">Block images on specific sites</string><string id="ImagesBlockedForUrls_Explain">Define a list of sites, based on URL patterns, that aren't allowed to display images.

If you don't configure this policy, the global default value from the 'DefaultImagesSetting' policy (if set) or the user's personal configuration is used for all sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="ImagesBlockedForUrlsDesc">Block images on specific sites</string><string id="JavaScriptAllowedForUrls">Allow JavaScript on specific sites</string><string id="JavaScriptAllowedForUrls_Explain">Define a list of sites, based on URL patterns, that are allowed to run JavaScript.

If you don't configure this policy, the global default value from the 'DefaultJavaScriptSetting' policy (if set) or the user's personal configuration is used for all sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="JavaScriptAllowedForUrlsDesc">Allow JavaScript on specific sites</string><string id="JavaScriptBlockedForUrls">Block JavaScript on specific sites</string><string id="JavaScriptBlockedForUrls_Explain">Define a list of sites, based on URL patterns, that aren't allowed to run JavaScript.

If you don't configure this policy, the global default value from the 'DefaultJavaScriptSetting' policy (if set) or the user's personal configuration is used for all sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="JavaScriptBlockedForUrlsDesc">Block JavaScript on specific sites</string><string id="PluginsAllowedForUrls">Allow the Adobe Flash plug-in on specific sites</string><string id="PluginsAllowedForUrls_Explain">Define a list of sites, based on URL patterns, that can run the Adobe Flash plug-in.

If you don't configure this policy, the global default value from the 'DefaultPluginsSetting' policy (if set) or the user's personal configuration is used for all sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="PluginsAllowedForUrlsDesc">Allow the Adobe Flash plug-in on specific sites</string><string id="PluginsBlockedForUrls">Block the Adobe Flash plug-in on specific sites</string><string id="PluginsBlockedForUrls_Explain">Define a list of sites, based on URL patterns, that are blocked from running Adobe Flash.

If you don't configure this policy, the global default value from the 'DefaultPluginsSetting' policy (if set) or the user's personal configuration is used for all sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="PluginsBlockedForUrlsDesc">Block the Adobe Flash plug-in on specific sites</string><string id="PopupsAllowedForUrls">Allow pop-up windows on specific sites</string><string id="PopupsAllowedForUrls_Explain">Define a list of sites, based on URL patterns, that can open pop-up windows.

If you don't configure this policy, the global default value from the 'DefaultPopupsSetting' policy (if set) or the user's personal configuration is used for all sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="PopupsAllowedForUrlsDesc">Allow pop-up windows on specific sites</string><string id="RegisteredProtocolHandlers">Register protocol handlers</string><string id="RegisteredProtocolHandlers_Explain">Register a list of protocol handlers. Set the protocol property to the scheme (like 'mailto') and the url property to the URL pattern of the application that handles the scheme. The pattern can include a '%s', which will be replaced by the handled URL.

You can recommend a specific value for this policy, but you can't require that your users use it.

The protocol handlers registered by policy are merged with any handlers registered by the user, and both are available for use. The user can override the protocol handlers installed by policy by installing a new default handler, but they can't remove a protocol handler registered by policy.

Example value:

[
  {
    &quot;url&quot;: &quot;https://mail.contoso.com/mail/?extsrc=mailto&amp;url=%s&quot;, 
    &quot;default&quot;: true, 
    &quot;protocol&quot;: &quot;mailto&quot;
  }
]</string><string id="PopupsBlockedForUrls">Block pop-up windows on specific sites</string><string id="PopupsBlockedForUrls_Explain">Define a list of sites, based on URL patterns, that are blocked from opening pop-up windows.

If you don't configure this policy, the global default value from the 'DefaultPopupsSetting' policy (if set) or the user's personal configuration is used for all sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="PopupsBlockedForUrlsDesc">Block pop-up windows on specific sites</string><string id="NotificationsAllowedForUrls">Allow notifications on specific sites</string><string id="NotificationsAllowedForUrls_Explain">Define a list of sites, based on URL patterns, that can display notifications.

If you don't configure this policy, the global default value from the 'DefaultNotificationsSetting' policy (if set) or the user's personal configuration is used for all sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="NotificationsAllowedForUrlsDesc">Allow notifications on specific sites</string><string id="NotificationsBlockedForUrls">Block notifications on specific sites</string><string id="NotificationsBlockedForUrls_Explain">Define a list of sites, based on URL patterns, that are blocked from displaying notifications.

If you don't configure this policy, the global default value from the 'DefaultNotificationsSetting' policy (if set) or the user's personal configuration is used for all sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="NotificationsBlockedForUrlsDesc">Block notifications on specific sites</string><string id="WebUsbAllowDevicesForUrls">Grant access to specific sites to connect to specific USB devices</string><string id="WebUsbAllowDevicesForUrls_Explain">Allows you to set a list of urls that specify which sites will automatically be granted permission to access a USB device with the given vendor and product IDs. Each item in the list must contain both devices and urls in order for the policy to be valid. Each item in devices can contain a vendor ID and product ID field. Any ID that is omitted is treated as a wildcard with one exception, and that exception is that a product ID cannot be specified without a vendor ID also being specified. Otherwise, the policy will not be valid and will be ignored.

The USB permission model uses the URL of the requesting site (&quot;requesting URL&quot;) and the URL of the top-level frame site (&quot;embedding URL&quot;) to grant permission to the requesting URL to access the USB device. The requesting URL may be different than the embedding URL when the requesting site is loaded in an iframe. Therefore, the &quot;urls&quot; field can contain up to two URL strings delimited by a comma to specify the requesting and embedding URL respectively. If only one URL is specified, then access to the corresponding USB devices will be granted when the requesting site's URL matches this URL regardless of embedding status. The URLs in &quot;urls&quot; must be valid URLs, otherwise the policy will be ignored.

If this policy is left not set, the global default value will be used for all sites either from the 'DefaultWebUsbGuardSetting' policy if it is set, or the user's personal configuration otherwise.

URL patterns in this policy should not clash with the ones configured via WebUsbBlockedForUrls. If there is a clash, this policy will take precedence over WebUsbBlockedForUrls and WebUsbAskForUrls.

Example value:

[
  {
    &quot;urls&quot;: [
      &quot;https://contoso.com&quot;, 
      &quot;https://fabrikam.com&quot;
    ], 
    &quot;devices&quot;: [
      {
        &quot;vendor_id&quot;: 1234, 
        &quot;product_id&quot;: 5678
      }
    ]
  }
]</string><string id="WebUsbAskForUrls">Allow WebUSB on specific sites</string><string id="WebUsbAskForUrls_Explain">Define a list of sites, based on URL patterns, that can ask the user for access to a USB device.

If you don't configure this policy, the global default value from the 'DefaultWebUsbGuardSetting' policy (if set) or the user's personal configuration is used for all sites.

The URL patterns defined in this policy can't conflict with those configured in the 'WebUsbBlockedForUrls' policy - you can't both allow and block a URL.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="WebUsbAskForUrlsDesc">Allow WebUSB on specific sites</string><string id="WebUsbBlockedForUrls">Block WebUSB on specific sites</string><string id="WebUsbBlockedForUrls_Explain">Define a list of sites, based on URL patterns, that can't ask the user to grant them access to a USB device.

If you don't configure this policy, the global default value from the 'DefaultWebUsbGuardSetting' policy (if set) or the user's personal configuration is used for all sites.

URL patterns in this policy can't conflict with those configured in the 'WebUsbAskForUrls' policy. You can't both allow and block a URL.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="WebUsbBlockedForUrlsDesc">Block WebUSB on specific sites</string><string id="DefaultSearchProvider_group">Default search provider</string><string id="DefaultSearchProviderEnabled">Enable the default search provider</string><string id="DefaultSearchProviderEnabled_Explain">Enables the use of a default search provider.

If you enable this policy, a user can search for a term by typing in the address bar (as long as what they type isn't a URL).

You can specify the default search provider to use by enabling the rest of the default search policies. If these are left empty (not configured), the user can choose the default provider.

If you disable this policy, the user can't search from the address bar.

If you enable or disable this policy, users can't change or override it.

If you don't configure this policy, the default search provider is enabled, and the user can choose the default search provider and set the search provider list.

This policy is available only on Windows instances that are joined to a Microsoft Active Directory domain or Windows 10 Pro or Enterprise instances that are enrolled for device management.</string><string id="DefaultSearchProviderName">Default search provider name</string><string id="DefaultSearchProviderName_Explain">Specifies the name of the default search provider.

If you enable this policy, you set the name of the default search provider.

If you don't enable this policy or if you leave it empty, the host name specified by the search URL is used.

'DefaultSearchProviderName' should be set to an organization-approved encrypted search provider that corresponds to the encrypted search provider set in DTBC-0008. This policy is applied only if you enable the 'DefaultSearchProviderEnabled' and 'DefaultSearchProviderSearchURL' policies.

Example value: My Intranet Search</string><string id="DefaultSearchProviderKeyword">Default search provider keyword</string><string id="DefaultSearchProviderKeyword_Explain">Specifies the keyword, which is the shortcut used in the Address Bar to trigger the search for this provider.

This policy is optional. If you don't configure it, no keyword activates the search provider.

This policy is applied only if you enable the 'DefaultSearchProviderEnabled' and 'DefaultSearchProviderSearchURL' policies.

Example value: mis</string><string id="DefaultSearchProviderSearchURL">Default search provider search URL</string><string id="DefaultSearchProviderSearchURL_Explain">Specifies the URL of the search engine used for a default search. The URL contains the string '{searchTerms}', which is replaced at query time by the terms the user is searching for.

Specify Bing's search URL as:

'{bing:baseURL}search?q={searchTerms}'.

Specify Google's search URL as: '{google:baseURL}search?q={searchTerms}&amp;{google:RLZ}{google:originalQueryForSuggestion}{google:assistedQueryStats}{google:searchFieldtrialParameter}{google:searchClient}{google:sourceId}ie={inputEncoding}'.

This policy is required when you enable the 'DefaultSearchProviderEnabled' policy; if you don't enable the latter policy, this policy is ignored.

Example value: https://search.contoso.com/search?q={searchTerms}</string><string id="DefaultSearchProviderSuggestURL">Default search provider URL for suggestions</string><string id="DefaultSearchProviderSuggestURL_Explain">Specifies the URL for the search engine used to provide search suggestions. The URL contains the string '{searchTerms}', which is replaced at query time by the text the user has entered so far.

This policy is optional. If you don't configure it, users won't see search suggestions; they will see suggestions from their browsing history and favorites.

Bing's suggest URL can be specified as:

'{bing:baseURL}qbox?query={searchTerms}'.

Google's suggest URL can be specified as: '{google:baseURL}complete/search?output=chrome&amp;q={searchTerms}'.

This policy is applied only if you enable the 'DefaultSearchProviderEnabled' and 'DefaultSearchProviderSearchURL' policies.

Example value: https://search.contoso.com/suggest?q={searchTerms}</string><string id="DefaultSearchProviderEncodings">Default search provider encodings</string><string id="DefaultSearchProviderEncodings_Explain">Specify the character encodings supported by the search provider. Encodings are code page names like UTF-8, GB2312, and ISO-8859-1. They are tried in the order provided.

This policy is optional. If not configured, the default, UTF-8, is used.

This policy is applied only if you enable the 'DefaultSearchProviderEnabled' and 'DefaultSearchProviderSearchURL' policies.

Example value:

UTF-8
UTF-16
GB2312
ISO-8859-1</string><string id="DefaultSearchProviderEncodingsDesc">Default search provider encodings</string><string id="DefaultSearchProviderImageURL">Specifies the search-by-image feature for the default search provider</string><string id="DefaultSearchProviderImageURL_Explain">Specifies the URL to the search engine used for image search. Search requests are sent using the GET method.

This policy is optional. If you don't configure it, image search isn't available.

Specify Bing's Image Search URL as:
'{bing:baseURL}images/detail/search?iss=sbiupload&amp;FORM=ANCMS1#enterInsights'.

Specify Google's Image Search URL as: '{google:baseURL}searchbyimage/upload'.

See 'DefaultSearchProviderImageURLPostParams' policy to finish configuring image search.

This policy is applied only if you enable the 'DefaultSearchProviderEnabled' and 'DefaultSearchProviderSearchURL' policies.

Example value: https://search.contoso.com/searchbyimage/upload</string><string id="DefaultSearchProviderImageURLPostParams">Parameters for an image URL that uses POST</string><string id="DefaultSearchProviderImageURLPostParams_Explain">If you enable this policy, it specifies the parameters used when an image search that uses POST is performed. The policy consists of comma-separated name/value pairs. If a value is a template parameter, like {imageThumbnail} in the preceding example, it’s replaced with real image thumbnail data. This policy is applied only if you enable the 'DefaultSearchProviderEnabled' and 'DefaultSearchProviderSearchURL' policies.

Specify Bing's Image Search URL Post Params as:
'imageBin={google:imageThumbnailBase64}'.

Specify Google's Image Search URL Post Params as:
'encoded_image={google:imageThumbnail},image_url={google:imageURL},sbisrc={google:imageSearchSource},original_width={google:imageOriginalWidth},original_height={google:imageOriginalHeight}'.

If you don’t set this policy, image search requests are sent using the GET method.

Example value: content={imageThumbnail},url={imageURL},sbisrc={SearchSource}</string><string id="Extensions_group">Extensions</string><string id="ExtensionInstallBlocklist">Control which extensions cannot be installed</string><string id="ExtensionInstallBlocklist_Explain">List specific extensions that users can NOT install in Microsoft Edge. When you deploy this policy, any extensions on this list that were previously installed will be disabled, and the user won't be able to enable them. If you remove an item from the list of blocked extensions, that extension is automatically re-enabled anywhere it was previously installed.

Use &quot;*&quot; to block all extensions that aren't explicitly listed in the allow list.

If you don't configure this policy, users can install any extension in Microsoft Edge.

Example value:

extension_id1
extension_id2</string><string id="ExtensionInstallBlocklistDesc">Control which extensions cannot be installed</string><string id="ExtensionInstallAllowlist">Allow specific extensions to be installed</string><string id="ExtensionInstallAllowlist_Explain">By default, all extensions are allowed. However, if you block all extensions by setting the 'ExtensionInstallBlockList' policy to &quot;*,&quot; users can only install extensions defined in this policy.

Example value:

extension_id1
extension_id2</string><string id="ExtensionInstallAllowlistDesc">Allow specific extensions to be installed</string><string id="ExtensionInstallForcelist">Control which extensions are installed silently</string><string id="ExtensionInstallForcelist_Explain">Specifies extensions that are installed silently, without user interaction, and that the users can't uninstall or disable (&quot;force-installed&quot;). All permissions requested by the extensions are granted implicitly, without user interaction, including any additional permissions requested by future versions of the extension. Furthermore, permissions are granted for the enterprise.deviceAttributes and enterprise.platformKeys extension APIs. (These two APIs are only available to extensions that are force-installed.)

This policy takes precedence over a potentially conflicting 'ExtensionInstallBlocklist' policy. When you take an extension off of the force-installed list it's automatically uninstalled by Microsoft Edge.

For Windows devices that aren't joined to a Microsoft Active Directory domain, forced installation is limited to extensions available in the Microsoft Store.

Note that users can modify the source code of any extension by using Developer Tools, potentially rendering the extension dysfunctional. If this is a concern, set the 'DeveloperToolsAvailability' policy.

Use the following format to add an extension to the list:

[extensionID];[updateURL]

- extensionID - the 32-letter string found on edge://extensions when in developer mode.

- updateURL (optional) is the address of the Update Manifest XML document for the app or extension, as described at https://go.microsoft.com/fwlink/?linkid=2095043. If you don't set the updateURL, the Microsoft Store update URL is used (currently https://edge.microsoft.com/extensionwebstorebase/v1/crx).  Note that the update URL set in this policy is only used for the initial installation; subsequent updates of the extension use the update URL indicated in the extension's manifest.

For example, gggmmkjegpiggikcnhidnjjhmicpibll;https://edge.microsoft.com/extensionwebstorebase/v1/crx installs the Microsoft Online app from the Microsoft Store &quot;update&quot; URL. For more information about hosting extensions, see: https://go.microsoft.com/fwlink/?linkid=2095044.

If you don't configure this policy, no extensions are installed automatically, and users can uninstall any extension in Microsoft Edge.

Note that this policy doesn't apply to InPrivate mode.

Example value:

gbchcmhmhahfdphkhkmpfmihenigjmpp;https://edge.microsoft.com/extensionwebstorebase/v1/crx
abcdefghijklmnopabcdefghijklmnop</string><string id="ExtensionInstallForcelistDesc">Control which extensions are installed silently</string><string id="ExtensionInstallSources">Configure extension and user script install sources</string><string id="ExtensionInstallSources_Explain">Define URLs that can install extensions and themes.

By default, users have to download a *.crx file for each extension or script they want to install, and then drag it onto the Microsoft Edge settings page. This policy lets specific URLs use install the extension or script for the user.

Each item in this list is an extension-style match pattern (see https://go.microsoft.com/fwlink/?linkid=2095039). Users can easily install items from any URL that matches an item in this list. Both the location of the *.crx file and the page where the download is started from (in other words, the referrer) must be allowed by these patterns.

The 'ExtensionInstallBlocklist' policy takes precedence over this policy. Any extensions that's on the block list won't be installed, even if it comes from a site on this list.

Example value:

https://corp.contoso.com/*</string><string id="ExtensionInstallSourcesDesc">Configure extension and user script install sources</string><string id="ExtensionAllowedTypes">Configure allowed extension types</string><string id="ExtensionAllowedTypes_Explain">Controls which extension types can be installed and limits runtime access.

This setting defines the allowed types of extensions and which hosts they can interact with. The value is a list of strings, each of which should be one of the following: &quot;extension&quot;, &quot;theme&quot;, &quot;user_script&quot;, and &quot;hosted_app&quot;. See the Microsoft Edge extensions documentation for more information on these types.

Note that this policy also affects extensions to be force-installed by using 'ExtensionInstallForcelist' policy.

If you enable this policy, only extensions that match a type in the list are installed.

If you don't configure this policy, no restrictions on the acceptable extension types are enforced.

Example value:

hosted_app</string><string id="ExtensionAllowedTypesDesc">Configure allowed extension types</string><string id="ExtensionSettings">Configure extension management settings</string><string id="ExtensionSettings_Explain">Configures extension management settings for Microsoft Edge.

This policy controls multiple settings, including settings controlled by any existing extension-related policies. This policy overrides any legacy policies if both are set.

This policy maps an extension ID or an update URL to its configuration. With an extension ID, the configuration is applied only to the specified extension. Set a default configuration for the special ID &quot;*&quot;, to apply to all extensions that aren't specifically listed in this policy. With an update URL, the configuration is applied to all extensions with the exact update URL stated in manifest of this extension, as described at https://go.microsoft.com/fwlink/?linkid=2095043.

Example value:

{
  &quot;abcdefghijklmnopabcdefghijklmnop&quot;: {
    &quot;blocked_permissions&quot;: [
      &quot;history&quot;
    ], 
    &quot;installation_mode&quot;: &quot;allowed&quot;, 
    &quot;minimum_version_required&quot;: &quot;1.0.1&quot;
  }, 
  &quot;bcdefghijklmnopabcdefghijklmnopa&quot;: {
    &quot;runtime_blocked_hosts&quot;: [
      &quot;*://*.contoso.com&quot;
    ], 
    &quot;allowed_permissions&quot;: [
      &quot;downloads&quot;
    ], 
    &quot;update_url&quot;: &quot;https://contoso.com/update_url&quot;, 
    &quot;runtime_allowed_hosts&quot;: [
      &quot;*://good.contoso.com&quot;
    ], 
    &quot;installation_mode&quot;: &quot;force_installed&quot;
  }, 
  &quot;cdefghijklmnopabcdefghijklmnopab&quot;: {
    &quot;blocked_install_message&quot;: &quot;Custom error message.&quot;, 
    &quot;installation_mode&quot;: &quot;blocked&quot;
  }, 
  &quot;*&quot;: {
    &quot;blocked_permissions&quot;: [
      &quot;downloads&quot;, 
      &quot;bookmarks&quot;
    ], 
    &quot;installation_mode&quot;: &quot;blocked&quot;, 
    &quot;runtime_blocked_hosts&quot;: [
      &quot;*://*.contoso.com&quot;
    ], 
    &quot;blocked_install_message&quot;: &quot;Custom error message.&quot;, 
    &quot;allowed_types&quot;: [
      &quot;hosted_app&quot;
    ], 
    &quot;runtime_allowed_hosts&quot;: [
      &quot;*://good.contoso.com&quot;
    ], 
    &quot;install_sources&quot;: [
      &quot;https://company-intranet/apps&quot;
    ]
  }, 
  &quot;defghijklmnopabcdefghijklmnopabc,efghijklmnopabcdefghijklmnopabcd&quot;: {
    &quot;blocked_install_message&quot;: &quot;Custom error message.&quot;, 
    &quot;installation_mode&quot;: &quot;blocked&quot;
  }, 
  &quot;fghijklmnopabcdefghijklmnopabcde&quot;: {
    &quot;blocked_install_message&quot;: &quot;Custom removal message.&quot;, 
    &quot;installation_mode&quot;: &quot;removed&quot;
  }, 
  &quot;update_url:https://www.contoso.com/update.xml&quot;: {
    &quot;blocked_permissions&quot;: [
      &quot;wallpaper&quot;
    ], 
    &quot;allowed_permissions&quot;: [
      &quot;downloads&quot;
    ], 
    &quot;installation_mode&quot;: &quot;allowed&quot;
  }
}</string><string id="HTTPAuthentication_group">HTTP authentication</string><string id="AuthSchemes">Supported authentication schemes</string><string id="AuthSchemes_Explain">Specifies which HTTP authentication schemes are supported.

You can configure the policy by using these values: 'basic', 'digest', 'ntlm', and 'negotiate'. Separate multiple values with commas.

If you don't configure this policy, all four schemes are used.

Example value: basic,digest,ntlm,negotiate</string><string id="DisableAuthNegotiateCnameLookup">Disable CNAME lookup when negotiating Kerberos authentication</string><string id="DisableAuthNegotiateCnameLookup_Explain">Determines whether the generated Kerberos SPN is based on the canonical DNS name (CNAME) or on the original name entered.

If you enable this policy, CNAME lookup is skipped and the server name (as entered) is used.

If you disable this policy or don't configure it, the canonical name of the server is used.  This is determined through CNAME lookup.</string><string id="EnableAuthNegotiatePort">Include non-standard port in Kerberos SPN</string><string id="EnableAuthNegotiatePort_Explain">Specifies whether the generated Kerberos SPN should include a non-standard port.

If you enable this policy, and a user includes a non-standard port (a port other than 80 or 443) in a URL, that port is included in the generated Kerberos SPN.

If you don't configure or disable this policy, the generated Kerberos SPN won't include a port in any case.</string><string id="AuthServerAllowlist">Configure list of allowed authentication servers</string><string id="AuthServerAllowlist_Explain">Specifies which servers to enable for integrated authentication. Integrated authentication is only enabled when Microsoft Edge receives an authentication challenge from a proxy or from a server in this list.

Separate multiple server names with commas. Wildcards (*) are allowed.

If you don't configure this policy, Microsoft Edge tries to detect if a server is on the intranet - only then will it respond to IWA requests. If the server is on the internet, IWA requests from it are ignored by Microsoft Edge.

Example value: *contoso.com,contoso.com</string><string id="AuthNegotiateDelegateAllowlist">Specifies a list of servers that Microsoft Edge can delegate user credentials to</string><string id="AuthNegotiateDelegateAllowlist_Explain">Configure the list of servers that Microsoft Edge can delegate to.

Separate multiple server names with commas. Wildcards (*) are allowed.

If you don't configure this policy Microsoft Edge won't delegate user credentials even if a server is detected as Intranet.

Example value: contoso.com</string><string id="AllowCrossOriginAuthPrompt">Allow cross-origin HTTP Basic Auth prompts</string><string id="AllowCrossOriginAuthPrompt_Explain">Controls whether third-party sub-content on a page can open an HTTP Basic Auth dialog box.

Typically, this is disabled as a phishing defense. If you don't configure this policy, it's disabled and third-party sub-content can't open a HTTP Basic Auth dialog box.</string><string id="NativeMessaging_group">Native Messaging</string><string id="NativeMessagingBlocklist">Configure native messaging block list</string><string id="NativeMessagingBlocklist_Explain">Specifies which native messaging hosts that shouldn't be used.

Use '*' to block all native messaging hosts unless they are explicitly listed in the allow list.

If you don't configure this policy, Microsoft Edge will load all installed native messaging hosts.

Example value:

com.native.messaging.host.name1
com.native.messaging.host.name2</string><string id="NativeMessagingBlocklistDesc">Configure native messaging block list</string><string id="NativeMessagingAllowlist">Control which native messaging hosts users can use</string><string id="NativeMessagingAllowlist_Explain">List specific native messaging hosts that users can use in Microsoft Edge.

By default, all native messaging hosts are allowed. If you set the 'NativeMessagingBlocklist' policy to *, all native messaging hosts are blocked, and only native messaging hosts listed in here are loaded.

Example value:

com.native.messaging.host.name1
com.native.messaging.host.name2</string><string id="NativeMessagingAllowlistDesc">Control which native messaging hosts users can use</string><string id="NativeMessagingUserLevelHosts">Allow user-level native messaging hosts (installed without admin permissions)</string><string id="NativeMessagingUserLevelHosts_Explain">Enables user-level installation of native messaging hosts.

If you disable this policy, Microsoft Edge will only use native messaging hosts installed on the system level.

By default, if you don't configure this policy, Microsoft Edge will allow usage of user-level native messaging hosts.</string><string id="PasswordManager_group">Password manager and protection</string><string id="PasswordManagerEnabled">Enable saving passwords to the password manager</string><string id="PasswordManagerEnabled_Explain">Enable Microsoft Edge to save user passwords.

If you enable this policy, users can save their passwords in Microsoft Edge. The next time they visit the site, Microsoft Edge will enter the password automatically.

If you disable this policy, users can't save new passwords, but they can still use previously saved passwords.

If you enable or disable this policy, users can't change or override it in Microsoft Edge. If you don't configure it, users can save passwords, as well as turn this feature off.</string><string id="PasswordProtectionWarningTrigger">Configure password protection warning trigger</string><string id="PasswordProtectionWarningTrigger_Explain">Allows you to control when to trigger password protection warning. Password protection alerts users when they reuse their protected password on potentially suspicious sites.

You can use the 'PasswordProtectionLoginURLs' and 'PasswordProtectionChangePasswordURL' policies to configure which passwords to protect.

Exemptions: Passwords for the sites listed in 'PasswordProtectionLoginURLs' and 'PasswordProtectionChangePasswordURL', as well as for the sites listed in 'SmartScreenAllowListDomains', will not trigger a password-protection warning.

Set to 'PasswordProtectionWarningOff' (0) to not show password protection warningss.

Set to 'PasswordProtectionWarningOnPasswordReuse' (1) to show password protection warnings when the user reuses their protected password on a non-whitelisted site.

If you disable or don't configure this policy, then the warning trigger is not shown.

* 0 = Password protection warning is off.

* 1 = Password protection warning is triggered by password reuse.</string><string id="PasswordProtectionWarningTrigger_PasswordProtectionWarningOff">Password protection warning is off</string><string id="PasswordProtectionWarningTrigger_PasswordProtectionWarningOnPasswordReuse">Password protection warning is triggered by password reuse</string><string id="PasswordProtectionLoginURLs">Configure the list of enterprise login URLs where password protection service should capture fingerprint of password</string><string id="PasswordProtectionLoginURLs_Explain">Configure the list of enterprise login URLs (HTTP and HTTPS schemes only) where Microsoft Edge should capture the fingerprint of passwords and use it for password reuse detection.

If you enable this policy, the password protection service captures fingerprints of passwords on the defined URLs.

If you disable this policy or don't configure it, no password fingerprints are captured.

This policy is available only on Windows instances that are joined to a Microsoft Active Directory domain or Windows 10 Pro or Enterprise instances that are enrolled for device management.

Example value:

https://contoso.com/login.html
https://login.contoso.com</string><string id="PasswordProtectionLoginURLsDesc">Configure the list of enterprise login URLs where password protection service should capture fingerprint of password</string><string id="PasswordProtectionChangePasswordURL">Configure the change password URL</string><string id="PasswordProtectionChangePasswordURL_Explain">Configures the change password URL (HTTP and HTTPS schemes only).

Password protection service will send users to this URL to change their password after seeing a warning in the browser.

If you enable this policy, then password protection service sends users to this URL to change their password.

If you disable this policy or don't configure it, then password protection service will not redirect users to a change password URL.

This policy is available only on Windows instances that are joined to a Microsoft Active Directory domain or Windows 10 Pro or Enterprise instances that are enrolled for device management.

Example value: https://contoso.com/change_password.html</string><string id="Printing_group">Printing</string><string id="PrintingEnabled">Enable printing</string><string id="PrintingEnabled_Explain">Enables printing in Microsoft Edge and prevents users from changing this setting.

If you enable this policy or don't configure it, users can print.

If you disable this policy, users can't print from Microsoft Edge. Printing is disabled in the wrench menu, extensions, JavaScript applications, and so on. Users can still print from plug-ins that bypass Microsoft Edge while printing. For example, certain Adobe Flash applications have the print option in their context menu, which isn't covered by this policy.</string><string id="UseSystemPrintDialog">Print using system print dialog</string><string id="UseSystemPrintDialog_Explain">Shows the system print dialog instead of print preview.

If you enable this policy, Microsoft Edge opens the system print dialog instead of the built-in print preview when a user prints a page.

If you don't configure or disable this policy, print commands trigger the Microsoft Edge print preview screen.</string><string id="PrintHeaderFooter">Print headers and footers</string><string id="PrintHeaderFooter_Explain">Force 'headers and footers' to be on or off in the printing dialog.

If you don't configure this policy, users can decide whether to print headers and footers.

If you disable this policy, users can't print headers and footers.

If you enable this policy, users always print headers and footers.</string><string id="DefaultPrinterSelection">Default printer selection rules</string><string id="DefaultPrinterSelection_Explain">Overrides Microsoft Edge default printer selection rules. This policy determines the rules for selecting the default printer in Microsoft Edge, which happens the first time a user tries to print a page.

When this policy is set, Microsoft Edge tries to find a printer that matches all of the specified attributes and uses it as default printer. If there are multiple printers that meet the criteria, the first printer that matches is used.

If you don't configure this policy or no matching printers are found within the timeout, the printer defaults to the built-in PDF printer or no printer, if the PDF printer isn't available.

The value is parsed as a JSON object, conforming to the following schema: { &quot;type&quot;: &quot;object&quot;, &quot;properties&quot;: { &quot;idPattern&quot;: { &quot;description&quot;: &quot;Regular expression to match printer id.&quot;, &quot;type&quot;: &quot;string&quot; }, &quot;namePattern&quot;: { &quot;description&quot;: &quot;Regular expression to match printer display name.&quot;, &quot;type&quot;: &quot;string&quot; } } }

Omitting a field means all values match; for example, if you don't specify connectivity Print Preview starts discovering all kinds of local printers. Regular expression patterns must follow the JavaScript RegExp syntax and matches are case sensitive.

Example value: { &quot;idPattern&quot;: &quot;.*public&quot;, &quot;namePattern&quot;: &quot;.*Color&quot; }</string><string id="PrintPreviewUseSystemDefaultPrinter">Set the system default printer as the default printer</string><string id="PrintPreviewUseSystemDefaultPrinter_Explain">Tells Microsoft Edge to use the system default printer as the default choice in Print Preview instead of the most recently used printer.

If you disable this policy or don't configure it, Print Preview uses the most recently used printer as the default destination choice.

If you enable this policy, Print Preview uses the OS system default printer as the default destination choice.</string><string id="Proxy_group">Proxy server</string><string id="ProxyMode">Configure proxy server settings</string><string id="ProxyMode_Explain">Specify the proxy server settings used by Microsoft Edge. If you enable this policy, users can't change the proxy settings.

If you choose to never use a proxy server and to always connect directly, all other options are ignored.

If you choose to use system proxy settings, all other options are ignored.

If you choose to auto detect the proxy server, all other options are ignored.

If you choose fixed server proxy mode, you can specify further options in 'ProxyServer' and 'Comma-separated list of proxy bypass rules'.

If you choose to use a .pac proxy script, you must specify the URL to the script in 'URL to a proxy .pac file'.

For detailed examples, go to https://go.microsoft.com/fwlink/?linkid=2094936.

If you enable this policy, Microsoft Edge will ignore all proxy-related options specified from the command line.

If you don't configure this policy users can choose their own proxy settings.

* &quot;direct&quot; = Never use a proxy

* &quot;auto_detect&quot; = Auto detect proxy settings

* &quot;pac_script&quot; = Use a .pac proxy script

* &quot;fixed_servers&quot; = Use fixed proxy servers

* &quot;system&quot; = Use system proxy settings

Example value: direct</string><string id="ProxyMode_ProxyDisabled">Never use a proxy</string><string id="ProxyMode_ProxyAutoDetect">Auto detect proxy settings</string><string id="ProxyMode_ProxyPacScript">Use a .pac proxy script</string><string id="ProxyMode_ProxyFixedServers">Use fixed proxy servers</string><string id="ProxyMode_ProxyUseSystem">Use system proxy settings</string><string id="ProxyServer">Configure address or URL of proxy server</string><string id="ProxyServer_Explain">Specifies the URL of the proxy server.

This policy is applied only if you have selected 'Use fixed proxy servers' in the 'ProxyMode' policy. If you selected any other mode for configuring proxy policies, don't enable or configure this policy.

If you enable this policy, the proxy server configured by this policy will be used for all URLs.

If you disable or don't configure this policy, users can choose their own proxy settings while in this proxy mode. Leave this policy unconfigured if you've specified any other method for setting proxy policies.

For more options and detailed examples, see https://go.microsoft.com/fwlink/?linkid=2094936.

Example value: 123.123.123.123:8080</string><string id="ProxyPacUrl">Set the proxy .pac file URL</string><string id="ProxyPacUrl_Explain">Specifies the URL for a proxy auto-config (PAC) file.

This policy is applied only if you selected 'Use a .pac proxy script' in the 'ProxyMode' policy. If you selected any other mode for configuring proxy policies, don't enable or configure this policy.

If you enable this policy, you can specify the URL for a PAC file, which defines how the browser automatically chooses the appropriate proxy server for fetching a particular website.

If you disable or don't configure this policy, no PAC file is specified. Leave this policy unconfigured if you've specified any other method for setting proxy policies.

For detailed examples, see https://go.microsoft.com/fwlink/?linkid=2094936.

Example value: https://internal.contoso.com/example.pac</string><string id="ProxyBypassList">Configure proxy bypass rules</string><string id="ProxyBypassList_Explain">Defines a list of hosts for which Microsoft Edge bypasses any proxy.

This policy is applied only if you have selected 'Use fixed proxy servers' in the 'ProxyMode' policy. If you selected any other mode for configuring proxy policies, don't enable or configure this policy.

If you enable this policy, you can create a list of hosts for which Microsoft Edge doesn't use a proxy.

If you don't configure this policy, no list of hosts is created for which Microsoft Edge bypasses a proxy. Leave this policy unconfigured if you've specified any other method for setting proxy policies.

For more detailed examples go to https://go.microsoft.com/fwlink/?linkid=2094936.

Example value: https://www.contoso.com, https://www.fabrikam.com</string><string id="ProxySettings">Proxy settings</string><string id="ProxySettings_Explain">Configures the proxy settings for Microsoft Edge.

If you enable this policy, Microsoft Edge ignores all proxy-related options specified from the command line.

If you don't configure this policy, users can choose their own proxy settings.

This policy overrides the following individual policies:

ProxyMode
ProxyPacUrl
ProxyServer
ProxyBypassList

The ProxyMode field lets you specify the proxy server used by Microsoft Edge and prevents users from changing proxy settings.

The ProxyPacUrl field is a URL to a proxy .pac file.

The ProxyServer field is a URL for the proxy server.

The ProxyBypassList field is a list of proxy hosts that Microsoft Edge bypasses.

If you choose the 'direct' value as 'ProxyMode', a proxy is never used and all other fields are ignored.

If you choose the 'system' value as 'ProxyMode', the systems's proxy is used and all other fields are ignored.

If you choose the 'auto_detect' value as 'ProxyMode', all other fields are ignored.

If you choose the 'fixed_server' value as 'ProxyMode', the 'ProxyServer' and 'ProxyBypassList' fields are used.

If you choose the 'pac_script' value as 'ProxyMode', the 'ProxyPacUrl' and 'ProxyBypassList' fields are used.

Example value:

{
  &quot;ProxyMode&quot;: &quot;direct&quot;, 
  &quot;ProxyPacUrl&quot;: &quot;https://internal.site/example.pac&quot;, 
  &quot;ProxyServer&quot;: &quot;123.123.123.123:8080&quot;, 
  &quot;ProxyBypassList&quot;: &quot;https://www.example1.com,https://www.example2.com,https://internalsite/&quot;
}</string><string id="SmartScreen_group">SmartScreen settings</string><string id="SmartScreenEnabled">Configure Microsoft Defender SmartScreen</string><string id="SmartScreenEnabled_Explain">This policy setting lets you configure whether to turn on Microsoft Defender SmartScreen. Microsoft Defender SmartScreen provides warning messages to help protect your users from potential phishing scams and malicious software. By default, Microsoft Defender SmartScreen is turned on.

If you enable this setting, Microsoft Defender SmartScreen is turned on and users can't turn it off.

If you disable this setting, Microsoft Defender SmartScreen is turned off and users can't turn it on.

If you don't configure this setting, users can choose whether to use Microsoft Defender SmartScreen.

This policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.</string><string id="PreventSmartScreenPromptOverride">Prevent bypassing Microsoft Defender SmartScreen prompts for sites</string><string id="PreventSmartScreenPromptOverride_Explain">This policy setting lets you decide whether users can override the Microsoft Defender SmartScreen warnings about potentially malicious websites.

If you enable this setting, users can't ignore Microsoft Defender SmartScreen warnings and they are blocked from continuing to the site.

If you disable or don't configure this setting, users can ignore Microsoft Defender SmartScreen warnings and continue to the site.</string><string id="PreventSmartScreenPromptOverrideForFiles">Prevent bypassing of Microsoft Defender SmartScreen warnings about downloads</string><string id="PreventSmartScreenPromptOverrideForFiles_Explain">This policy lets you determine whether users can override Microsoft Defender SmartScreen warnings about unverified downloads.

If you enable this policy, users in your organization can't ignore Microsoft Defender SmartScreen warnings, and they're prevented from completing the unverified downloads.

If you disable or don't configure this policy, users can ignore Microsoft Defender SmartScreen warnings and complete unverified downloads.</string><string id="SmartScreenAllowListDomains">Configure the list of domains for which Microsoft Defender SmartScreen won't trigger warnings</string><string id="SmartScreenAllowListDomains_Explain">Configure the list of Microsoft Defender SmartScreen trusted domains. This means:
Microsoft Defender SmartScreen won't check for potentially malicious resources like phishing software and other malware if the source URLs match these domains.
The Microsoft Defender SmartScreen download protection service won't check downloads hosted on these domains.

If you enable this policy, Microsoft Defender SmartScreen trusts these domains.
If you disable or don't set this policy, default Microsoft Defender SmartScreen protection is applied to all resources.
This policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.
Also note that this policy does not apply if your organization has enabled Microsoft Defender Advanced Threat Protection. You must configure your allow and block lists in Microsoft Defender Security Center instead.

Example value:

mydomain.com
myuniversity.edu</string><string id="SmartScreenAllowListDomainsDesc">Configure the list of domains for which Microsoft Defender SmartScreen won't trigger warnings</string><string id="SmartScreenForTrustedDownloadsEnabled">Force Microsoft Defender SmartScreen checks on downloads from trusted sources</string><string id="SmartScreenForTrustedDownloadsEnabled_Explain">This policy setting lets you configure whether Microsoft Defender SmartScreen checks download reputation from a trusted source.

If you enable or don't configure this setting, Microsoft Defender SmartScreen checks the download’s reputation regardless of source.

If you disable this setting, Microsoft Defender SmartScreen doesn’t check the download’s reputation when downloading from a trusted source.

This policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.</string><string id="Startup_group">Startup, home page and new tab page</string><string id="ShowHomeButton">Show Home button on toolbar</string><string id="ShowHomeButton_Explain">Shows the Home button on Microsoft Edge's toolbar.

Enable this policy to always show the Home button. Disable it to never show the button.

If you don't configure the policy, users can choose whether to show the home button.</string><string id="HomepageLocation">Configure the home page URL</string><string id="HomepageLocation_Explain">Configures the default home page URL in Microsoft Edge.

The home page is the page opened by the Home button. The pages that open on startup are controlled by the 'RestoreOnStartup' policies.

You can either set a URL here or set the home page to open the new tab page. If you select to open the new tab page, then this policy doesn't take effect.

If you enable this policy, users can't change their home page URL, but they can choose to use the new tab page as their home page.

If you disable or don't configure this policy, users can choose their own home page, as long as the 'HomepageIsNewTabPage' policy isn't enabled.

This policy is available only on Windows instances that are joined to a Microsoft Active Directory domain or Windows 10 Pro or Enterprise instances enrolled for device management.

Example value: https://www.contoso.com</string><string id="HomepageIsNewTabPage">Set the new tab page as the home page</string><string id="HomepageIsNewTabPage_Explain">Configures the default home page in Microsoft Edge. You can set the home page to a URL you specify or to the new tab page.

If you enable this policy, the new tab page is always used for the home page, and the home page URL location is ignored.

If you disable this policy, the user's home page can't be the new tab page, unless the URL is set to 'edge://newtab'.

If not configured users can choose whether the new tab page is their home page.

This policy is available only on Windows instances that are joined to a Microsoft Active Directory domain or Windows 10 Pro or Enterprise instances enrolled for device management.</string><string id="NewTabPageLocation">Configure the new tab page URL</string><string id="NewTabPageLocation_Explain">Configures the default URL for the new tab page.

This policy determines the page that's opened when new tabs are created (including when new windows are opened). It also affects the startup page if that's set to open to the new tab page.

This policy doesn't determine which page opens on startup; that's controlled by the 'RestoreOnStartup' policy. It also doesn’t affect the home page if that’s set to open to the new tab page.

If you don't configure this policy, the default new tab page is used.

If you configure this policy *and* the &quot;NewTabPageSetFeedType&quot; policy, this policy has precedence.

If an invalid URL is provided, new tabs will open about://blank.

This policy is available only on Windows instances that are joined to a Microsoft Active Directory domain or Windows 10 Pro or Enterprise instances that are enrolled for device management.

Example value: https://www.fabrikam.com</string><string id="NewTabPageSetFeedType">Configure the Microsoft Edge new tab page experience</string><string id="NewTabPageSetFeedType_Explain">Lets you choose either the Microsoft News or Office 365 feed experience for the new tab page.

When you set this policy to Microsoft News feed experience (0), users will see the Microsoft News feed experience on the new tab page.

When you set this policy to Office 365 feed experience (1), users with an Azure Active Directory browser sign-in will see the Office 365 feed experience on the new tab page.

If you disable or don't configure this policy:

- Users with an Azure Active Directory browser sign-in are offered the Office 365 new tab page feed experience, as well as the standard new tab page feed experience.

- Users without an Azure Active Directory browser sign-in will see the standard new tab page experience.

If you configure this policy *and* the &quot;NewTabPageLocation&quot; policy, &quot;NewTabPageLocation&quot; has precedence.

Default setting:  Disabled or not configured.

* 0 = Microsoft News feed experience

* 1 = Office 365 feed experience</string><string id="NewTabPageSetFeedType_News">Microsoft News feed experience</string><string id="NewTabPageSetFeedType_Office">Office 365 feed experience</string><string id="RestoreOnStartup">Action to take on startup</string><string id="RestoreOnStartup_Explain">Specify how Microsoft Edge behaves when it starts.

If you want a new tab to always open on startup, choose 'Open new tab' (5).

If you want to reopen URLs that were open the last time Microsoft Edge closed, choose 'Restore the last session' (1). The browsing session will be restored as it was. Note that this option disables some settings that rely on sessions or that perform actions on exit (such as Clear browsing data on exit or session-only cookies).

If you want to open a specific set of URLs, choose 'Open a list of URLs' (4).

Disabling this setting is equivalent to leaving it not configured. Users will be able to change it in Microsoft Edge.

This policy is available only on Windows instances that are joined to a Microsoft Active Directory domain or Windows 10 Pro or Enterprise instances enrolled for device management.

* 5 = Open a new tab

* 1 = Restore the last session

* 4 = Open a list of URLs</string><string id="RestoreOnStartup_RestoreOnStartupIsNewTabPage">Open a new tab</string><string id="RestoreOnStartup_RestoreOnStartupIsLastSession">Restore the last session</string><string id="RestoreOnStartup_RestoreOnStartupIsURLs">Open a list of URLs</string><string id="RestoreOnStartupURLs">Sites to open when the browser starts</string><string id="RestoreOnStartupURLs_Explain">Specify a list of websites to open automatically when the browser starts. If you don't configure this policy, no site is opened on startup.

This policy only works if you also set the 'RestoreOnStartup' policy to 'Open a list of URLs' (4).

This policy is only available on Windows instances that are joined to a Microsoft Active Directory domain or Windows 10 Pro or Enterprise instances that are enrolled for device management.

Example value:

https://contoso.com
https://www.fabrikam.com</string><string id="RestoreOnStartupURLsDesc">Sites to open when the browser starts</string><string id="NewTabPageCompanyLogo">Set new tab page company logo</string><string id="NewTabPageCompanyLogo_Explain">Specifies the company logo to use on the new tab page in Microsoft Edge.

The policy should be configured as a string that expresses the logo(s) in JSON format. For example: { &quot;default_logo&quot;: { &quot;url&quot;: &quot;https://www.contoso.com/logo.png&quot;, &quot;hash&quot;: &quot;cd0aa9856147b6c5b4ff2b7dfee5da20aa38253099ef1b4a64aced233c9afe29&quot; }, &quot;light_logo&quot;: { &quot;url&quot;: &quot;https://www.contoso.com/light_logo.png&quot;, &quot;hash&quot;: &quot;517d286edb416bb2625ccfcba9de78296e90da8e32330d4c9c8275c4c1c33737&quot; } }

You configure this policy by specifying the URL from which Microsoft Edge can download the logo and its cryptographic hash (SHA-256), which is used to verify the integrity of the download. The logo must be in PNG or SVG format, and its file size must not exceed 16 MB. The logo is downloaded and cached, and it will be redownloaded whenever the URL or the hash changes. The URL must be accessible without any authentication.

The 'default_logo' is required and will be used when there's no background image. If 'light_logo' is provided, it will be used when the user's new tab page has a background image. We recommend a horizontal logo with a transparent background that is left-aligned and vertically centered. The logo should have a minimum height of 32 pixels and an aspect ratio from 1:1 to 4:1. The 'default_logo' should have proper contrast against a white/black background while the 'light_logo' should have proper contrast against a background image.

If you enable this policy, Microsoft Edge downloads and shows the specified logo(s) on the new tab page. Users can't override or hide the logo(s).

If you disable or don't configure this policy, Microsoft Edge will show no company logo or a Microsoft logo on the new tab page.

For help with determining the SHA-256 hash, see https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/get-filehash?view=powershell-6.

Example value:

{
  &quot;light_logo&quot;: {
    &quot;url&quot;: &quot;https://www.contoso.com/light_logo.png&quot;, 
    &quot;hash&quot;: &quot;517d286edb416bb2625ccfcba9de78296e90da8e32330d4c9c8275c4c1c33737&quot;
  }, 
  &quot;default_logo&quot;: {
    &quot;url&quot;: &quot;https://www.contoso.com/logo.png&quot;, 
    &quot;hash&quot;: &quot;cd0aa9856147b6c5b4ff2b7dfee5da20aa38253099ef1b4a64aced233c9afe29&quot;
  }
}</string><string id="NewTabPageHideDefaultTopSites">Hide the default top sites from the new tab page</string><string id="NewTabPageHideDefaultTopSites_Explain">Hides the default top sites from the new tab page in Microsoft Edge.

If you set this policy to true, the default top site tiles are hidden.

If you set this policy to false or don't configure it, the default top site tiles remain visible.</string><string id="NewTabPageManagedQuickLinks">Set new tab page quick links</string><string id="NewTabPageManagedQuickLinks_Explain">By default, Microsoft Edge displays quick links on the new tab page from user-added shortcuts and top sites based on browsing history. With this policy, you can configure up to three quick link tiles on the new tab page, expressed as a JSON object:

[ { &quot;url&quot;: &quot;https://www.contoso.com&quot;, &quot;title&quot;: &quot;Contoso Portal&quot;, &quot;pinned&quot;: true/false }, ... ]

The 'url' field is required; 'title' and 'pinned' are optional. If 'title' is not provided, the URL is used as the default title. If 'pinned' is not provided, the default value is false.

Microsoft Edge presents these in the order listed, from left to right, with all pinned tiles displayed ahead of non-pinned tiles.

If the policy is set as mandatory, the 'pinned' field will be ignored and all tiles will be pinned. The tiles can't be deleted by the user and will always appear at the front of the quick links list.

If the policy is set as recommended, pinned tiles will remain in the list but the user has the ability to edit and delete them. Quick link tiles that aren't pinned behave like default top sites and are pushed off the list if other websites are visited more frequently. When applying non-pinned links via this policy to an existing browser profile, the links may not appear at all, depending on how they rank compared to the user's browsing history.

Example value:

[
  {
    &quot;url&quot;: &quot;https://contoso.com&quot;, 
    &quot;pinned&quot;: true, 
    &quot;title&quot;: &quot;Contoso Portal&quot;
  }, 
  {
    &quot;url&quot;: &quot;https://fabrikam.com&quot;, 
    &quot;title&quot;: &quot;Fabrikam&quot;
  }
]</string><string id="AdsSettingForIntrusiveAdsSites">Ads setting for sites with intrusive ads</string><string id="AdsSettingForIntrusiveAdsSites_Explain">Controls whether ads are blocked on sites with intrusive ads. You can set this policy to one of the following options:

* 1 = Allow ads on all sites.

* 2 = Block ads on sites with intrusive ads (Default value).</string><string id="AdsSettingForIntrusiveAdsSites_AllowAds">Allow ads on all sites</string><string id="AdsSettingForIntrusiveAdsSites_BlockAds">Block ads on sites with intrusive ads. (Default value)</string><string id="AllowDeletingBrowserHistory">Enable deleting browser and download history</string><string id="AllowDeletingBrowserHistory_Explain">Enables deleting browser history and download history and prevents users from changing this setting.

Note that even with this policy is disabled, the browsing and download history aren't guaranteed to be retained: users can edit or delete the history database files directly, and the browser itself may remove (based on expiration period) or archive any or all history items at any time.

If you enable this policy or don't configure it, users can delete the browsing and download history.

If you disable this policy, users can't delete browsing and download history.

If you enable this policy, don't enable the 'Clear browsing data when Microsoft Edge closes' policy, because they both deal with deleting data. If you enable both, the 'Clear browsing data when Microsoft Edge closes' policy takes precedence and deletes all data when Microsoft Edge closes, regardless of how this policy is configured.</string><string id="AllowFileSelectionDialogs">Allow file selection dialogs</string><string id="AllowFileSelectionDialogs_Explain">Allow access to local files by letting Microsoft Edge display file selection dialogs.

If you enable or don't configure this policy, users can open file selection dialogs as normal.

If you disable this policy, whenever the user performs an action that triggers a file selection dialog (like importing favorites, uploading files, or saving links), a message is displayed instead, and the user is assumed to have clicked Cancel on the file selection dialog.</string><string id="AllowPopupsDuringPageUnload">Allows a page to show popups during its unloading</string><string id="AllowPopupsDuringPageUnload_Explain">This policy allows an admin to specify that a page can show popups during its unloading.

When the policy is set to enabled, pages are allowed to show popups while they're being unloaded.

When the policy is set to disabled or unset, pages aren't allowed to show popups while they're being unloaded. This is as per the spec: (https://html.spec.whatwg.org/#apis-for-creating-and-navigating-browsing-contexts-by-name).

This policy will be removed in the future.</string><string id="AllowSyncXHRInPageDismissal">Allow pages to send synchronous XHR requests during page dismissal</string><string id="AllowSyncXHRInPageDismissal_Explain">This policy lets you specify that a page can send synchronous XHR requests during page dismissal.

If you enable this policy, pages can send synchronous XHR requests during page dismissal.

If you disable this policy or don't configure this policy, pages aren't allowed to send synchronous XHR requests during page dismissal.

This policy is temporary and will be removed in a future release.</string><string id="AllowTrackingForUrls">Configure tracking prevention exceptions for specific sites</string><string id="AllowTrackingForUrls_Explain">Configure the list of URL patterns that are excluded from tracking prevention.

If you configure this policy, the list of configured URL patterns is excluded from tracking prevention.

If you don't configure this policy, the global default value from the &quot;Block tracking of users' web-browsing activity&quot; policy (if set) or the user's personal configuration is used for all sites.

Example value:

https://www.contoso.com
[*.]contoso.edu</string><string id="AllowTrackingForUrlsDesc">Configure tracking prevention exceptions for specific sites</string><string id="AlwaysOpenPdfExternally">Always open PDF files externally</string><string id="AlwaysOpenPdfExternally_Explain">Disables the internal PDF viewer in Microsoft Edge.

If you enable this policy Microsoft Edge treats PDF files as downloads and lets users open them with the default application.

If you don't configure this policy or disable it, Microsoft Edge will open PDF files (unless the user disables it).</string><string id="ApplicationLocaleValue">Set application locale</string><string id="ApplicationLocaleValue_Explain">Configures the application locale in Microsoft Edge and prevents users from changing the locale.

If you enable this policy, Microsoft Edge uses the specified locale. If the configured locale isn't supported, 'en-US' is used instead.

If you disable or don't configure this setting, Microsoft Edge uses either the user-specified preferred locale (if configured) or the fallback locale 'en-US'.

Example value: en</string><string id="AudioCaptureAllowed">Allow or block audio capture</string><string id="AudioCaptureAllowed_Explain">Allows you to set whether a user is prompted to grant a website access to their audio capture device. This policy applies to all URLs except for those configured in the 'AudioCaptureAllowedUrls' list.

If you enable this policy or don't configure it (the default setting), the user is prompted for audio capture access except from the URLs in the 'AudioCaptureAllowedUrls' list. These listed URLs are granted access without prompting.

If you disable this policy, the user is not prompted, and audio capture is accessible only to the URLs configured in 'AudioCaptureAllowedUrls'.

This policy affects all types of audio inputs, not only the built-in microphone.</string><string id="AudioCaptureAllowedUrls">Sites that can access audio capture devices without requesting permission</string><string id="AudioCaptureAllowedUrls_Explain">Specify websites, based on URL patterns, that can use audio capture devices without asking the user for permission. Patterns in this list are matched against the security origin of the requesting URL. If they match, the site is automatically granted access to audio capture devices.

Example value:

https://www.contoso.com/
https://[*.]contoso.edu/</string><string id="AudioCaptureAllowedUrlsDesc">Sites that can access audio capture devices without requesting permission</string><string id="AutoImportAtFirstRun">Automatically import another browser's data and settings at first run</string><string id="AutoImportAtFirstRun_Explain">If you enable this policy, Microsoft Edge automatically imports all supported datatypes and settings from either the default browser or another specified browser. This also forces Microsoft Edge to skip the import section of the first-run experience.

If you set this policy to 'DisabledAutoImport' (4), the import section of the first-run experience is skipped entirely and Microsoft Edge doesn't import browser data and settings automatically.

* 0 = Automatically imports all supported datatypes and settings from the default browser

* 1 = Automatically imports all supported datatypes and settings from Internet Explorer

* 2 = Automatically imports all supported datatypes and settings from Google Chrome

* 3 = Automatically imports all supported datatypes and settings from Safari

* 4 = Disables automatic import, and the import section of the first-run experience is skipped

**Note**: This policy currently supports importing from Internet Explorer (on Windows 7, 8, and 10), Google Chrome (on Windows 7, 8, and 10 and on macOS) and Apple Safari (on macOS) browsers.</string><string id="AutoImportAtFirstRun_FromDefaultBrowser">Automatically imports all supported datatypes and settings from the default browser</string><string id="AutoImportAtFirstRun_FromInternetExplorer">Automatically imports all supported datatypes and settings from Internet Explorer</string><string id="AutoImportAtFirstRun_FromGoogleChrome">Automatically imports all supported datatypes and settings from Google Chrome</string><string id="AutoImportAtFirstRun_FromSafari">Automatically imports all supported datatypes and settings from Safari</string><string id="AutoImportAtFirstRun_DisabledAutoImport">Disables automatic import, and the import section of the first-run experience is skipped</string><string id="AutofillAddressEnabled">Enable AutoFill for addresses</string><string id="AutofillAddressEnabled_Explain">Enables the AutoFill feature and allows users to auto-complete address information in web forms using previously stored information.

If you disable this policy, AutoFill never suggests or fills in address information, nor does it save additional address information that the user might submit while browsing the web.

If you enable this policy or don't configure it, users can control AutoFill for addresses in the user interface.

Note that if you disable this policy you also stop all activity for all web forms, except payment and password forms. No further entries are saved, and Microsoft Edge won't suggest or AutoFill any previous entries.</string><string id="AutofillCreditCardEnabled">Enable AutoFill for credit cards</string><string id="AutofillCreditCardEnabled_Explain">Enables Microsoft Edge's AutoFill feature and lets users auto complete credit card information in web forms using previously stored information.

If you disable this policy, AutoFill never suggests or fills credit card information, nor will it save additional credit card information that users might submit while browsing the web.

If you enable this policy or don't configure it, users can control AutoFill for credit cards.</string><string id="AutoplayAllowed">Allow media autoplay for websites</string><string id="AutoplayAllowed_Explain">This policy sets the media autoplay policy for websites.

The default setting, &quot;Not configured&quot; respects the current media autoplay settings and lets users configure their autoplay settings.

Setting to &quot;Enabled&quot; sets media autoplay to &quot;Allow&quot;.  All websites are allowed to autoplay media. Users can’t override this policy.

Setting to &quot;Disabled&quot; sets media autoplay to &quot;Block&quot;.  No websites are allowed to autoplay media. Users can’t override this policy.

A tab will need to be closed and re-opened for this policy to take effect.
</string><string id="BackgroundModeEnabled">Continue running background apps after Microsoft Edge closes</string><string id="BackgroundModeEnabled_Explain">Allows Microsoft Edge processes to start at OS sign-in and keep running after the last browser window is closed. In this scenario, background apps and the current browsing session remain active, including any session cookies. An open background process displays an icon in the system tray and can always be closed from there.

If you enable this policy, background mode is turned on.

If you disable this policy, background mode is turned off.

If you don't configure this policy, background mode is initially turned off, and the user can configure its behavior in edge://settings/system.</string><string id="BackgroundTemplateListUpdatesEnabled">Enables background updates to the list of available templates for Collections and other features that use templates.</string><string id="BackgroundTemplateListUpdatesEnabled_Explain">Lets you enable or disable background updates to the list of available templates for Collections and other features that use templates.  Templates are used to extract rich metadata from a webpage when the page is saved to a collection.

If you enable this setting or the setting is unconfigured, the list of available templates will be downloaded in the background from a Microsoft service every 24 hours.

If you disable this setting the list of available templates will be downloaded on demand. This type of download might result in small performance penalties for Collections and other features.</string><string id="BlockThirdPartyCookies">Block third party cookies</string><string id="BlockThirdPartyCookies_Explain">Block web page elements that aren't from the domain that's in the address bar from setting cookies.

If you enable this policy, web page elements that are not from the domain that is in the address bar can't set cookies

If you disable this policy, web page elements from domains other than in the address bar can set cookies.

If you don't configure this policy, third-party cookies are enabled but users can change this setting.</string><string id="FavoritesBarEnabled">Enable favorites bar</string><string id="FavoritesBarEnabled_Explain">Enables or disables the favorites bar.

If you enable this policy, users will see the favorites bar.

If you disable this policy, users won't see the favorites bar.

If this policy is not configured, then the user can decide to use the favorites bar or not.</string><string id="BrowserAddProfileEnabled">Enable profile creation from the Identity flyout menu or the Settings page</string><string id="BrowserAddProfileEnabled_Explain">Allows users to create new profiles, using the **Add profile** option.
If you enable this policy or don't configure it, Microsoft Edge allows users to use **Add profile** on the Identity flyout menu or the Settings page to create new profiles.

If you disable this policy, users cannot add new profiles from the Identity flyout menu or the Settings page.</string><string id="BrowserGuestModeEnabled">Enable guest mode</string><string id="BrowserGuestModeEnabled_Explain">Enable the option to allow the use of guest profiles in Microsoft Edge. In a guest profile, the browser doesn't import browsing data from existing profiles, and it deletes browsing data when all guest profiles are closed.

If you enable this policy or don't configure it, Microsoft Edge lets users browse in guest profiles.

If you disable this policy, Microsoft Edge doesn't let users browse in guest profiles.</string><string id="BrowserNetworkTimeQueriesEnabled">Allow queries to a Browser Network Time service</string><string id="BrowserNetworkTimeQueriesEnabled_Explain">Prevents Microsoft Edge from occasionally sending queries to a browser network time service to retrieve an accurate timestamp.

If you disable this policy, Microsoft Edge will stop sending queries to a browser network time service.

If you enable this policy or don't configure it, Microsoft Edge will occasionally send queries to a browser network time service.</string><string id="BrowserSignin">Browser sign-in settings</string><string id="BrowserSignin_Explain">Specify whether a user can sign into Microsoft Edge with their account and use account-related services like sync and single sign on. To control the availability of sync, use the 'SyncDisabled' policy instead.

If you set this policy to 'Disable browser sign-in', make sure that you also set the 'NonRemovableProfileEnabled'  policy to disabled because 'NonRemovableProfileEnabled' disables the creation of an automatically signed in browser profile. If both policies are set, Microsoft Edge will use the 'Disable browser sign-in' policy and behave as if 'NonRemovableProfileEnabled' is set to disabled.

If you set this policy to 'Enable browser sign-in' (1), users can sign into the browser. Signing into the browser doesn't mean that sync is turned on by default; the user must separately opt-in to use this feature.

If you set this policy to 'Force browser sign-in' (2) users must sign into a profile to use the browser. By default, this will allow the user to choose whether they want to sync to their account, unless sync is disabled by the domain admin or with the 'SyncDisabled' policy. The default value of 'BrowserGuestModeEnabled' policy is set to false.

If you don't configure this policy users can decide if they want to enable the browser sign-in option and use it as they see fit.

* 0 = Disable browser sign-in

* 1 = Enable browser sign-in

* 2 = Force users to sign-in to use the browser</string><string id="BrowserSignin_Disable">Disable browser sign-in</string><string id="BrowserSignin_Enable">Enable browser sign-in</string><string id="BrowserSignin_Force">Force users to sign-in to use the browser</string><string id="BuiltInDnsClientEnabled">Use built-in DNS client</string><string id="BuiltInDnsClientEnabled_Explain">Controls whether to use the built-in DNS client.

If you enable this policy, the built-in DNS client is used, if it's available.

If you disable this policy, the client is never used.

If you don't configure this policy, the built-in DNS client is enabled by default on MacOS, and users can change whether to use the built-in DNS client by editing edge://flags or by specifying a command-line flag.</string><string id="CertificateTransparencyEnforcementDisabledForCas">Disable Certificate Transparency enforcement for a list of subjectPublicKeyInfo hashes</string><string id="CertificateTransparencyEnforcementDisabledForCas_Explain">Disables enforcement of Certificate Transparency requirements for a list of subjectPublicKeyInfo hashes.

This policy lets you disable Certificate Transparency disclosure requirements for certificate chains that contain certificates with one of the specified subjectPublicKeyInfo hashes. This allows certificates that would otherwise be untrusted because they were not properly publicly disclosed to still be used for Enterprise hosts.

To disable Certificate Transparency enforcement when this policy is set, one of the following sets of conditions must be met:
1. The hash is of the server certificate's subjectPublicKeyInfo.
2. The hash is of a subjectPublicKeyInfo that appears in a CA certificate in the certificate chain, that CA certificate is constrained via the X.509v3 nameConstraints extension, one or more directoryName nameConstraints are present in the permittedSubtrees, and the directoryName contains an organizationName attribute.
3. The hash is of a subjectPublicKeyInfo that appears in a CA certificate in the certificate chain, the CA certificate has one or more organizationName attributes in the certificate Subject, and the server's certificate contains the same number of organizationName attributes, in the same order, and with byte-for-byte identical values.

A subjectPublicKeyInfo hash is specified by concatenating the hash algorithm name, the &quot;/&quot; character, and the Base64 encoding of that hash algorithm applied to the DER-encoded subjectPublicKeyInfo of the specified certificate. This Base64 encoding is the same format as an SPKI Fingerprint, as defined in RFC 7469, Section 2.4. Unrecognized hash algorithms are ignored. The only supported hash algorithm at this time is &quot;sha256&quot;.

If you disable this policy or don't configure it, any certificate that's required to be disclosed via Certificate Transparency will be treated as untrusted if it's not disclosed according to the Certificate Transparency policy.

Example value:

sha256/AAAAAAAAAAAAAAAAAAAAAA==
sha256//////////////////////w==</string><string id="CertificateTransparencyEnforcementDisabledForCasDesc">Disable Certificate Transparency enforcement for a list of subjectPublicKeyInfo hashes</string><string id="CertificateTransparencyEnforcementDisabledForLegacyCas">Disable Certificate Transparency enforcement for a list of legacy certificate authorities</string><string id="CertificateTransparencyEnforcementDisabledForLegacyCas_Explain">Disables enforcing Certificate Transparency requirements for a list of legacy certificate authorities (Cas).

This policy lets you disable Certificate Transparency disclosure requirements for certificate chains that contain certificates with one of the specified subjectPublicKeyInfo hashes. This allows certificates that would otherwise be untrusted because they were not properly publicly disclosed, continue to be used for enterprise hosts.

In order for Certificate Transparency enforcement to be disabled, you must set the hash to a subjectPublicKeyInfo appearing in a CA certificate that is recognized as a legacy certificate authority (CA). A legacy CA is a CA that has been publicly trusted by default by one or more operating systems supported by Microsoft Edge.

You specify a subjectPublicKeyInfo hash by concatenating the hash algorithm name, the &quot;/&quot; character, and the Base64 encoding of that hash algorithm applied to the DER-encoded subjectPublicKeyInfo of the specified certificate. This Base64 encoding is the same format as an SPKI Fingerprint, as defined in RFC 7469, Section 2.4. Unrecognized hash algorithms are ignored. The only supported hash algorithm at this time is &quot;sha256&quot;.

If you don't configure this policy, any certificate that's required to be disclosed via Certificate Transparency will be treated as untrusted if it isn't disclosed according to the Certificate Transparency policy.

Example value:

sha256/AAAAAAAAAAAAAAAAAAAAAA==
sha256//////////////////////w==</string><string id="CertificateTransparencyEnforcementDisabledForLegacyCasDesc">Disable Certificate Transparency enforcement for a list of legacy certificate authorities</string><string id="CertificateTransparencyEnforcementDisabledForUrls">Disable Certificate Transparency enforcement for specific URLs</string><string id="CertificateTransparencyEnforcementDisabledForUrls_Explain">Disables enforcing Certificate Transparency requirements for the listed URLs.

This policy lets you not disclose certificates for the hostnames in the specified URLs via Certificate Transparency. This lets you use certificates that would otherwise be untrusted, because they weren't properly publicly disclosed, but it makes it harder to detect mis-issued certificates for those hosts.

Form your URL pattern according to https://go.microsoft.com/fwlink/?linkid=2095322. Because certificates are valid for a given hostname, independent of the scheme, port, or path, only the hostname part of the URL is considered. Wildcard hosts are not supported.

If you don't configure this policy, any certificate that should be disclosed via Certificate Transparency is treated as untrusted if it's not disclosed.

Example value:

contoso.com
.contoso.com</string><string id="CertificateTransparencyEnforcementDisabledForUrlsDesc">Disable Certificate Transparency enforcement for specific URLs</string><string id="ClearBrowsingDataOnExit">Clear browsing data when Microsoft Edge closes</string><string id="ClearBrowsingDataOnExit_Explain">Microsoft Edge doesn't clear the browsing data by default when it closes. Browsing data includes information entered in forms, passwords, and even the websites visited.

If you enable this policy, all browsing data is deleted each time Microsoft Edge closes.

If you disable or don't configure this policy, users can configure the Clear browsing data option in Settings.

If you enable this policy, don't enable the 'AllowDeletingBrowserHistory' policy, because they both deal with deleting data. If you enable both, this policy takes precedence and deletes all data when Microsoft Edge closes, regardless of how you configured 'AllowDeletingBrowserHistory'.</string><string id="ClickOnceEnabled">Allow users to open files using the ClickOnce protocol</string><string id="ClickOnceEnabled_Explain">Allow users to open files using the ClickOnce protocol. The ClickOnce protocol allows websites to request that the browser open files from a specific URL using the ClickOnce file handler on the user's computer or device.

If you enable this policy, users can open files using the ClickOnce protocol. This policy overrides the user's ClickOnce setting in the edge://flags/ page.

If you disable this policy, users can't open files using the ClickOnce protocol. Instead, the file will be saved to the file system using the browser. This policy overrides the user's ClickOnce setting in the edge://flags/ page.

If you don't configure this policy, users can't open files using the ClickOnce protocol. Users have the option to enable the use of the ClickOnce protocol with the edge://flags/ page.

Disabling ClickOnce may prevent ClickOnce applications (.application files) from launching properly.

For more information about ClickOnce, see https://go.microsoft.com/fwlink/?linkid=2103872 and https://go.microsoft.com/fwlink/?linkid=2099880.</string><string id="CommandLineFlagSecurityWarningsEnabled">Enable security warnings for command-line flags</string><string id="CommandLineFlagSecurityWarningsEnabled_Explain">If disabled, this policy prevents security warnings from appearing when Microsoft Edge is launched with potentially dangerous command-line flags.

If enabled or unset, security warnings are displayed when these command-line flags are used to launch Microsoft Edge.

For example, the --disable-gpu-sandbox flag generates this warning:  You're using an unsupported command-line flag: --disable-gpu-sandbox. This poses stability and security risks.

On Windows, this policy is only available on instances that are joined to a Microsoft Active Directory domain, or Windows 10 Pro (or Enterprise) instances that are enrolled for device management.</string><string id="ComponentUpdatesEnabled">Enable component updates in Microsoft Edge</string><string id="ComponentUpdatesEnabled_Explain">If you enable or don't configure this policy, component updates are enabled in Microsoft Edge.

If you disable this policy or set it to false, component updates are disabled for all components in Microsoft Edge.

However, some components are exempt from this policy. This includes any component that doesn't contain executable code, that doesn't significantly alter the behavior of the browser, or that's critical for security. That is, updates that are deemed &quot;critical for security&quot; are still applied even if you disable this policy.</string><string id="ConfigureDoNotTrack">Configure Do Not Track</string><string id="ConfigureDoNotTrack_Explain">Specify whether to send Do Not Track requests to websites that ask for tracking info. Do Not Track requests let the websites you visit know that you don't want your browsing activity to be tracked. By default, Microsoft Edge doesn't send Do Not Track requests, but users can turn on this feature to send them.

If you enable this policy, Do Not Track requests are always sent to websites asking for tracking info.

If you disable this policy, requests are never sent.

If you don't configure this policy, users can choose whether to send these requests.</string><string id="ConfigureOnlineTextToSpeech">Configure Online Text To Speech</string><string id="ConfigureOnlineTextToSpeech_Explain">Set whether the browser can leverage Online Text to Speech voice fonts, part of Azure Cognitive Services. These voice fonts are higher quality than the pre-installed system voice fonts.

If you enable or don't configure this policy, web-based applications that use the SpeechSynthesis API can use Online Text to Speech voice fonts.

If you disable this policy, the voice fonts aren't available.

Read more about this feature here:
SpeechSynthesis API: https://go.microsoft.com/fwlink/?linkid=2110038
Cognitive Services: https://go.microsoft.com/fwlink/?linkid=2110141</string><string id="CustomHelpLink">Specify custom help link</string><string id="CustomHelpLink_Explain">Specify a link for the Help menu or the F1 key.

If you enable this policy, an admin can specify a link for the Help menu or the F1 key.

If you disable or don't configure this policy, the default link for the Help menu or the F1 key is used.

Example value: https://go.microsoft.com/fwlink/?linkid=2080734</string><string id="DefaultBrowserSettingEnabled">Set Microsoft Edge as default browser</string><string id="DefaultBrowserSettingEnabled_Explain">Configures the default browser checks in Microsoft Edge and prevents users from changing them.

If you enable this policy, Microsoft Edge always checks on startup whether it is the default browser and automatically registers itself, if possible.

If you disable this policy, Microsoft Edge never checks and disables user controls for setting this option.

If you don't configure this policy, Microsoft Edge lets the user control whether it's the default browser and whether to show user notifications when it isn't.

Note for Windows administrators: This policy only works for PCs running Windows 7. For later versions of Windows, you have to deploy a &quot;default application associations&quot; file that makes Microsoft Edge the handler for the https and http protocols (and, optionally, the ftp protocol and file formats such as .html, .htm, .pdf, .svg, .webp). See https://go.microsoft.com/fwlink/?linkid=2094932 for more information.</string><string id="DeveloperToolsAvailability">Control where developer tools can be used</string><string id="DeveloperToolsAvailability_Explain">Control where developer tools can be used.

If you set this policy to 'DeveloperToolsDisallowedForForceInstalledExtensions' (0, the default), users can access the developer tools and the JavaScript console in general, but not in the context of extensions installed by enterprise policy.

If you set this policy to 'DeveloperToolsAllowed' (1), users can access the developer tools and the JavaScript console in all contexts, including extensions installed by enterprise policy.

If you set this policy to 'DeveloperToolsDisallowed' (2), users can't access the developer tools or inspect website elements. Keyboard shortcuts and menu or context menu entries that open the developer tools or the JavaScript Console are disabled.

* 0 = Block the developer tools on extensions installed by enterprise policy, allow in other contexts

* 1 = Allow using the developer tools

* 2 = Don't allow using the developer tools</string><string id="DeveloperToolsAvailability_DeveloperToolsDisallowedForForceInstalledExtensions">Block the developer tools on extensions installed by enterprise policy, allow in other contexts</string><string id="DeveloperToolsAvailability_DeveloperToolsAllowed">Allow using the developer tools</string><string id="DeveloperToolsAvailability_DeveloperToolsDisallowed">Don't allow using the developer tools</string><string id="DirectInvokeEnabled">Allow users to open files using the DirectInvoke protocol</string><string id="DirectInvokeEnabled_Explain">Allow users to open files using the DirectInvoke protocol. The DirectInvoke protocol allows websites to request that the browser open files from a specific URL using a specific file handler on the user's computer or device.

If you enable or don't configure this policy, users can open files using the DirectInvoke protocol.

If you disable this policy, users can't open files using the DirectInvoke protocol. Instead, the file will be saved to the file system.

Note: Disabling DirectInvoke may prevent certain Microsoft SharePoint Online features from working as expected.

For more information about DirectInvoke, see https://go.microsoft.com/fwlink/?linkid=2103872 and https://go.microsoft.com/fwlink/?linkid=2099871.</string><string id="Disable3DAPIs">Disable support for 3D graphics APIs</string><string id="Disable3DAPIs_Explain">Prevent web pages from accessing the graphics processing unit (GPU). Specifically, web pages can't access the WebGL API and plug-ins can't use the Pepper 3D API.

If you don't configure or disable this policy, it potentially allows web pages to use the WebGL API and plug-ins to use the Pepper 3D API. Microsoft Edge might, by default, still require command line arguments to be passed in order to use these APIs.

If 'HardwareAccelerationModeEnabled' policy is set to false, the setting for 'Disable3DAPIs' policy is ignored - it's the equivalent of setting 'Disable3DAPIs' policy to true.</string><string id="DisableScreenshots">Disable taking screenshots</string><string id="DisableScreenshots_Explain">Controls if users can take screenshots of the browser page.

If enabled, user can't take screenshots by using keyboard shortcuts or extension APIs.

If disabled or don't configure this policy, users can take screenshots.

Please note this policy controls screenshots taken from within the browser itself. Even if you enable this policy, users might still be able to take screenshots using some method outside of the browser (like using an operating system feature or another application).</string><string id="DiskCacheDir">Set disk cache directory</string><string id="DiskCacheDir_Explain">Configures the directory to use to store cached files.

If you enable this policy, Microsoft Edge uses the provided directory regardless of whether the user has specified the '--disk-cache-dir' flag. To avoid data loss or other unexpected errors, don't configure this policy to a volume's root directory or to a directory used for other purposes, because Microsoft Edge manages its contents.

See https://go.microsoft.com/fwlink/?linkid=2095041 for a list of variables you can use when specifying directories and paths.

If you don't configure this policy, the default cache directory is used, and users can override that default with the '--disk-cache-dir' command line flag.

Example value: ${user_home}/Edge_cache</string><string id="DiskCacheSize">Set disk cache size, in bytes</string><string id="DiskCacheSize_Explain">Configures the size of the cache, in bytes, used to store files on the disk.

If you enable this policy, Microsoft Edge uses the provided cache size regardless of whether the user has specified the '--disk-cache-size' flag. The value specified in this policy isn't a hard boundary but rather a suggestion to the caching system; any value below a few megabytes is too small and will be rounded up to a reasonable minimum.

If you set the value of this policy to 0, the default cache size is used, and users can't change it.

If you don't configure this policy, the default size is used, but users can override it with the '--disk-cache-size' flag.</string><string id="DownloadDirectory">Set download directory</string><string id="DownloadDirectory_Explain">Configures the directory to use when downloading files.

If you enable this policy, Microsoft Edge uses the provided directory regardless of whether the user has specified one or chosen to be prompted for download location every time. See https://go.microsoft.com/fwlink/?linkid=2095041 for a list of variables that can be used.

If you disable or don't configure this policy, the default download directory is used, and the user can change it.

Example value: /home/${user_name}/Downloads</string><string id="DownloadRestrictions">Allow download restrictions</string><string id="DownloadRestrictions_Explain">Configures the type of downloads that Microsoft Edge completely blocks, without letting users override the security decision.

Set 'Block dangerous downloads' (1) to allow all downloads except for those that carry Microsoft Defender SmartScreen warnings.

Set 'Block potentially dangerous downloads' (2) to allow all downloads except for those that carry Microsoft Defender SmartScreen warnings of potentially dangerous downloads.

Set 'Block all downloads' (3) to block all downloads.

If you don't configure this policy or set the 'No special restrictions' (0) option, the downloads go through the usual security restrictions based on Microsoft Defender SmartScreen analysis results.

Note that these restrictions apply to downloads from web page content, as well as the 'download link...' context menu option. These restrictions don't apply to saving or downloading the currently displayed page, nor do they apply to the Save as PDF option from the printing options.

See https://go.microsoft.com/fwlink/?linkid=2094934 for more info on Microsoft Defender SmartScreen.

* 0 = No special restrictions

* 1 = Block dangerous downloads

* 2 = Block potentially dangerous downloads

* 3 = Block all downloads</string><string id="DownloadRestrictions_DefaultDownloadSecurity">No special restrictions</string><string id="DownloadRestrictions_BlockDangerousDownloads">Block dangerous downloads</string><string id="DownloadRestrictions_BlockPotentiallyDangerousDownloads">Block potentially dangerous downloads</string><string id="DownloadRestrictions_BlockAllDownloads">Block all downloads</string><string id="EdgeCollectionsEnabled">Enable the Collections feature</string><string id="EdgeCollectionsEnabled_Explain">Lets you allow users to access the Collections feature, where they can collect, organize, share, and export content more efficiently and with Office integration.

If you enable or don't configure this policy, users can access and use the Collections feature in Microsoft Edge.

If you disable this policy, users can't access and use Collections in Microsoft Edge.</string><string id="EditFavoritesEnabled">Allows users to edit favorites</string><string id="EditFavoritesEnabled_Explain">Enable this policy to let users add, remove, and modify favorites. This is the default behavior if you don't configure the policy.

Disable this policy to stop users from adding, removing, or modifying favorites. They can still use existing favorites.</string><string id="EnableDeprecatedWebPlatformFeatures">Re-enable deprecated web platform features for a limited time</string><string id="EnableDeprecatedWebPlatformFeatures_Explain">Specify a list of deprecated web platform features to temporarily re-enable.

This policy lets you re-enable deprecated web platform features for a limited time. Features are identified by a string tag.

If you don't configure this policy, if the list is empty, or if a feature doesn't match one of the supported string tags, all deprecated web platform features remain disabled.

While the policy itself is supported on the above platforms, the feature it's enabling might not be available on all of those platforms. Not all deprecated Web Platform features can be re-enabled. Only those explicitly listed below can be re-enabled, and only for a limited period of time, which differs per feature. You can review the intent behind the Web Platform feature changes at https://bit.ly/blinkintents.

The general format of the string tag is [DeprecatedFeatureName]_EffectiveUntil[yyyymmdd].

* &quot;ExampleDeprecatedFeature_EffectiveUntil20080902&quot; = Enable ExampleDeprecatedFeature API through 2008/09/02

Example value:

ExampleDeprecatedFeature_EffectiveUntil20080902</string><string id="EnableDeprecatedWebPlatformFeaturesDesc">Re-enable deprecated web platform features for a limited time</string><string id="EnableDomainActionsDownload">Enable Domain Actions Download from Microsoft</string><string id="EnableDomainActionsDownload_Explain">In Microsoft Edge, Domain Actions represent a series of compatibility features that help the browser work correctly on the web.

Microsoft keeps a list of actions to take on certain domains for compatibility reasons. For example, the browser may override the User Agent string on a website if that website is broken due to the new User Agent string on Microsoft Edge. Each of these actions is intended to be temporary while Microsoft tries to resolve the issue with the site owner.

When the browser starts up and then periodically afterwards, the browser will contact the Experimentation and Configuration Service that contains the most up to date list of compatibility actions to perform. This list is saved locally after it is first retrieved so that subsequent requests will only update the list if the server's copy has changed.

If you enable this policy, the list of Domain Actions will continue to be downloaded from the Experimentation and Configuration Service.

If you disable this policy, the list of Domain Actions will no longer be downloaded from the Experimentation and Configuration Service.

If you don't configure this policy, the list of Domain Actions will continue to be downloaded from the Experimentation and Configuration Service.</string><string id="EnableOnlineRevocationChecks">Enable online OCSP/CRL checks</string><string id="EnableOnlineRevocationChecks_Explain">Online revocation checks don't provide a significant security benefit and are disabled by default.

If you enable this policy, Microsoft Edge will perform soft-fail, online OCSP/CRL checks. &quot;Soft fail&quot; means that if the revocation server can't be reached, the certificate will be considered valid.

If you disable the policy or don't configure it, Microsoft Edge won't perform online revocation checks.</string><string id="EnterpriseHardwarePlatformAPIEnabled">Allow managed extensions to use the Enterprise Hardware Platform API</string><string id="EnterpriseHardwarePlatformAPIEnabled_Explain">When this policy is set to enabled, extensions installed by enterprise policy are allowed to use the Enterprise Hardware Platform API.
When this policy is set to disabled or isn't set, no extensions are allowed to use the Enterprise Hardware Platform API.
This policy also applies to component extensions.</string><string id="ExperimentationAndConfigurationServiceControl">Control communication with the Experimentation and Configuration Service</string><string id="ExperimentationAndConfigurationServiceControl_Explain">In Microsoft Edge, the Experimentation and Configuration Service is used to deploy Experimentation and Configuration payload.

Experimentation payload consists of a list of early in development features that Microsoft is enabling for testing and feedback.

Configuration payload consists of a list of settings that Microsoft wants to deploy to Microsoft Edge to optimize user experience. For example, configuration payload may specify how often Microsoft Edge sends requests to the Experimentation and Configuration Service to retrieve the newest payload.

If you set this policy to &quot;Retrieve configurations and experiments&quot; mode, the full payload is downloaded from the Experimentation and Configuration Service. This includes both the experimentation and configuration payloads.

If you set this policy to &quot;Retrieve configurations only&quot; mode, only the configuration payload is delivered.

If you set this policy to &quot;Disable communication with the Experimentation and Configuration Service&quot; mode, the communication with the Experimentation and Configuration Service is stopped completely.

If you don't configure this policy, on a managed device on Stable and Beta channels the behavior is the same as the &quot;Retrieve configurations only&quot; mode.

If you don't configure this policy, on an unmanaged device the behavior is the same as the &quot;Retrieve configurations and experiments&quot; mode.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Retrieve configurations and experiments</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Retrieve configurations only</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Disable communication with the Experimentation and Configuration Service</string><string id="ExternalProtocolDialogShowAlwaysOpenCheckbox">Show an &quot;Always open&quot; checkbox in external protocol dialog.</string><string id="ExternalProtocolDialogShowAlwaysOpenCheckbox_Explain">This policy controls whether the &quot;Always open&quot; checkbox is shown on external protocol launch confirmation prompts.

If you set this policy to True, when an external protocol confirmation prompt is shown, the user can select &quot;Always open&quot;. The user won’t get any future confirmation prompts for this protocol.

If you set this policy to False, or the policy is unset, the &quot;Always open&quot; checkbox isn’t displayed. The user will be prompted for confirmation every time an external protocol is invoked.</string><string id="ForceBingSafeSearch">Enforce Bing SafeSearch</string><string id="ForceBingSafeSearch_Explain">Ensure that queries in Bing web search are done with SafeSearch set to the value specified. Users can't change this setting.

If you configure this policy to &quot;Off&quot;, SafeSearch in Bing search falls back to the bing.com value.

If you configure this policy to &quot;Moderate&quot;, the moderate setting is used in SafeSearch. The moderate setting filters adult videos and images but not text from search results.

If you configure this policy to &quot;Strict&quot;, the strict setting in SafeSearch is used. The strict setting filters adult text, images, and videos.

If you disable this policy or don't configure it, SafeSearch in Bing search isn't enforced, and users can set the value they want on bing.com.

* 0 = Don't configure search restrictions in Bing

* 1 = Configure moderate search restrictions in Bing

* 2 = Configure strict search restrictions in Bing</string><string id="ForceBingSafeSearch_BingSafeSearchNoRestrictionsMode">Don't configure search restrictions in Bing</string><string id="ForceBingSafeSearch_BingSafeSearchModerateMode">Configure moderate search restrictions in Bing</string><string id="ForceBingSafeSearch_BingSafeSearchStrictMode">Configure strict search restrictions in Bing</string><string id="ForceEphemeralProfiles">Enable use of ephemeral profiles</string><string id="ForceEphemeralProfiles_Explain">Controls whether user profiles are switched to ephemeral mode. An ephemeral profile is created when a session begins, is deleted when the session ends, and is associated with the user's original profile.

If you enable this policy, profiles run in ephemeral mode. This lets users work from their own devices without saving browsing data to those devices. If you enable this policy as an OS policy (by using GPO on Windows, for example), it applies to every profile on the system.

If you disable this policy or don't configure it, users get their regular profiles when they sign in to the browser.

In ephemeral mode, profile data is saved on disk only for the length of the user session. Features like browser history, extensions and their data, web data like cookies, and web databases aren't saved after the browser is closed. This doesn't prevent a user from manually downloading any data to disk, or from saving pages or printing them. If the user has enabled sync, all data is preserved in their sync accounts just like with regular profiles. Users can also use InPrivate browsing in ephemeral mode unless you explicitly disable this.</string><string id="ForceGoogleSafeSearch">Enforce Google SafeSearch</string><string id="ForceGoogleSafeSearch_Explain">Forces queries in Google Web Search to be performed with SafeSearch set to active, and prevents users from changing this setting.

If you enable this policy, SafeSearch in Google Search is always active.

If you disable this policy or don't configure it, SafeSearch in Google Search isn't enforced.</string><string id="ForceNetworkInProcess">Force networking code to run in the browser process</string><string id="ForceNetworkInProcess_Explain">This policy forces networking code to run in the browser process.

This policy is disabled by default. If enabled, users are open to security issues when the networking process is sandboxed.

This policy is intended to give enterprises a chance to migrate to 3rd party software that doesn't depend on hooking networking APIs. Proxy servers are recommended over LSPs and Win32 API patching.

If this policy isn't set, networking code may run out of the browser process depending on field trials of the NetworkService experiment.</string><string id="ForceYouTubeRestrict">Force minimum YouTube Restricted Mode</string><string id="ForceYouTubeRestrict_Explain">Enforces a minimum Restricted Mode on YouTube and prevents users from picking a less restricted mode.

Set to Strict (2) to enforce Strict Restricted Mode on YouTube.

Set to Moderate (1) to enforce the user to only use Moderate Restricted Mode and Strict Restricted Mode on YouTube. They can't disable Restricted Mode.

Set to Off (0) or don't configure this policy to not enforce Restricted Mode on YouTube. External policies such as YouTube policies might still enforce Restricted Mode.

* 0 = Do not enforce Restricted Mode on YouTube

* 1 = Enforce at least Moderate Restricted Mode on YouTube

* 2 = Enforce Strict Restricted Mode for YouTube</string><string id="ForceYouTubeRestrict_Off">Do not enforce Restricted Mode on YouTube</string><string id="ForceYouTubeRestrict_Moderate">Enforce at least Moderate Restricted Mode on YouTube</string><string id="ForceYouTubeRestrict_Strict">Enforce Strict Restricted Mode for YouTube</string><string id="FullscreenAllowed">Allow full screen mode</string><string id="FullscreenAllowed_Explain">Set the availability of full screen mode - all Microsoft Edge UI is hidden and only web content is visible.

If you enable this policy or don't configure it, the user, apps, and extensions with appropriate permissions can enter full screen mode.

If you disable this policy, users, apps, and extensions can't enter full screen mode.

Opening Microsoft Edge in kiosk mode using the command line is unavailable when full screen mode is disabled.</string><string id="GoToIntranetSiteForSingleWordEntryInAddressBar">Force direct intranet site navigation instead of searching on single word entries in the Address Bar</string><string id="GoToIntranetSiteForSingleWordEntryInAddressBar_Explain">If you enable this policy, the top auto-suggest result in the address bar suggestion list will navigate to intranet sites if the text entered in the address bar is a single word without punctuation.

Default navigation when typing a single word without punctuation will conduct a navigation to an intranet site matching the entered text.

If you enable this policy, the second auto-suggest result in the address bar suggestion list will conduct a web search exactly as it was entered, provided that this text is a single word without punctuation. The default search provider will be used unless a policy to prevent web search is also enabled.

Two effects of enabling this policy are:

Navigation to sites in response to single word queries that would typically resolve to a history item will no longer happen. Instead, the browser will attempt navigate to internal sites that may not exist in an organization’s intranet. This will result in a 404 error.

Popular, single-word search terms will require manual selection of search suggestions to properly conduct a search.</string><string id="HSTSPolicyBypassList">Configure the list of names that will bypass the HSTS policy check</string><string id="HSTSPolicyBypassList_Explain">Hostnames specified in this list will be exempt from the HSTS policy check that could potentially upgrade requests from &quot;http://&quot; to &quot;https://&quot;. Only single-label hostnames are allowed in this policy. Hostnames must be canonicalized. Any IDNs must be converted to their A-label format, and all ASCII letters must be lowercase. This policy only applies to the specific hostnames specified; it doesn't apply to subdomains of the names in the list.

Example value:

meet</string><string id="HSTSPolicyBypassListDesc">Configure the list of names that will bypass the HSTS policy check</string><string id="HardwareAccelerationModeEnabled">Use hardware acceleration when available</string><string id="HardwareAccelerationModeEnabled_Explain">Specify to use hardware acceleration, if it's available. If you enable this policy or don't configure it, hardware acceleration is enabled unless a GPU feature is explicitly blocked.

If you disable this policy, hardware acceleration is disabled.</string><string id="ImportAutofillFormData">Allow importing of autofill form data</string><string id="ImportAutofillFormData_Explain">Allows users to import autofill form data from another browser into Microsoft Edge.

If you enable this policy, the option to manually import autofill data is automatically selected.

If you disable this policy, autofill form data isn't imported at first run, and users can't import it manually.

If you don't configure this policy, autofill data is imported at first run, and users can choose whether to import this data manually during later browsing sessions.

You can set this policy as a recommendation. This means that Microsoft Edge will import autofill data on first run, but users can select or clear **autofill data** option during manual import.

**Note**: This policy currently manages importing from Google Chrome (on Windows 7, 8, and 10 and on macOS).</string><string id="ImportFavorites">Allow importing of favorites</string><string id="ImportFavorites_Explain">Allows users to import favorites from another browser into Microsoft Edge.

If you enable this policy, the **Favorites** check box is automatically selected in the **Import browser data** dialog box.

If you disable this policy, favorites aren't imported at first run, and users can’t import them manually.

If you don’t configure this policy, favorites are imported at first run, and users can choose whether to import them manually during later browsing sessions.

You can also set this policy as a recommendation. This means that Microsoft Edge imports favorites on first run, but users can select or clear the **favorites** option during manual import.

**Note**: This policy currently manages importing from Internet Explorer (on Windows 7, 8, and 10), Google Chrome (on Windows 7, 8, and 10 and on macOS) and Apple Safari (on macOS) browsers.</string><string id="ImportBrowserSettings">Allow importing of browser settings</string><string id="ImportBrowserSettings_Explain">Allows users to import browser settings from another browser into Microsoft Edge.

If you enable this policy, the **Browser settings** check box is automatically selected in the **Import browser data** dialog box.

If you disable this policy, browser settings aren't imported at first run, and users can’t import them manually.

If you don’t configure this policy, browser settings are imported at first run, and users can choose whether to import them manually during later browsing sessions.

You can also set this policy as a recommendation. This means that Microsoft Edge imports the settings on first run, but users can select or clear the **browser settings** option during manual import.

**Note**: This policy currently manages importing Google Chrome (on Windows 7, 8, and 10 and on macOS).</string><string id="ImportHistory">Allow importing of browsing history</string><string id="ImportHistory_Explain">Allows users to import their browsing history from another browser into Microsoft Edge.

If you enable this policy, the **Browsing history** check box is automatically selected in the **Import browser data** dialog box.

If you disable this policy, browsing history data isn't imported at first run, and users can’t import this data manually.

If you don’t configure this policy, browsing history data is imported at first run, and users can choose whether to import it manually during later browsing sessions.

You can also set this policy as a recommendation. This means that Microsoft Edge imports browsing history on first run, but users can select or clear the **history** option during manual import.

**Note**: This policy currently manages importing from Internet Explorer (on Windows 7, 8, and 10), Google Chrome (on Windows 7, 8, and 10 and on macOS) and Apple Safari (macOS) browsers.</string><string id="ImportHomepage">Allow importing of home page settings</string><string id="ImportHomepage_Explain">Allows users to import their home page setting from another browser into Microsoft Edge.

If you enable this policy, the option to manually import the home page setting is automatically selected.

If you disable this policy, the home page setting isn’t imported at first run, and users can’t import it manually.

If you don’t configure this policy, the home page setting is imported at first run, and users can choose whether to import this data manually during later browsing sessions.

You can set this policy as a recommendation. This means that Microsoft Edge imports the home page setting on first run, but users can select or clear the **home page** option during manual import.

**Note**: This policy currently manages importing from Internet Explorer (on Windows 7, 8, and 10).</string><string id="ImportOpenTabs">Allow importing of open tabs</string><string id="ImportOpenTabs_Explain">Allows users to import open and pinned tabs from another browser into Microsoft Edge.

If you enable this policy, the **Open tabs** check box is automatically selected in the **Import browser data** dialog box.

If you disable this policy, open tabs aren't imported at first run, and users can't import them manually.

If you don't configure this policy, open tabs are imported at first run, and users can choose whether to import them manually during later browsing sessions.

You can also set this policy as a recommendation. This means that Microsoft Edge imports open tabs on first run, but users can select or clear the **Open tabs** option during manual import.

**Note**: This policy currently only supports importing from Google Chrome (on Windows 7, 8, and 10 and on macOS).</string><string id="ImportPaymentInfo">Allow importing of payment info</string><string id="ImportPaymentInfo_Explain">Allows users to import payment info from another browser into Microsoft Edge.

If you enable this policy, the **payment info** check box is automatically selected in the **Import browser data** dialog box.

If you disable this policy, payment info isn’t imported at first run, and users can’t import it manually.

If you don’t configure this policy, payment info is imported at first run, and users can choose whether to import it manually during later browsing sessions.

You can also set this policy as a recommendation. This means that Microsoft Edge imports payment info on first run, but users can select or clear the **payment info** option during manual import.

**Note:** This policy currently manages importing from Google Chrome (on Windows 7, 8, and 10 and on macOS).</string><string id="ImportSavedPasswords">Allow importing of saved passwords</string><string id="ImportSavedPasswords_Explain">Allows users to import saved passwords from another browser into Microsoft Edge.

If you enable this policy, the option to manually import saved passwords is automatically selected.

If you disable this policy, saved passwords aren't imported on first run, and users can't import them manually.

If you don't configure this policy, passwords are imported at first run, and users can choose whether to import them manually during later browsing sessions.

You can set this policy as a recommendation. This means that Microsoft Edge imports passwords on first run, but users can select or clear the **passwords** option during manual import.

**Note**: This policy currently manages importing from Internet Explorer (on Windows 7, 8, and 10) and Google Chrome (on Windows 7, 8, and 10 and on macOS) browsers.</string><string id="ImportSearchEngine">Allow importing of search engine settings</string><string id="ImportSearchEngine_Explain">Allows users to import search engine settings from another browser into Microsoft Edge.

If you enable, this policy, the option to import search engine settings is automatically selected.

If you disable this policy, search engine settings aren't imported at first run, and users can’t import them manually.

If you don’t configure this policy, search engine settings are imported at first run, and users can choose whether to import this data manually during later browsing sessions.

You can set this policy as a recommendation. This means that Microsoft Edge imports search engine settings on first run, but users can select or clear the **search engine** option during manual import.

**Note**: This policy currently manages importing from Internet Explorer (on Windows 7, 8, and 10).</string><string id="InPrivateModeAvailability">Configure InPrivate mode availability</string><string id="InPrivateModeAvailability_Explain">Specifies whether the user can open pages in InPrivate mode in Microsoft Edge.

If you don't configure this policy or set it to 'Enabled' (0), users can open pages in InPrivate mode.

Set this policy to 'Disable' (1) to stop users from using InPrivate mode.

Set this policy to 'Forced' (2) to always use InPrivate mode.

* 0 = InPrivate mode available

* 1 = InPrivate mode disabled

* 2 = InPrivate mode forced</string><string id="InPrivateModeAvailability_Enabled">InPrivate mode available</string><string id="InPrivateModeAvailability_Disabled">InPrivate mode disabled</string><string id="InPrivateModeAvailability_Forced">InPrivate mode forced</string><string id="InternetExplorerIntegrationLevel">Configure Internet Explorer integration</string><string id="InternetExplorerIntegrationLevel_Explain">For guidance about configuring the optimal experience for Internet Explorer mode see https://go.microsoft.com/fwlink/?linkid=2094210</string><string id="InternetExplorerIntegrationLevel_None">None</string><string id="InternetExplorerIntegrationLevel_IEMode">Internet Explorer mode</string><string id="InternetExplorerIntegrationLevel_NeedIE">Internet Explorer 11</string><string id="InternetExplorerIntegrationSiteList">Configure the Enterprise Mode Site List</string><string id="InternetExplorerIntegrationSiteList_Explain">For guidance about configuring the optimal experience for Internet Explorer mode see https://go.microsoft.com/fwlink/?linkid=2094210

Example value: https://internal.contoso.com/sitelist.xml</string><string id="IsolateOrigins">Enable site isolation for specific origins</string><string id="IsolateOrigins_Explain">Specify origins to run in isolation, in their own process.
This policy also isolates origins named by subdomains - for example, specifying https://contoso.com/ will cause https://foo.contoso.com/ to be isolated as part of the https://contoso.com/ site.
If the policy is enabled, each of the named origins in a comma-separated list will run in its own process.
If you disable this policy, then both the 'IsolateOrigins' and 'SitePerProcess' features are disabled. Users can still enable 'IsolateOrigins' policy manually, via command line flags.
If you don't configure the policy, the user can change this setting.

Example value: https://contoso.com/,https://fabrikam.com/</string><string id="ManagedFavorites">Configure favorites</string><string id="ManagedFavorites_Explain">Configures a list of managed favorites.

The policy creates a list of favorites. Each favorite contains the keys &quot;name&quot; and &quot;url,&quot; which hold the favorite's name and its target. You can configure a subfolder by defining a favorites without an &quot;url&quot; key but with an additional &quot;children&quot; key that contains a list of favorites as defined above (some of which may be folders again). Microsoft Edge amends incomplete URLs as if they were submitted via the Address Bar, for example &quot;microsoft.com&quot; becomes &quot;https://microsoft.com/&quot;.

These favorites are placed in a folder that can't be modified by the user (but the user can choose to hide it from the favorites bar). By default the folder name is &quot;Managed favorites&quot; but you can change it by adding to the list of favorites a dictionary containing the key &quot;toplevel_name&quot; with the desired folder name as the value.

Managed favorites are not synced to the user account and can't be modified by extensions.

Example value:

[
  {
    &quot;toplevel_name&quot;: &quot;My managed favorites folder&quot;
  }, 
  {
    &quot;url&quot;: &quot;microsoft.com&quot;, 
    &quot;name&quot;: &quot;Microsoft&quot;
  }, 
  {
    &quot;url&quot;: &quot;bing.com&quot;, 
    &quot;name&quot;: &quot;Bing&quot;
  }, 
  {
    &quot;name&quot;: &quot;Microsoft Edge links&quot;, 
    &quot;children&quot;: [
      {
        &quot;url&quot;: &quot;www.microsoftedgeinsider.com&quot;, 
        &quot;name&quot;: &quot;Microsoft Edge Insiders&quot;
      }, 
      {
        &quot;url&quot;: &quot;www.microsoft.com/windows/microsoft-edge&quot;, 
        &quot;name&quot;: &quot;Microsoft Edge&quot;
      }
    ]
  }
]</string><string id="ManagedSearchEngines">Manage Search Engines</string><string id="ManagedSearchEngines_Explain">Lets you configure a list of list of up to 10 search engines, one of which must be marked as the default search engine.
You do not need to specify the encoding for any search engine.

If you enable this policy, users can't add, remove, or change any search engine in the list. Users can set their default search engine to any search engine in the list.

If you disable or don't configure this policy, users can modify the search engines list as desired.

If the 'DefaultSearchProviderSearchURL' policy is set, this policy ('ManagedSearchEngines') is ignored. The user must restart their browser to finish applying this policy.

Example value:

[
  {
    &quot;suggest_url&quot;: &quot;https://www.example1.com/qbox?query={searchTerms}&quot;, 
    &quot;image_search_url&quot;: &quot;https://www.example1.com/images/detail/search?iss=sbiupload&quot;, 
    &quot;name&quot;: &quot;Example1&quot;, 
    &quot;keyword&quot;: &quot;example1.com&quot;, 
    &quot;is_default&quot;: true, 
    &quot;search_url&quot;: &quot;https://www.example1.com/search?q={searchTerms}&quot;
  }, 
  {
    &quot;image_search_url&quot;: &quot;https://www.example2.com/images/detail/search?iss=sbiupload&quot;, 
    &quot;suggest_url&quot;: &quot;https://www.example2.com/qbox?query={searchTerms}&quot;, 
    &quot;search_url&quot;: &quot;https://www.example2.com/search?q={searchTerms}&quot;, 
    &quot;name&quot;: &quot;Example2&quot;, 
    &quot;keyword&quot;: &quot;example2.com&quot;
  }, 
  {
    &quot;suggest_url&quot;: &quot;https://www.example3.com/qbox?query={searchTerms}&quot;, 
    &quot;image_search_url&quot;: &quot;https://www.example3.com/images/detail/search?iss=sbiupload&quot;, 
    &quot;name&quot;: &quot;Example3&quot;, 
    &quot;keyword&quot;: &quot;example3.com&quot;, 
    &quot;encoding&quot;: &quot;UTF-8&quot;, 
    &quot;search_url&quot;: &quot;https://www.example3.com/search?q={searchTerms}&quot;
  }
]</string><string id="MaxConnectionsPerProxy">Maximum number of concurrent connections to the proxy server</string><string id="MaxConnectionsPerProxy_Explain">Specifies the maximum number of simultaneous connections to the proxy server.

Some proxy servers can't handle a high number of concurrent connections per client - you can solve this by setting this policy to a lower value.

The value of this policy should be lower than 100 and higher than 6. The default value is 32.

Some web apps are known to consume many connections with hanging GETs - lowering the maximum connections below 32 may lead to browser networking hangs if too many of these kind of web apps are open.

If you don't configure this policy, the default value (32) is used.</string><string id="MediaRouterCastAllowAllIPs">Allow Google Cast to connect to Cast devices on all IP addresses</string><string id="MediaRouterCastAllowAllIPs_Explain">Enable this policy to let Google Cast connect to Cast devices on all IP addresses, not just RFC1918/RFC4193 private addresses.

Disable this policy to restrict Google Cast to Cast devices on RFC1918/RFC4193 private addresses.

If you don't configure this policy, Google Cast connects to Cast devices on RFC1918/RFC4193 private addresses only, unless you enable the CastAllowAllIPs feature.

If the 'EnableMediaRouter' policy is disabled, then this policy has no effect.</string><string id="MetricsReportingEnabled">Enable usage and crash-related data reporting</string><string id="MetricsReportingEnabled_Explain">For Windows 10 Beta and Stable channels of Microsoft Edge, this policy when configured will override the Windows diagnostic data setting for collection or non-collection of Microsoft Edge usage and crash related data (https://go.microsoft.com/fwlink/?linkid=2099569).

This policy enables reporting of usage and crash-related data about Microsoft Edge to Microsoft and prevents users from changing this setting.

Enable this policy to send reporting of usage and crash-related data to Microsoft. Disable this policy to not send the data to Microsoft. In both cases, users can't change or override the setting.

On Windows 10, Beta and Stable channels, this policy controls usage and crash related data. If this policy is not configured, Microsoft Edge will default to the Windows diagnostic data setting.

On Windows 10, Canary and Dev channels, this policy controls usage and crash related data. If this policy is not configured, Microsoft Edge will default to the user's preference.

On Windows 7, 8, and Mac this policy controls usage and crash related data. If this policy is not configured, Microsoft Edge will default to the user's preference.</string><string id="NetworkPredictionOptions">Enable network prediction</string><string id="NetworkPredictionOptions_Explain">Enables network prediction and prevents users from changing this setting.

This controls DNS prefetching, TCP and SSL preconnection, and prerendering of web pages.

If you don't configure this policy, network prediction is enabled but the user can change it.

* 0 = Predict network actions on any network connection

* 2 = Don't predict network actions on any network connection</string><string id="NetworkPredictionOptions_NetworkPredictionAlways">Predict network actions on any network connection</string><string id="NetworkPredictionOptions_NetworkPredictionWifiOnly">Predict network actions on any network that is not cellular.
(Deprecated in 50, removed in 52. After 52, if value 1 is set, it will be treated as 0 - predict network actions on any network connection.)</string><string id="NetworkPredictionOptions_NetworkPredictionNever">Don't predict network actions on any network connection</string><string id="NonRemovableProfileEnabled">Configure whether a user always has a default profile automatically signed in with their work or school account</string><string id="NonRemovableProfileEnabled_Explain">This policy determines if a user can remove the Microsoft Edge profile automatically signed in with a user's work or school account.

If you enable this policy, a non-removable profile will be created with the user's work or school account on Windows. This profile can't be signed out or removed.

If you disable or don't configure this policy, the profile automatically signed in with a user's work or school account on Windows can be signed out or removed by the user.

If you want to configure browser sign in, use the &quot;BrowserSignin&quot; policy.</string><string id="OverrideSecurityRestrictionsOnInsecureOrigin">Control where security restrictions on insecure origins apply</string><string id="OverrideSecurityRestrictionsOnInsecureOrigin_Explain">Specifies a list of origins (URLs) or hostname patterns (like &quot;*.contoso.com&quot;) for which security restrictions on insecure origins don't apply.

This policy lets you specify allowed origins for legacy applications that can't deploy TLS or set up a staging server for internal web development so that developers can test out features requiring secure contexts without having to deploy TLS on the staging server. This policy also prevents the origin from being labeled &quot;Not Secure&quot; in the omnibox.

Setting a list of URLs in this policy has the same effect as setting the command-line flag '--unsafely-treat-insecure-origin-as-secure' to a comma-separated list of the same URLs. If you enable this policy, it overrides the command-line flag.

For more information on secure contexts, see https://www.w3.org/TR/secure-contexts/.

Example value:

http://testserver.contoso.com/
*.contoso.com</string><string id="OverrideSecurityRestrictionsOnInsecureOriginDesc">Control where security restrictions on insecure origins apply</string><string id="ProactiveAuthEnabled">Enable Proactive Authentication</string><string id="ProactiveAuthEnabled_Explain">Lets you configure whether to turn on Proactive Authentication.

If you enable this policy, Microsoft Edge tries to proactively authenticate the signed-in user with Microsoft services. At regular intervals, Microsoft Edge checks with an online service for an updated manifest that contains the configuration that governs how to do this.

If you disable this policy, Microsoft Edge doesn't try to proactively authenticate the signed-in user with Microsoft services. Microsoft Edge no longer checks with an online service for an updated manifest that contains the configuration for doing this.

If you don't configure this policy, Proactive Authentication is turned on.</string><string id="PromotionalTabsEnabled">Enable full-tab promotional content</string><string id="PromotionalTabsEnabled_Explain">Control the presentation of full-tab promotional or educational content. This setting controls the presentation of welcome pages that help users sign into Microsoft Edge, choose their default browser, or learn about product features.

If you enable this policy (set it true) or don't configure it, Microsoft Edge can show full-tab content to users to provide product information.

If you disable (set to false) this policy, Microsoft Edge can't show full-tab content to users.</string><string id="PromptForDownloadLocation">Ask where to save downloaded files</string><string id="PromptForDownloadLocation_Explain">Set whether to ask where to save a file before downloading it.

If you enable this policy, the user is asked where to save each file before downloading; if you don't configure it, files are saved automatically to the default location, without asking the user.

If you don't configure this policy, the user will be able to change this setting.</string><string id="QuicAllowed">Allow QUIC protocol</string><string id="QuicAllowed_Explain">Allows use of the QUIC protocol in Microsoft Edge.

If you enable this policy or don't configure it, the QUIC protocol is allowed.

If you disable this policy, the QUIC protocol is blocked.

QUIC is a transport layer network protocol that can improve performance of web applications that currently use TCP.</string><string id="RelaunchNotification">Notify a user that a browser restart is recommended or required for pending updates</string><string id="RelaunchNotification_Explain">Notify users that they need to restart Microsoft Edge to apply a pending update.

If you don't configure this policy, Microsoft Edge adds a recycle icon at the far right of the top menu bar to prompt users to restart the browser to apply the update.

If you enable this policy and set it to 'Recommended' (1), a recurring warning prompts users that a restart is recommended. Users can dismiss this warning and defer the restart.

If you set the policy to 'Required' (2), a recurring warning prompts users that the browser will be restarted automatically as soon as a notification period passes. The default period is seven days. You can configure this period with the 'RelaunchNotificationPeriod' policy.

The user's session is restored when the browser restarts.

* Recommended (1) = Show a recurring prompt to the user indicating that a restart is recommended

* Required (2) = Show a recurring prompt to the user indicating that a restart is required</string><string id="RelaunchNotification_Recommended">Recommended - Show a recurring prompt to the user indicating that a restart is recommended</string><string id="RelaunchNotification_Required">Required - Show a recurring prompt to the user indicating that a restart is required</string><string id="RelaunchNotificationPeriod">Set the time period for update notifications</string><string id="RelaunchNotificationPeriod_Explain">Sets the time period, in milliseconds, over which users are notified that Microsoft Edge must be restarted to apply a pending update.

During this time period, the user is repeatedly informed that they need to restart. The app menu changes to indicate that a restart is needed when one third of the notification period passes. When two thirds of the notification period passes, the notification changes color, and again when the full notification period has passed. Additional notifications enabled by the 'RelaunchNotification' policy follow this same schedule.

If you don't configure this policy, the default period is 604800000 milliseconds (one week).

Restrictions:

* Minimum:3600000</string><string id="RendererCodeIntegrityEnabled">Enable renderer code integrity</string><string id="RendererCodeIntegrityEnabled_Explain">If this policy is enabled or left unset, then Renderer Code Integrity is enabled. This policy should only be disabled if compatibility issues are encountered with third party software that must run inside Microsoft Edge's renderer processes.

Disabling this policy has a detrimental effect on Microsoft Edge's security and stability because unknown and potentially hostile code will be allowed to load inside Microsoft Edge's renderer processes.</string><string id="RequireOnlineRevocationChecksForLocalAnchors">Specify if online OCSP/CRL checks are required for local trust anchors</string><string id="RequireOnlineRevocationChecksForLocalAnchors_Explain">Control whether online revocation checks (OCSP/CRL checks) are required. If Microsoft Edge can't get revocation status information, these certificates are treated as revoked (&quot;hard-fail&quot;).

If you enable this policy, Microsoft Edge always performs revocation checking for server certificates that successfully validate and are signed by locally-installed CA certificates.

If you don't configure or disable this policy, then Microsoft Edge uses the existing online revocation checking settings.</string><string id="ResolveNavigationErrorsUseWebService">Enable resolution of navigation errors using a web service</string><string id="ResolveNavigationErrorsUseWebService_Explain">Allow Microsoft Edge to issue a dataless connection to a web service to probe networks for connectivity in cases like hotel and airport Wi-Fi.

If you enable this policy, a web service is used for network connectivity tests.

If you disable this policy, Microsoft Edge uses native APIs to try to resolve network connectivity and navigation issues.

**Note**: Except on Windows 8 and later versions of Windows, Microsoft Edge *always* uses native APIs to resolve connectivity issues.

If you don't configure this policy, Microsoft Edge respects the user preference that's set under Services at edge://settings/privacy.
Specifically, there's a **Use a web service to help resolve navigation errors** toggle, which the user can switch on or off. Be aware that if you have enabled this policy (ResolveNavigationErrorsUseWebService), the **Use a web service to help resolve navigation errors** setting is turned on, but the user can't change the setting by using the toggle. If you have disabled this policy, the **Use a web service to help resolve navigation errors** setting is turned off, and the user can't change the setting by using the toggle.</string><string id="RestrictSigninToPattern">Restrict which accounts can be used as Microsoft Edge primary accounts</string><string id="RestrictSigninToPattern_Explain">Determines which accounts can be set as browser primary accounts in Microsoft Edge (the account that is chosen during the Sync opt-in flow).

If a user tries to set a browser primary account with a username that doesn't match this pattern, they are blocked and see an appropriate error message.

If you don't configure this policy or leave it blank, users can set any account as a browser primary account in Microsoft Edge.

Example value: .*@contoso.com</string><string id="RunAllFlashInAllowMode">Extend Adobe Flash content setting to all content</string><string id="RunAllFlashInAllowMode_Explain">If you enable this policy, all Adobe Flash content embedded in websites that are set to allow Adobe Flash in the content settings -- either by the user or by enterprise policy -- will run. This includes content from other origins and/or small content.

To control which websites are allowed to run Adobe Flash, see the specifications in the 'DefaultPluginsSetting', 'PluginsAllowedForUrls', and 'PluginsBlockedForUrls' policies.

If you disable this policy or don't configure it, Adobe Flash content from other origins (from sites that aren't specified in the three policies mentioned immediately above) or small content might be blocked.</string><string id="SSLErrorOverrideAllowed">Allow users to proceed from the HTTPS warning page</string><string id="SSLErrorOverrideAllowed_Explain">Microsoft Edge shows a warning page when users visit sites that have SSL errors.

If you enable or don't configure (default) this policy, users can click through these warning pages.

If you disable this policy, users are blocked from clicking through any warning page.</string><string id="SSLVersionMin">Minimum TLS version enabled</string><string id="SSLVersionMin_Explain">Sets the minimum supported version of SSL. If you don't configure this policy, Microsoft Edge uses a default minimum version, TLS 1.0.

If you enable this policy, you can set the minimum version to one of the following values: &quot;tls1&quot;, &quot;tls1.1&quot; or &quot;tls1.2&quot;. When set, Microsoft Edge won't use any version of SSL/TLS lower than the specified version. Any unrecognized value is ignored.

* &quot;tls1&quot; = TLS 1.0

* &quot;tls1.1&quot; = TLS 1.1

* &quot;tls1.2&quot; = TLS 1.2

Example value: tls1</string><string id="SSLVersionMin_TLSv1">TLS 1.0</string><string id="SSLVersionMin_TLSv1_1">TLS 1.1</string><string id="SSLVersionMin_TLSv1_2">TLS 1.2</string><string id="SavingBrowserHistoryDisabled">Disable saving browser history</string><string id="SavingBrowserHistoryDisabled_Explain">Disables saving browser history and prevents users from changing this setting.

If you enable this policy, browsing history isn't saved. This also disables tab syncing.

If you disable this policy or don't configure it, browsing history is saved.</string><string id="SearchSuggestEnabled">Enable search suggestions</string><string id="SearchSuggestEnabled_Explain">Enables web search suggestions in Microsoft Edge's Address Bar and Auto-Suggest List and prevents users from changing this policy.

If you enable this policy, web search suggestions are used.

If you disable this policy, web search suggestions are never used, however local history and local favorites suggestions still appear. If you disable this policy, neither the typed characters, nor the URLs visited will be included in telemetry to Microsoft.

If this policy is left not set, search suggestions are enabled but the user can change that.</string><string id="SecurityKeyPermitAttestation">Websites or domains that don't need permission to use direct Security Key attestation</string><string id="SecurityKeyPermitAttestation_Explain">Specifies websites and domains that don't need explicit user permission when attestation certificates from security keys are requested. Additionally, a signal is sent to the security key indicating that it can use individual attestation. Without this, users are prompted each time a site requests attestation of security keys.

Sites (like https://contoso.com/some/path) only match as U2F appIDs. Domains (like contoso.com) only match as webauthn RP IDs. To cover both U2F and webauthn APIs for a given site, you need to list both the appID URL and domain.

Example value:

https://contoso.com</string><string id="SecurityKeyPermitAttestationDesc">Websites or domains that don't need permission to use direct Security Key attestation</string><string id="SendIntranetToInternetExplorer">Send all intranet sites to Internet Explorer</string><string id="SendIntranetToInternetExplorer_Explain">For guidance about configuring the optimal experience for Internet Explorer mode see https://go.microsoft.com/fwlink/?linkid=2094210</string><string id="SendSiteInfoToImproveServices">Send site information to improve Microsoft services</string><string id="SendSiteInfoToImproveServices_Explain">For Windows 10 Beta and Stable channels of Microsoft Edge, this policy when configured will override the Windows diagnostic data setting for collection or non-collection of Microsoft Edge website browsing information (https://go.microsoft.com/fwlink/?linkid=2099569).

This policy setting lets you decide whether users can send info about websites they visit in Microsoft Edge to Microsoft to improve services like search.

If you enable this policy, info about websites visited in Microsoft Edge is sent to Microsoft.

If you disable this policy, info about websites visited in Microsoft Edge is not sent to Microsoft.

On Windows 10, Beta and Stable channels, this policy controls sending info about websites users visit. If this policy is not configured, Microsoft Edge will default to the Windows diagnostic data setting.

On Windows 10, Canary and Dev channels, this policy controls sending info about websites users visit. If this policy is not configured, Microsoft Edge will default to the user's preference.

On Windows 7, 8, and Mac this policy controls sending info about websites users visit. If this policy is not configured, Microsoft Edge will default to the user's preference.</string><string id="ShowOfficeShortcutInFavoritesBar">Show Microsoft Office shortcut in favorites bar</string><string id="ShowOfficeShortcutInFavoritesBar_Explain">Specifies whether to include a shortcut to Office.com in the favorites bar. For users signed into Microsoft Edge the shortcut takes users to their Microsoft Office apps and docs.

If this policy is enabled or not configure, users can choose whether to see the shortcut by changing the toggle in the favorites bar context menu.

If the policy is disabled, the shortcut won't be shown.</string><string id="SignedHTTPExchangeEnabled">Enable Signed HTTP Exchange (SXG) support</string><string id="SignedHTTPExchangeEnabled_Explain">Enable support for Signed HTTP Exchange (SXG).

If this policy isn't set or enabled, Microsoft Edge will accept web contents served as Signed HTTP Exchanges.

If this policy is set to disabled, Signed HTTP Exchanges can't be loaded.</string><string id="SitePerProcess">Enable site isolation for every site</string><string id="SitePerProcess_Explain">
The 'SitePerProcess' policy can be used to prevent users from opting out of the default behavior of isolating all sites. Note that you can also use the IsolateOrigins policy to isolate additional, finer-grained origins.
If you enable this policy, users can't opt out of the default behavior where each site runs in its own process.
If you disable or don’t configure this policy, a user can opt out of site isolation.  (For example, by using &quot;Disable site isolation&quot; entry in edge://flags.)  Disabling the policy or not configuring the policy doesn't turn off Site Isolation.
</string><string id="SpellcheckEnabled">Enable spellcheck</string><string id="SpellcheckEnabled_Explain">If you enable or don't configure this policy, the user can use spellcheck.

If you disable this policy, the user can't use spellcheck and the 'SpellcheckLanguage' and 'SpellcheckLanguageBlocklist' policies are also disabled.</string><string id="SpellcheckLanguage">Enable specific spellcheck languages</string><string id="SpellcheckLanguage_Explain">Enables different languages for spellcheck. Any language that you specify that isn't recognized is ignored.

If you enable this policy, spellcheck is enabled for the languages specified, as well as any languages the user has enabled.

If you don't configure or disable this policy, there's no change to the user's spellcheck preferences.

If the 'SpellcheckEnabled' policy is disabled, this policy will have no effect.

If a language is included in both the 'SpellcheckLanguage' and the 'SpellcheckLanguageBlocklist' policy, the spellcheck language is enabled.

The supported languages are: af, bg, ca, cs, cy, da, de, el, en-AU, en-CA, en-GB, en-US, es, es-419, es-AR, es-ES, es-MX, es-US, et, fa, fo, fr, he, hi, hr, hu, id, it, ko, lt, lv, nb, nl, pl, pt-BR, pt-PT, ro, ru, sh, sk, sl, sq, sr, sv, ta, tg, tr, uk, vi.

Example value:

fr
es</string><string id="SpellcheckLanguageDesc">Enable specific spellcheck languages</string><string id="SpellcheckLanguageBlocklist">Force disable spellcheck languages</string><string id="SpellcheckLanguageBlocklist_Explain">Force-disables spellcheck languages. Unrecognized languages in that list will be ignored.

If you enable this policy, spellcheck will be disabled for the languages specified. The user can still enable or disable spellcheck for languages not in the list.

If you do not set this policy, or disable it, there will be no change to the user's spellcheck preferences.

If the 'SpellcheckEnabled' policy is set to disabled, this policy will have no effect.

If a language is included in both the 'SpellcheckLanguage' and the 'SpellcheckLanguageBlocklist' policy, the spellcheck language is enabled.

The currently supported languages are: af, bg, ca, cs, da, de, el, en-AU, en-CA, en-GB, en-US, es, es-419, es-AR, es-ES, es-MX, es-US, et, fa, fo, fr, he, hi, hr, hu, id, it, ko, lt, lv, nb, nl, pl, pt-BR, pt-PT, ro, ru, sh, sk, sl, sq, sr, sv, ta, tg, tr, uk, vi.

Example value:

fr
es</string><string id="SpellcheckLanguageBlocklistDesc">Force disable spellcheck languages</string><string id="SuppressUnsupportedOSWarning">Suppress the unsupported OS warning</string><string id="SuppressUnsupportedOSWarning_Explain">Suppresses the warning that appears when Microsoft Edge is running on a computer or operating system that is no longer supported.</string><string id="SyncDisabled">Disable synchronization of data using Microsoft sync services</string><string id="SyncDisabled_Explain">Disables data synchronization in Microsoft Edge and prevents users from modifying this setting.

If this policy is not set, users will be able to either turn on or turn off sync.

Do not enable this policy when the policy 'RoamingProfileSupportEnabled' is enabled, as 'RoamingProfileSupportEnabled' duplicates the sync functionality.</string><string id="TabFreezingEnabled">Allow freezing of background tabs</string><string id="TabFreezingEnabled_Explain">Controls whether Microsoft Edge can freeze tabs that are in the background for at least 5 minutes.

Tab freezing reduces CPU, battery, and memory usage. Microsoft Edge uses heuristics to avoid freezing tabs that do useful work in the background, such as display notifications, play sound, and stream video.

If you enable or don't configure this policy, tabs that have been in the background for at least 5 minutes might be frozen.

If you disable this policy, no tabs will be frozen.</string><string id="TaskManagerEndProcessEnabled">Enable ending processes in the Browser task manager</string><string id="TaskManagerEndProcessEnabled_Explain">If you enable or don't configure this policy, users can end processes in the Browser task manager. If you disable it, users can't end processes, and the End process button is disabled in the Browser task manager.</string><string id="TrackingPrevention">Block tracking of users' web-browsing activity</string><string id="TrackingPrevention_Explain">Lets you decide whether to block websites from tracking users' web-browsing activity.

If you enable this policy, you have the following options for setting the level of tracking prevention:

0 = Off (no tracking prevention)
1 = Basic (blocks harmful trackers, content and ads will be personalized)
2 = Balanced (blocks harmful trackers and trackers from sites user has not visited; content and ads will be less personalized)
3 = Strict (blocks harmful trackers and majority of trackers from all sites; content and ads will have minimal personalization. Some parts of sites might not work)

If you disable this policy or don't configure it, users can set their own level of tracking prevention.</string><string id="TrackingPrevention_TrackingPreventionOff">Off (no tracking prevention)</string><string id="TrackingPrevention_TrackingPreventionBasic">Basic (blocks malicious trackers but allows those that show you relevant ads)</string><string id="TrackingPrevention_TrackingPreventionBalanced">Balanced (blocks malicious trackers and some third-party trackers; you'll see fewer relevant ads)</string><string id="TrackingPrevention_TrackingPreventionStrict">Strict (blocks the majority of third-party trackers; might break some sites)</string><string id="TranslateEnabled">Enable Translate</string><string id="TranslateEnabled_Explain">Enables the integrated Microsoft translation service on Microsoft Edge.

If you enable this policy, Microsoft Edge offers translation functionality to the user by showing an integrated translate flyout when appropriate, and a translate option on the right-click context menu.

Disable this policy to disable all built-in translate features.

If you don't configure the policy, users can choose whether to use the translation functionality or not.</string><string id="URLBlocklist">Block access to a list of URLs</string><string id="URLBlocklist_Explain">Define a list of sites, based on URL patterns, that are blocked (your users can't load them).

Format the URL pattern according to https://go.microsoft.com/fwlink/?linkid=2095322.

You can define exceptions in the 'URLAllowlist' policy. These policies are limited to 1000 entries; subsequent entries are ignored.

Note that blocking internal 'edge://*' URLs isn't recommended - this may lead to unexpected errors.

This policy doesn't prevent the page from updating dynamically through JavaScript. For example, if you block 'contoso.com/abc', users might still be able to visit 'contoso.com' and click on a link to visit 'contoso.com/abc', as long as the page doesn't refresh.

If you don't configure this policy, no URLs are blocked.

Example value:

contoso.com
https://ssl.server.com
hosting.com/bad_path
https://server:8080/path
.exact.hostname.com
file://*
custom_scheme:*
*</string><string id="URLBlocklistDesc">Block access to a list of URLs</string><string id="URLAllowlist">Define a list of allowed URLs</string><string id="URLAllowlist_Explain">Allow access to the listed URLs, as exceptions to the URL block list.

Format the URL pattern according to https://go.microsoft.com/fwlink/?linkid=2095322.

You can use this policy to open exceptions to restrictive block lists. For example, you can include '*' in the block list to block all requests, and then use this policy to allow access to a limited list of URLs. You can use this policy to open exceptions to certain schemes, subdomains of other domains, ports, or specific paths.

The most specific filter determines if a URL is blocked or allowed. The allowed list takes precedence over the block list.

This policy is limited to 1000 entries; subsequent entries are ignored.

If you don't configure this policy, there are no exceptions to the block list in the 'URLBlocklist' policy.

Example value:

contoso.com
https://ssl.server.com
hosting.com/good_path
https://server:8080/path
.exact.hostname.com</string><string id="URLAllowlistDesc">Define a list of allowed URLs</string><string id="UserDataDir">Set the user data directory</string><string id="UserDataDir_Explain">Set the directory to use for storing user data.

If you enable this policy, Microsoft Edge uses the specified directory regardless of whether the user has set the '--user-data-dir' command-line flag.

If you don't enable this policy, the default profile path is used, but the user can override it by using the '--user-data-dir' flag. Users can find the directory for the profile at edge://version/ under profile path.

To avoid data loss or other errors, don't configure this policy to a volume's root directory or to a directory that's used for other purposes, because Microsoft Edge manages its contents.

See https://go.microsoft.com/fwlink/?linkid=2095041 for a list of variables that can be used.

Example value: ${users}/${user_name}/Edge</string><string id="UserFeedbackAllowed">Allow user feedback</string><string id="UserFeedbackAllowed_Explain">Microsoft Edge uses the Edge Feedback feature (enabled by default) to allow users to send feedback, suggestions or customer surveys and to report any issues with the browser. Also, by default, users can't disable (turn off) the Edge Feedback feature.

If you enable this policy or don't configure it, users can invoke Edge Feedback.

If you disable this policy, users can't invoke Edge Feedback.</string><string id="VideoCaptureAllowed">Allow or block video capture</string><string id="VideoCaptureAllowed_Explain">Control whether sites can capture video.

If enabled or not configured (default), the user will be asked about video capture access for all sites except those with URLs configured in the 'VideoCaptureAllowedUrls' policy list, which will be granted access without prompting.

If you disable this policy, the user isn't prompted, and video capture is only available to URLs configured in 'VideoCaptureAllowedUrls' policy.

This policy affects all types of video inputs, not only the built-in camera.</string><string id="VideoCaptureAllowedUrls">Sites that can access video capture devices without requesting permission</string><string id="VideoCaptureAllowedUrls_Explain">Specify websites, based on URL patterns, that can use video capture devices without asking the user for permission. Patterns in this list are matched against the security origin of the requesting URL. If they match, the site is automatically granted access to video capture devices.

Example value:

https://www.contoso.com/
https://[*.]contoso.edu/</string><string id="VideoCaptureAllowedUrlsDesc">Sites that can access video capture devices without requesting permission</string><string id="WPADQuickCheckEnabled">Set WPAD optimization</string><string id="WPADQuickCheckEnabled_Explain">Allows you to turn off WPAD (Web Proxy Auto-Discovery) optimization in Microsoft Edge.

If you disable this policy, WPAD optimization is disabled, which makes the browser wait longer for DNS-based WPAD servers.

If you enable or don't configure the policy, WPAD optimization is enabled.

Independent of whether or how this policy is enabled, the WPAD optimization setting cannot be changed by users.</string><string id="WebDriverOverridesIncompatiblePolicies">Allow WebDriver to Override Incompatible Policies</string><string id="WebDriverOverridesIncompatiblePolicies_Explain">This policy lets users of the WebDriver interface override policies that could interfere with its operation.

If you enable this policy, WebDriver can be configured to override incompatible policies.

If you disable this policy or don't configure it, WebDriver can't be configured to override incompatible policies.

Note: Currently, the 'SitePerProcess' and 'IsolateOrigins' policies have been verified to interfere with WebDriver operations. In the future, additional policies may be determined to interfere with WebDriver.</string><string id="WebRtcLocalhostIpHandling">Restrict exposure of local IP address by WebRTC</string><string id="WebRtcLocalhostIpHandling_Explain">Allows you to set whether or not WebRTC exposes the user's local IP address.

If you set this policy to &quot;AllowAllInterfaces&quot; ('default') or &quot;AllowPublicAndPrivateInterfaces&quot; ('default_public_and_private_interfaces'), WebRTC exposes the local IP address.

If you set this policy to &quot;AllowPublicInterfaceOnly&quot; ('default_public_interface_only') or &quot;DisableNonProxiedUdp&quot; ('disable_non_proxied_udp'), WebRTC doesn't expose the local IP address.

If you don't set this policy, or if you disable it, WebRTC exposes the local IP address.

  * 'default' = Allow all interfaces. This exposes the local IP address.
  * 'default_public_and_private_interfaces' = Allow public and private interfaces over http default route. This exposes the local IP address.
  * 'default_public_interface_only' = Allow public interface over http default route. This doesn't expose the local IP address.
  * 'disable_non_proxied_udp' = Use TCP unless proxy server supports UDP. This doesn't expose the local IP address.

Example value: default</string><string id="WebRtcLocalhostIpHandling_AllowAllInterfaces">Allow all interfaces. This exposes the local IP address</string><string id="WebRtcLocalhostIpHandling_AllowPublicAndPrivateInterfaces">Allow public and private interfaces over http default route. This exposes the local IP address</string><string id="WebRtcLocalhostIpHandling_AllowPublicInterfaceOnly">Allow public interface over http default route. This doesn't expose the local IP address</string><string id="WebRtcLocalhostIpHandling_DisableNonProxiedUdp">Use TCP unless proxy server supports UDP. This doesn't expose the local IP address</string><string id="WebRtcUdpPortRange">Restrict the range of local UDP ports used by WebRTC</string><string id="WebRtcUdpPortRange_Explain">Restricts the UDP port range used by WebRTC to a specified port interval (endpoints included).

By configuring this policy, you specify the range of local UDP ports that WebRTC can use.

If you don't configure this policy, or if you set it to an empty string or invalid port range, WebRTC can use any available local UDP port.

Example value: 10000-11999</string><string id="SUPPORTED_WIN7_V77">Microsoft Edge version 77, Windows 7 or later</string><string id="SUPPORTED_WIN7_V78">Microsoft Edge version 78, Windows 7 or later</string><string id="SUPPORTED_WIN7_V79">Microsoft Edge version 79, Windows 7 or later</string><string id="SUPPORTED_WIN7_ONLY_V77">Microsoft Edge version 77, Windows 7</string><string id="microsoft_edge">Microsoft Edge</string><string id="microsoft_edge_recommended">Microsoft Edge - Default Settings (users can override)</string></stringTable><presentationTable><presentation id="EnableMediaRouter"/><presentation id="ShowCastIconInToolbar"/><presentation id="DefaultCookiesSetting"><dropdownList refId="DefaultCookiesSetting">Configure cookies</dropdownList></presentation><presentation id="DefaultImagesSetting"><dropdownList refId="DefaultImagesSetting">Default images setting</dropdownList></presentation><presentation id="DefaultJavaScriptSetting"><dropdownList refId="DefaultJavaScriptSetting">Default JavaScript setting</dropdownList></presentation><presentation id="DefaultPluginsSetting"><dropdownList refId="DefaultPluginsSetting">Default Adobe Flash setting</dropdownList></presentation><presentation id="DefaultPopupsSetting"><dropdownList refId="DefaultPopupsSetting">Default pop-up window setting</dropdownList></presentation><presentation id="DefaultNotificationsSetting"><dropdownList refId="DefaultNotificationsSetting">Default notification setting</dropdownList></presentation><presentation id="DefaultGeolocationSetting"><dropdownList refId="DefaultGeolocationSetting">Default geolocation setting</dropdownList></presentation><presentation id="DefaultWebBluetoothGuardSetting"><dropdownList refId="DefaultWebBluetoothGuardSetting">Control use of the Web Bluetooth API</dropdownList></presentation><presentation id="DefaultWebUsbGuardSetting"><dropdownList refId="DefaultWebUsbGuardSetting">Control use of the WebUSB API</dropdownList></presentation><presentation id="AutoSelectCertificateForUrls"><listBox refId="AutoSelectCertificateForUrlsDesc">Automatically select client certificates for these sites</listBox></presentation><presentation id="CookiesAllowedForUrls"><listBox refId="CookiesAllowedForUrlsDesc">Allow cookies on specific sites</listBox></presentation><presentation id="CookiesBlockedForUrls"><listBox refId="CookiesBlockedForUrlsDesc">Block cookies on specific sites</listBox></presentation><presentation id="CookiesSessionOnlyForUrls"><listBox refId="CookiesSessionOnlyForUrlsDesc">Limit cookies from specific websites to the current session</listBox></presentation><presentation id="ImagesAllowedForUrls"><listBox refId="ImagesAllowedForUrlsDesc">Allow images on these sites</listBox></presentation><presentation id="ImagesBlockedForUrls"><listBox refId="ImagesBlockedForUrlsDesc">Block images on specific sites</listBox></presentation><presentation id="JavaScriptAllowedForUrls"><listBox refId="JavaScriptAllowedForUrlsDesc">Allow JavaScript on specific sites</listBox></presentation><presentation id="JavaScriptBlockedForUrls"><listBox refId="JavaScriptBlockedForUrlsDesc">Block JavaScript on specific sites</listBox></presentation><presentation id="PluginsAllowedForUrls"><listBox refId="PluginsAllowedForUrlsDesc">Allow the Adobe Flash plug-in on specific sites</listBox></presentation><presentation id="PluginsBlockedForUrls"><listBox refId="PluginsBlockedForUrlsDesc">Block the Adobe Flash plug-in on specific sites</listBox></presentation><presentation id="PopupsAllowedForUrls"><listBox refId="PopupsAllowedForUrlsDesc">Allow pop-up windows on specific sites</listBox></presentation><presentation id="RegisteredProtocolHandlers"><textBox refId="RegisteredProtocolHandlers"><label>Register protocol handlers</label></textBox></presentation><presentation id="PopupsBlockedForUrls"><listBox refId="PopupsBlockedForUrlsDesc">Block pop-up windows on specific sites</listBox></presentation><presentation id="NotificationsAllowedForUrls"><listBox refId="NotificationsAllowedForUrlsDesc">Allow notifications on specific sites</listBox></presentation><presentation id="NotificationsBlockedForUrls"><listBox refId="NotificationsBlockedForUrlsDesc">Block notifications on specific sites</listBox></presentation><presentation id="WebUsbAllowDevicesForUrls"><textBox refId="WebUsbAllowDevicesForUrls"><label>Grant access to specific sites to connect to specific USB devices</label></textBox></presentation><presentation id="WebUsbAskForUrls"><listBox refId="WebUsbAskForUrlsDesc">Allow WebUSB on specific sites</listBox></presentation><presentation id="WebUsbBlockedForUrls"><listBox refId="WebUsbBlockedForUrlsDesc">Block WebUSB on specific sites</listBox></presentation><presentation id="DefaultSearchProviderEnabled"/><presentation id="DefaultSearchProviderName"><textBox refId="DefaultSearchProviderName"><label>Default search provider name</label></textBox></presentation><presentation id="DefaultSearchProviderKeyword"><textBox refId="DefaultSearchProviderKeyword"><label>Default search provider keyword</label></textBox></presentation><presentation id="DefaultSearchProviderSearchURL"><textBox refId="DefaultSearchProviderSearchURL"><label>Default search provider search URL</label></textBox></presentation><presentation id="DefaultSearchProviderSuggestURL"><textBox refId="DefaultSearchProviderSuggestURL"><label>Default search provider URL for suggestions</label></textBox></presentation><presentation id="DefaultSearchProviderEncodings"><listBox refId="DefaultSearchProviderEncodingsDesc">Default search provider encodings</listBox></presentation><presentation id="DefaultSearchProviderImageURL"><textBox refId="DefaultSearchProviderImageURL"><label>Specifies the search-by-image feature for the default search provider</label></textBox></presentation><presentation id="DefaultSearchProviderImageURLPostParams"><textBox refId="DefaultSearchProviderImageURLPostParams"><label>Parameters for an image URL that uses POST</label></textBox></presentation><presentation id="ExtensionInstallBlocklist"><listBox refId="ExtensionInstallBlocklistDesc">Extension IDs the user should be prevented from installing (or * for all)</listBox></presentation><presentation id="ExtensionInstallAllowlist"><listBox refId="ExtensionInstallAllowlistDesc">Extension IDs to exempt from the block list</listBox></presentation><presentation id="ExtensionInstallForcelist"><listBox refId="ExtensionInstallForcelistDesc">Extension/App IDs and update URLs to be silently installed</listBox></presentation><presentation id="ExtensionInstallSources"><listBox refId="ExtensionInstallSourcesDesc">URL patterns to allow extension, app, and user script installs from</listBox></presentation><presentation id="ExtensionAllowedTypes"><listBox refId="ExtensionAllowedTypesDesc">Types of extensions/apps that are allowed to be installed</listBox></presentation><presentation id="ExtensionSettings"><textBox refId="ExtensionSettings"><label>Configure extension management settings</label></textBox></presentation><presentation id="AuthSchemes"><textBox refId="AuthSchemes"><label>Supported authentication schemes</label></textBox></presentation><presentation id="DisableAuthNegotiateCnameLookup"/><presentation id="EnableAuthNegotiatePort"/><presentation id="AuthServerAllowlist"><textBox refId="AuthServerAllowlist"><label>Configure list of allowed authentication servers</label></textBox></presentation><presentation id="AuthNegotiateDelegateAllowlist"><textBox refId="AuthNegotiateDelegateAllowlist"><label>Specifies a list of servers that Microsoft Edge can delegate user credentials to</label></textBox></presentation><presentation id="AllowCrossOriginAuthPrompt"/><presentation id="NativeMessagingBlocklist"><listBox refId="NativeMessagingBlocklistDesc">Names of the forbidden native messaging hosts (or * for all)</listBox></presentation><presentation id="NativeMessagingAllowlist"><listBox refId="NativeMessagingAllowlistDesc">Names of the native messaging hosts to exempt from the block list</listBox></presentation><presentation id="NativeMessagingUserLevelHosts"/><presentation id="PasswordManagerEnabled"/><presentation id="PasswordProtectionWarningTrigger"><dropdownList refId="PasswordProtectionWarningTrigger">Configure password protection warning trigger</dropdownList></presentation><presentation id="PasswordProtectionLoginURLs"><listBox refId="PasswordProtectionLoginURLsDesc">Configure the list of enterprise login URLs where password protection service should capture fingerprint of password</listBox></presentation><presentation id="PasswordProtectionChangePasswordURL"><textBox refId="PasswordProtectionChangePasswordURL"><label>Configure the change password URL</label></textBox></presentation><presentation id="PrintingEnabled"/><presentation id="UseSystemPrintDialog"/><presentation id="PrintHeaderFooter"/><presentation id="DefaultPrinterSelection"><textBox refId="DefaultPrinterSelection"><label>Default printer selection rules</label></textBox></presentation><presentation id="PrintPreviewUseSystemDefaultPrinter"/><presentation id="ProxyMode"><dropdownList refId="ProxyMode">Configure proxy server settings</dropdownList></presentation><presentation id="ProxyServer"><textBox refId="ProxyServer"><label>Configure address or URL of proxy server</label></textBox></presentation><presentation id="ProxyPacUrl"><textBox refId="ProxyPacUrl"><label>Set the proxy .pac file URL</label></textBox></presentation><presentation id="ProxyBypassList"><textBox refId="ProxyBypassList"><label>Comma-separated list of proxy bypass rules</label></textBox></presentation><presentation id="ProxySettings"><textBox refId="ProxySettings"><label>Proxy settings</label></textBox></presentation><presentation id="SmartScreenEnabled"/><presentation id="PreventSmartScreenPromptOverride"/><presentation id="PreventSmartScreenPromptOverrideForFiles"/><presentation id="SmartScreenAllowListDomains"><listBox refId="SmartScreenAllowListDomainsDesc">Configure the list of domains for which Microsoft Defender SmartScreen won't trigger warnings</listBox></presentation><presentation id="SmartScreenForTrustedDownloadsEnabled"/><presentation id="ShowHomeButton"/><presentation id="HomepageLocation"><textBox refId="HomepageLocation"><label>Home page URL</label></textBox></presentation><presentation id="HomepageIsNewTabPage"/><presentation id="NewTabPageLocation"><textBox refId="NewTabPageLocation"><label>New tab page URL</label></textBox></presentation><presentation id="NewTabPageSetFeedType"><dropdownList refId="NewTabPageSetFeedType">New tab page experience</dropdownList></presentation><presentation id="RestoreOnStartup"><dropdownList refId="RestoreOnStartup">Action to take on startup</dropdownList></presentation><presentation id="RestoreOnStartupURLs"><listBox refId="RestoreOnStartupURLsDesc">Sites to open when the browser starts</listBox></presentation><presentation id="NewTabPageCompanyLogo"><textBox refId="NewTabPageCompanyLogo"><label>New tab page company logo</label></textBox></presentation><presentation id="NewTabPageHideDefaultTopSites"/><presentation id="NewTabPageManagedQuickLinks"><textBox refId="NewTabPageManagedQuickLinks"><label>Set new tab page quick links</label></textBox></presentation><presentation id="AdsSettingForIntrusiveAdsSites"><dropdownList refId="AdsSettingForIntrusiveAdsSites">Ads setting for sites with intrusive ads</dropdownList></presentation><presentation id="AllowDeletingBrowserHistory"/><presentation id="AllowFileSelectionDialogs"/><presentation id="AllowPopupsDuringPageUnload"/><presentation id="AllowSyncXHRInPageDismissal"/><presentation id="AllowTrackingForUrls"><listBox refId="AllowTrackingForUrlsDesc">Configure tracking prevention exceptions for specific sites</listBox></presentation><presentation id="AlwaysOpenPdfExternally"/><presentation id="ApplicationLocaleValue"><textBox refId="ApplicationLocaleValue"><label>Application locale</label></textBox></presentation><presentation id="AudioCaptureAllowed"/><presentation id="AudioCaptureAllowedUrls"><listBox refId="AudioCaptureAllowedUrlsDesc">Sites that can access audio capture devices without requesting permission</listBox></presentation><presentation id="AutoImportAtFirstRun"><dropdownList refId="AutoImportAtFirstRun">Automatically import another browser's data and settings at first run</dropdownList></presentation><presentation id="AutofillAddressEnabled"/><presentation id="AutofillCreditCardEnabled"/><presentation id="AutoplayAllowed"/><presentation id="BackgroundModeEnabled"/><presentation id="BackgroundTemplateListUpdatesEnabled"/><presentation id="BlockThirdPartyCookies"/><presentation id="FavoritesBarEnabled"/><presentation id="BrowserAddProfileEnabled"/><presentation id="BrowserGuestModeEnabled"/><presentation id="BrowserNetworkTimeQueriesEnabled"/><presentation id="BrowserSignin"><dropdownList refId="BrowserSignin">Browser sign-in settings</dropdownList></presentation><presentation id="BuiltInDnsClientEnabled"/><presentation id="CertificateTransparencyEnforcementDisabledForCas"><listBox refId="CertificateTransparencyEnforcementDisabledForCasDesc">Disable Certificate Transparency enforcement for a list of subjectPublicKeyInfo hashes</listBox></presentation><presentation id="CertificateTransparencyEnforcementDisabledForLegacyCas"><listBox refId="CertificateTransparencyEnforcementDisabledForLegacyCasDesc">Disable Certificate Transparency enforcement for a list of legacy certificate authorities</listBox></presentation><presentation id="CertificateTransparencyEnforcementDisabledForUrls"><listBox refId="CertificateTransparencyEnforcementDisabledForUrlsDesc">Disable Certificate Transparency enforcement for specific URLs</listBox></presentation><presentation id="ClearBrowsingDataOnExit"/><presentation id="ClickOnceEnabled"/><presentation id="CommandLineFlagSecurityWarningsEnabled"/><presentation id="ComponentUpdatesEnabled"/><presentation id="ConfigureDoNotTrack"/><presentation id="ConfigureOnlineTextToSpeech"/><presentation id="CustomHelpLink"><textBox refId="CustomHelpLink"><label>Specify custom help link</label></textBox></presentation><presentation id="DefaultBrowserSettingEnabled"/><presentation id="DeveloperToolsAvailability"><dropdownList refId="DeveloperToolsAvailability">Control where developer tools can be used</dropdownList></presentation><presentation id="DirectInvokeEnabled"/><presentation id="Disable3DAPIs"/><presentation id="DisableScreenshots"/><presentation id="DiskCacheDir"><textBox refId="DiskCacheDir"><label>Set disk cache directory</label></textBox></presentation><presentation id="DiskCacheSize"><decimalTextBox refId="DiskCacheSize">Set disk cache size:</decimalTextBox></presentation><presentation id="DownloadDirectory"><textBox refId="DownloadDirectory"><label>Set download directory</label></textBox></presentation><presentation id="DownloadRestrictions"><dropdownList refId="DownloadRestrictions">Download restrictions</dropdownList></presentation><presentation id="EdgeCollectionsEnabled"/><presentation id="EditFavoritesEnabled"/><presentation id="EnableDeprecatedWebPlatformFeatures"><listBox refId="EnableDeprecatedWebPlatformFeaturesDesc">Re-enable deprecated web platform features for a limited time</listBox></presentation><presentation id="EnableDomainActionsDownload"/><presentation id="EnableOnlineRevocationChecks"/><presentation id="EnterpriseHardwarePlatformAPIEnabled"/><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Control communication with the Experimentation and Configuration Service</dropdownList></presentation><presentation id="ExternalProtocolDialogShowAlwaysOpenCheckbox"/><presentation id="ForceBingSafeSearch"><dropdownList refId="ForceBingSafeSearch">Enforce Bing SafeSearch</dropdownList></presentation><presentation id="ForceEphemeralProfiles"/><presentation id="ForceGoogleSafeSearch"/><presentation id="ForceNetworkInProcess"/><presentation id="ForceYouTubeRestrict"><dropdownList refId="ForceYouTubeRestrict">Force minimum YouTube Restricted Mode</dropdownList></presentation><presentation id="FullscreenAllowed"/><presentation id="GoToIntranetSiteForSingleWordEntryInAddressBar"/><presentation id="HSTSPolicyBypassList"><listBox refId="HSTSPolicyBypassListDesc">Configure the list of names that will bypass the HSTS policy check</listBox></presentation><presentation id="HardwareAccelerationModeEnabled"/><presentation id="ImportAutofillFormData"/><presentation id="ImportFavorites"/><presentation id="ImportBrowserSettings"/><presentation id="ImportHistory"/><presentation id="ImportHomepage"/><presentation id="ImportOpenTabs"/><presentation id="ImportPaymentInfo"/><presentation id="ImportSavedPasswords"/><presentation id="ImportSearchEngine"/><presentation id="InPrivateModeAvailability"><dropdownList refId="InPrivateModeAvailability">Configure InPrivate mode availability</dropdownList></presentation><presentation id="InternetExplorerIntegrationLevel"><dropdownList refId="InternetExplorerIntegrationLevel">Configure Internet Explorer integration</dropdownList></presentation><presentation id="InternetExplorerIntegrationSiteList"><textBox refId="InternetExplorerIntegrationSiteList"><label>Configure the Enterprise Mode Site List</label></textBox></presentation><presentation id="IsolateOrigins"><textBox refId="IsolateOrigins"><label>Enable site isolation for specific origins</label></textBox></presentation><presentation id="ManagedFavorites"><textBox refId="ManagedFavorites"><label>Configure favorites</label></textBox></presentation><presentation id="ManagedSearchEngines"><textBox refId="ManagedSearchEngines"><label>Manage Search Engines</label></textBox></presentation><presentation id="MaxConnectionsPerProxy"><decimalTextBox refId="MaxConnectionsPerProxy">Maximum number of concurrent connections to the proxy server:</decimalTextBox></presentation><presentation id="MediaRouterCastAllowAllIPs"/><presentation id="MetricsReportingEnabled"/><presentation id="NetworkPredictionOptions"><dropdownList refId="NetworkPredictionOptions">Enable network prediction</dropdownList></presentation><presentation id="NonRemovableProfileEnabled"/><presentation id="OverrideSecurityRestrictionsOnInsecureOrigin"><listBox refId="OverrideSecurityRestrictionsOnInsecureOriginDesc">Control where security restrictions on insecure origins apply</listBox></presentation><presentation id="ProactiveAuthEnabled"/><presentation id="PromotionalTabsEnabled"/><presentation id="PromptForDownloadLocation"/><presentation id="QuicAllowed"/><presentation id="RelaunchNotification"><dropdownList refId="RelaunchNotification">Notify a user that a browser restart is recommended or required for pending updates</dropdownList></presentation><presentation id="RelaunchNotificationPeriod"><decimalTextBox refId="RelaunchNotificationPeriod">Set the time period for update notifications:</decimalTextBox></presentation><presentation id="RendererCodeIntegrityEnabled"/><presentation id="RequireOnlineRevocationChecksForLocalAnchors"/><presentation id="ResolveNavigationErrorsUseWebService"/><presentation id="RestrictSigninToPattern"><textBox refId="RestrictSigninToPattern"><label>Restrict which accounts can be used as Microsoft Edge primary accounts</label></textBox></presentation><presentation id="RunAllFlashInAllowMode"/><presentation id="SSLErrorOverrideAllowed"/><presentation id="SSLVersionMin"><dropdownList refId="SSLVersionMin">Minimum TLS version enabled</dropdownList></presentation><presentation id="SavingBrowserHistoryDisabled"/><presentation id="SearchSuggestEnabled"/><presentation id="SecurityKeyPermitAttestation"><listBox refId="SecurityKeyPermitAttestationDesc">Websites or domains that don't need permission to use direct Security Key attestation</listBox></presentation><presentation id="SendIntranetToInternetExplorer"/><presentation id="SendSiteInfoToImproveServices"/><presentation id="ShowOfficeShortcutInFavoritesBar"/><presentation id="SignedHTTPExchangeEnabled"/><presentation id="SitePerProcess"/><presentation id="SpellcheckEnabled"/><presentation id="SpellcheckLanguage"><listBox refId="SpellcheckLanguageDesc">Enable specific spellcheck languages</listBox></presentation><presentation id="SpellcheckLanguageBlocklist"><listBox refId="SpellcheckLanguageBlocklistDesc">Force disable spellcheck languages</listBox></presentation><presentation id="SuppressUnsupportedOSWarning"/><presentation id="SyncDisabled"/><presentation id="TabFreezingEnabled"/><presentation id="TaskManagerEndProcessEnabled"/><presentation id="TrackingPrevention"><dropdownList refId="TrackingPrevention">Block tracking of users' web-browsing activity</dropdownList></presentation><presentation id="TranslateEnabled"/><presentation id="URLBlocklist"><listBox refId="URLBlocklistDesc">Block access to a list of URLs</listBox></presentation><presentation id="URLAllowlist"><listBox refId="URLAllowlistDesc">Define a list of allowed URLs</listBox></presentation><presentation id="UserDataDir"><textBox refId="UserDataDir"><label>Set the user data directory</label></textBox></presentation><presentation id="UserFeedbackAllowed"/><presentation id="VideoCaptureAllowed"/><presentation id="VideoCaptureAllowedUrls"><listBox refId="VideoCaptureAllowedUrlsDesc">Sites that can access video capture devices without requesting permission</listBox></presentation><presentation id="WPADQuickCheckEnabled"/><presentation id="WebDriverOverridesIncompatiblePolicies"/><presentation id="WebRtcLocalhostIpHandling"><dropdownList refId="WebRtcLocalhostIpHandling">Restrict exposure of local IP address by WebRTC</dropdownList></presentation><presentation id="WebRtcUdpPortRange"><textBox refId="WebRtcUdpPortRange"><label>Restrict the range of local UDP ports used by WebRTC</label></textBox></presentation></presentationTable></resources></policyDefinitionResources>
